----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.txt
  log type:  text
 opened on:  22 Nov 2013, 12:04:00

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  12:04:00  on 22 Nov 2013

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(note: file G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.cmd.txt not found)
(cmdlog G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file G:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU", `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vli
> st') vsigma(TREND)
> estimates store `model1name'_DEU_`tech_or_cost'
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "FRA", `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vli
> st') usigma(TREND) vsigma(TREND) 
> estimates store `model1name'_FRA_`tech_or_cost'
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "IRE", `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vli
> st') usigma(TREND) vsigma(TREND)
> estimates store `model1name'_IRE_`tech_or_cost'
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "UKI", `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vli
> st') usigma(TREND) vsigma(TREND)
> estimates store `model1name'_UKI_`tech_or_cost'
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if atl_plains == 1,  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vli
> st') usigma(TREND) vsigma(TREND)
> estimates store `model1name'_ATL_`tech_or_cost'
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if cont_eur == 1,    `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vli
> st') usigma(TREND) vsigma(TREND)
> estimates store `model1name'_CEU_`tech_or_cost'
> di `e(converged)'
> */
. *sfpanel `dep_vlist' `indep_vlist' France Ireland Wales TREND , cost model(bc95) d(tnormal) posthessian robust emean(`z_vl
> ist') vsigma(TREND)
. * BEST RESULT Effect on Mu parameter = -0.0054 Sigma U Parameter = 2.308268 need to figure out partial effect for this. No
> n-monotonic effect of grass.
. sfpanel lntotalspecificcosts lndairyproducts lnPTotalCattle lnPCompoundfeedingstuffsforcatt lnPFERTILISERSANDSOILIMPROVERS
>  TREND , cost model(bc95) d(tnormal) posthessian robust emean(lngrassratio lnspecial) usigma(lngrassratio lnspecial) vsigm
> a(TREND)


initial:       Log pseudolikelihood = -127529.32
Iteration 0:   Log pseudolikelihood = -127529.32  
Iteration 1:   Log pseudolikelihood = -68827.285  (backed up)
Iteration 2:   Log pseudolikelihood =  -57578.35  (backed up)
Iteration 3:   Log pseudolikelihood = -57061.161  (backed up)
Iteration 4:   Log pseudolikelihood = -54587.567  (backed up)
Iteration 5:   Log pseudolikelihood = -53533.717  (backed up)
Iteration 6:   Log pseudolikelihood = -53489.536  (backed up)
Iteration 7:   Log pseudolikelihood = -53386.514  (backed up)
Iteration 8:   Log pseudolikelihood = -53337.871  (backed up)
Iteration 9:   Log pseudolikelihood = -53285.283  (backed up)
Iteration 10:  Log pseudolikelihood = -45218.979  (backed up)
Iteration 11:  Log pseudolikelihood = -37513.474  (backed up)
Iteration 12:  Log pseudolikelihood = -33623.351  (backed up)
Iteration 13:  Log pseudolikelihood = -32881.116  (backed up)
Iteration 14:  Log pseudolikelihood = -32675.992  (backed up)
Iteration 15:  Log pseudolikelihood =     -29200  
Iteration 16:  Log pseudolikelihood = -26613.967  
Iteration 17:  Log pseudolikelihood = -22386.728  
Iteration 18:  Log pseudolikelihood = -21594.561  
Iteration 19:  Log pseudolikelihood = -21543.621  (backed up)
Iteration 20:  Log pseudolikelihood = -16691.559  
Iteration 21:  Log pseudolikelihood = -12445.742  
Iteration 22:  Log pseudolikelihood = -10694.325  
Iteration 23:  Log pseudolikelihood = -7980.9527  
Iteration 24:  Log pseudolikelihood = -7389.3241  
Iteration 25:  Log pseudolikelihood = -7235.5898  (backed up)
Iteration 26:  Log pseudolikelihood = -7214.0094  (backed up)
Iteration 27:  Log pseudolikelihood = -7212.1436  (backed up)
Iteration 28:  Log pseudolikelihood = -7210.7612  (backed up)
Iteration 29:  Log pseudolikelihood = -7210.3092  (backed up)
Iteration 30:  Log pseudolikelihood = -7210.0336  (backed up)
Iteration 31:  Log pseudolikelihood = -7209.9542  (backed up)
Iteration 32:  Log pseudolikelihood = -7209.9337  (backed up)
Iteration 33:  Log pseudolikelihood = -7209.9286  (backed up)
Iteration 34:  Log pseudolikelihood = -7209.9273  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 35:  Log pseudolikelihood = -7209.9266  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 36:  Log pseudolikelihood =  -7209.926  (backed up)
Iteration 37:  Log pseudolikelihood =  1078.2714  (backed up)
Iteration 38:  Log pseudolikelihood =   2452.594  
Iteration 39:  Log pseudolikelihood =  2736.0902  
Iteration 40:  Log pseudolikelihood =   3343.182  
Iteration 41:  Log pseudolikelihood =  3370.1725  
Iteration 42:  Log pseudolikelihood =  3430.7253  
Iteration 43:  Log pseudolikelihood =  3551.2754  
Iteration 44:  Log pseudolikelihood =  3576.5788  
Iteration 45:  Log pseudolikelihood =  3635.0632  
Iteration 46:  Log pseudolikelihood =  3657.1783  
Iteration 47:  Log pseudolikelihood =  3661.1198  
Iteration 48:  Log pseudolikelihood =   3667.269  
Iteration 49:  Log pseudolikelihood =  3698.4809  
Iteration 50:  Log pseudolikelihood =   3699.815  
Iteration 51:  Log pseudolikelihood =  3715.0157  
Iteration 52:  Log pseudolikelihood =  3721.2098  
Iteration 53:  Log pseudolikelihood =   3725.237  
Iteration 54:  Log pseudolikelihood =  3726.9294  
Iteration 55:  Log pseudolikelihood =  3727.9182  
Iteration 56:  Log pseudolikelihood =  3728.0949  
Iteration 57:  Log pseudolikelihood =  3728.2414  
Iteration 58:  Log pseudolikelihood =  3729.3149  
Iteration 59:  Log pseudolikelihood =   3731.267  
Iteration 60:  Log pseudolikelihood =   3731.384  
Iteration 61:  Log pseudolikelihood =  3731.3864  
Iteration 62:  Log pseudolikelihood =  3731.4406  
Iteration 63:  Log pseudolikelihood =  3731.8534  
Iteration 64:  Log pseudolikelihood =  3732.0719  
Iteration 65:  Log pseudolikelihood =  3732.1219  
Iteration 66:  Log pseudolikelihood =  3732.1345  
Iteration 67:  Log pseudolikelihood =  3732.1356  
Iteration 68:  Log pseudolikelihood =  3732.1356  

Inefficiency effects model (truncated-normal)        Number of obs =     25606
Group variable: pid                               Number of groups =      7001
Time variable: year                             Obs per group: min =         1
                                                               avg =       3.7
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood =  3732.1356                    Wald chi2(5)  =  31056.66

                                                    (Std. Err. adjusted for 7001 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |   1.021172   .0058682   174.02   0.000      1.00967    1.032674
                 lnPTotalCattle |   .0908232   .0384272     2.36   0.018     .0155072    .1661392
lnPCompoundfeedingstuffsforcatt |   .8211557   .0782973    10.49   0.000     .6676959    .9746156
 lnPFERTILISERSANDSOILIMPROVERS |   .3718991   .0495539     7.50   0.000     .2747753    .4690229
                          TREND |  -.0256454   .0023293   -11.01   0.000    -.0302108     -.02108
                          _cons |  -9.368743   1.519443    -6.17   0.000     -12.3468   -6.390689
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |  -.0054131   .0028567    -1.89   0.058    -.0110122     .000186
                      lnspecial |   -.854449   .0457637   -18.67   0.000    -.9441441   -.7647538
                          _cons |   5.425669   1.488719     3.64   0.000     2.507834    8.343504
--------------------------------+----------------------------------------------------------------
Usigma                          |
                   lngrassratio |   2.308268   .4753376     4.86   0.000     1.376623    3.239912
                      lnspecial |   13.88524   2.056493     6.75   0.000     9.854583    17.91589
                          _cons |  -75.53368   8.781422    -8.60   0.000    -92.74495   -58.32241
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                          TREND |   .5547151   .0123843    44.79   0.000     .5304423    .5789879
                          _cons |  -4.538382    .051596   -87.96   0.000    -4.639508   -4.437256
--------------------------------+----------------------------------------------------------------
  E(sigma_u) |   197.6849                                -186.7471     582.117
  E(sigma_v) |   .5214682                                 .5171171    .5258193
------------------------------------------------------------------------------

. 
. * Second to last run.... above is better.
. *sfpanel lntotalspecificcosts lndairyproducts lnPTotalCattle lnPCompoundfeedingstuffsforcatt lnPFERTILISERSANDSOILIMPROVER
> S TREND , cost model(bc95) d(tnormal) posthessian robust emean(lngrassratio) usigma(lngrassratio) vsigma(TREND)
. estimates store `model1name'_ALL_`tech_or_cost'

. di `e(converged)'
1

. 
. STOP!!
unrecognized command:  STOP
r(199);

end of do-file

r(199);

. di `e(converged)'
1

. predict, marginal
(6 missing values generated)
(6 missing values generated)
(3147 missing values generated)
(3147 missing values generated)
(3147 missing values generated)
(3147 missing values generated)

. sum *_M *_V

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
lngrassrat~M |     25606    182.0056    28902.71  -.0054131    4624905
 lnspecial_M |     25606    1094.022    173862.4   -.854449   2.78e+07
lngrassrat~V |     25606    8.26e+08    1.32e+11   2.42e-19   2.12e+13
 lnspecial_V |     25606    4.97e+09    7.95e+11   1.46e-18   1.27e+14

. tw scatter lngrassratio lngrassratio_M

. tw scatter lngrassratio_M lngrassratio

. tw scatter lngrassratio_M lngrassratio if lngrassratio_M < 400000

. tw scatter lngrassratio_M lngrassratio if lngrassratio_M < 4000

. tw scatter lngrassratio_M lngrassratio if lngrassratio_M < 50

. tw scatter lngrassratio_M lngrassratio if lngrassratio_M < 10

. tw scatter lngrassratio_M lngrassratio if lngrassratio_M < 1

. tw scatter lngrassratio_M lngrassratio if lngrassratio_M < .01

. tw scatter lngrassratio_M lngrassratio if lngrassratio_M < .001

. tw scatter lngrassratio_M lngrassratio if lngrassratio_M < .0000001

. tw scatter lngrassratio_M lngrassratio if lngrassratio_M < -10

. tw scatter lngrassratio_M lngrassratio if lngrassratio_M < 0

. tw scatter lngrassratio_M lngrassratio if lngrassratio_M < -.005

. tw scatter lngrassratio_M lngrassratio if lngrassratio_M < -.006

. tw scatter lngrassratio_M lngrassratio if lngrassratio_M < -.0055

. tw scatter lngrassratio_M lngrassratio if lngrassratio_M < -.0054

. tw scatter lngrassratio_M lngrassratio if lngrassratio_M < -.0055

. tw scatter lngrassratio_M lngrassratio if lngrassratio_M < -.0054

. tw scatter lngrassratio_M lngrassratio if lngrassratio_M < -.00541

. tw scatter lngrassratio_M lngrassratio if lngrassratio_M < -.005413

. tw scatter lngrassratio_M lngrassratio if lngrassratio_M < -.0054131

. count if lngrassratio_M < -.0054
25429

. count if lngrassratio_M => -.0054
=exp not allowed
r(101);

. count if lngrassratio_M >= -.0054
 3324

. count if lngrassratio_M >= 0
 3246

. count if lngrassratio_M >= 1
 3173

. count if lngrassratio_M >= 10
 3160

. count if lngrassratio_M >= 100
 3156

. count if lngrassratio_M >= 1000
 3150

. count if lngrassratio_M >= 10000
 3149

. count if lngrassratio_M >= 100000
 3148

. count if lngrassratio_M >= 1000000
 3148

. count if lngrassratio_M >= 10000000
 3147

. count if lngrassratio_M >= 100000000
 3147

. count if lngrassratio_M >= 1000000000
 3147

. count if lngrassratio_M >= 10000000000
 3147

. count if lngrassratio_M >= 100000000000
 3147

. count if lngrassratio_M >= 1000000000000
 3147

. count if lngrassratio_M >= 10000000000000
 3147

. count if lngrassratio_M >= 100000000000000
 3147

. count if lngrassratio_M >= 1000000000000000
 3147

. count if lngrassratio_M > 1000000000000000
 3147

. count if lngrassratio_M > 1000000000000000=
=exp not allowed
r(101);

. count if lngrassratio_M > 10000000000000000
 3147

. count if lngrassratio_M > 1 & lngrassratio_M <= .
 3173

. count if lngrassratio_M > 1 & lngrassratio_M < .
   26

. count if lngrassratio_M > 0 & lngrassratio_M < .
   99

. count if lngrassratio_M > 10 & lngrassratio_M < .
   13

. count if lngrassratio_M > 100 & lngrassratio_M < .
    9

. count if lngrassratio_M > 1000 & lngrassratio_M < .
    3

. sfpanel lntotalspecificcosts lndairyproducts lnPTotalCattle lnPCompoundfeedingstuffsforcatt lnPFERTILISERSANDSOILIMPROVERS
>  TREND if lngrassratio_M <= 1, cost model(bc95) d(tnormal) posthessian robust emean(lngrassratio lnspecial) usigma(lngrass
> ratio lnspecial) vsigma(TREND)


initial:       Log pseudolikelihood = -127390.68
Iteration 0:   Log pseudolikelihood = -127390.68  
Iteration 1:   Log pseudolikelihood = -68728.779  (backed up)
Iteration 2:   Log pseudolikelihood = -57477.752  (backed up)
Iteration 3:   Log pseudolikelihood =  -56967.64  (backed up)
Iteration 4:   Log pseudolikelihood = -54509.423  (backed up)
Iteration 5:   Log pseudolikelihood = -53466.071  (backed up)
Iteration 6:   Log pseudolikelihood = -53424.524  (backed up)
Iteration 7:   Log pseudolikelihood = -53292.482  (backed up)
Iteration 8:   Log pseudolikelihood = -53252.958  (backed up)
Iteration 9:   Log pseudolikelihood = -53247.698  (backed up)
Iteration 10:  Log pseudolikelihood = -44534.674  
Iteration 11:  Log pseudolikelihood =  -39117.17  
Iteration 12:  Log pseudolikelihood = -38836.706  
Iteration 13:  Log pseudolikelihood = -37553.036  (backed up)
Iteration 14:  Log pseudolikelihood = -36538.019  (backed up)
Iteration 15:  Log pseudolikelihood =  -36481.21  (backed up)
Iteration 16:  Log pseudolikelihood = -36466.906  (backed up)
Iteration 17:  Log pseudolikelihood = -36466.906  (backed up)
Iteration 18:  Log pseudolikelihood = -36466.906  (backed up)
Iteration 19:  Log pseudolikelihood = -36466.906  (backed up)
Iteration 20:  Log pseudolikelihood = -36440.789  (backed up)
Iteration 21:  Log pseudolikelihood = -36440.789  (backed up)
Iteration 22:  Log pseudolikelihood = -36440.789  (backed up)
Iteration 23:  Log pseudolikelihood = -36440.749  (backed up)
Iteration 24:  Log pseudolikelihood = -36440.749  (backed up)
Iteration 25:  Log pseudolikelihood = -35383.626  
Iteration 26:  Log pseudolikelihood = -35383.626  (backed up)
Iteration 27:  Log pseudolikelihood = -35355.924  
Iteration 28:  Log pseudolikelihood = -35355.924  (backed up)
Iteration 29:  Log pseudolikelihood = -35355.924  (backed up)
Iteration 30:  Log pseudolikelihood = -35355.924  (backed up)
Iteration 31:  Log pseudolikelihood = -35355.924  (backed up)
Iteration 32:  Log pseudolikelihood = -35355.924  (backed up)
Iteration 33:  Log pseudolikelihood = -35196.692  
Iteration 34:  Log pseudolikelihood = -35124.086  
Iteration 35:  Log pseudolikelihood = -35124.086  (backed up)
Iteration 36:  Log pseudolikelihood = -34887.514  
Iteration 37:  Log pseudolikelihood = -34357.447  
Iteration 38:  Log pseudolikelihood = -34353.857  (backed up)
Iteration 39:  Log pseudolikelihood = -32845.572  
Iteration 40:  Log pseudolikelihood = -32343.915  
Iteration 41:  Log pseudolikelihood = -30898.767  
Iteration 42:  Log pseudolikelihood = -30820.801  
Iteration 43:  Log pseudolikelihood =  -30781.63  (backed up)
Iteration 44:  Log pseudolikelihood = -30776.542  (backed up)
Iteration 45:  Log pseudolikelihood =  -30775.29  (backed up)
Iteration 46:  Log pseudolikelihood = -30774.989  (backed up)
Iteration 47:  Log pseudolikelihood = -30774.845  (backed up)
Iteration 48:  Log pseudolikelihood = -30774.777  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 49:  Log pseudolikelihood = -30774.745  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 50:  Log pseudolikelihood =  -30774.73  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 51:  Log pseudolikelihood = -30774.723  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 52:  Log pseudolikelihood = -30774.723  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 53:  Log pseudolikelihood = -30774.723  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 54:  Log pseudolikelihood = -30774.723  (backed up)
Iteration 55:  Log pseudolikelihood = -30770.953  
Iteration 56:  Log pseudolikelihood = -30770.953  (backed up)
Iteration 57:  Log pseudolikelihood = -30770.953  (backed up)
Iteration 58:  Log pseudolikelihood = -30762.424  
Iteration 59:  Log pseudolikelihood = -30723.953  (backed up)
Iteration 60:  Log pseudolikelihood = -30703.608  (backed up)
Iteration 61:  Log pseudolikelihood =  -30697.14  (backed up)
Iteration 62:  Log pseudolikelihood = -30693.748  (backed up)
Iteration 63:  Log pseudolikelihood = -30692.021  (backed up)
Iteration 64:  Log pseudolikelihood = -30691.584  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 65:  Log pseudolikelihood = -30691.529  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 66:  Log pseudolikelihood = -30691.525  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 67:  Log pseudolikelihood = -30691.523  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 68:  Log pseudolikelihood = -30691.523  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 69:  Log pseudolikelihood = -30691.522  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 70:  Log pseudolikelihood = -30691.522  (backed up)
Iteration 71:  Log pseudolikelihood = -30422.253  
Iteration 72:  Log pseudolikelihood = -30118.422  
Iteration 73:  Log pseudolikelihood =  -30086.67  
Iteration 74:  Log pseudolikelihood =  -30086.67  (backed up)
Iteration 75:  Log pseudolikelihood = -30086.668  (backed up)
Iteration 76:  Log pseudolikelihood = -30082.854  
Iteration 77:  Log pseudolikelihood = -30070.713  
Iteration 78:  Log pseudolikelihood = -30070.521  
Iteration 79:  Log pseudolikelihood = -30070.521  (backed up)
Iteration 80:  Log pseudolikelihood = -30070.295  (backed up)
Iteration 81:  Log pseudolikelihood = -30065.844  
Iteration 82:  Log pseudolikelihood = -30050.153  
Iteration 83:  Log pseudolikelihood = -30030.011  
Iteration 84:  Log pseudolikelihood =  -30023.18  
Iteration 85:  Log pseudolikelihood = -30006.276  
Iteration 86:  Log pseudolikelihood = -29981.576  
Iteration 87:  Log pseudolikelihood = -29977.717  
Iteration 88:  Log pseudolikelihood = -29976.586  (backed up)
Iteration 89:  Log pseudolikelihood = -29976.556  (backed up)
Iteration 90:  Log pseudolikelihood = -29976.546  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 91:  Log pseudolikelihood = -29976.539  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 92:  Log pseudolikelihood = -29976.539  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 93:  Log pseudolikelihood = -29976.538  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 94:  Log pseudolikelihood = -29976.538  (backed up)
Iteration 95:  Log pseudolikelihood =  -29969.95  
Iteration 96:  Log pseudolikelihood =  -29969.95  (backed up)
Iteration 97:  Log pseudolikelihood = -29942.465  (backed up)
Iteration 98:  Log pseudolikelihood = -29940.664  (backed up)
Iteration 99:  Log pseudolikelihood = -29939.731  (backed up)
Iteration 100: Log pseudolikelihood = -29939.229  (backed up)

Inefficiency effects model (truncated-normal)        Number of obs =     25580
Group variable: pid                               Number of groups =      6994
Time variable: year                             Obs per group: min =         1
                                                               avg =       3.7
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood = -2.994e+04                    Wald chi2(4)  =  5.98e+09

                                                    (Std. Err. adjusted for 6994 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |   1.196974   .0110754   108.07   0.000     1.175267    1.218682
                 lnPTotalCattle |  -6.553821   .1838355   -35.65   0.000    -6.914132    -6.19351
lnPCompoundfeedingstuffsforcatt |  -20.93307          .        .       .            .           .
 lnPFERTILISERSANDSOILIMPROVERS |   31.35306   .0318825   983.39   0.000     31.29057    31.41555
                          TREND |  -1.033325   .0125697   -82.21   0.000    -1.057961   -1.008689
                          _cons |  -50.74812          .        .       .            .           .
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |   .7091256          .        .       .            .           .
                      lnspecial |  -2.653255          .        .       .            .           .
                          _cons |   8.097994          .        .       .            .           .
--------------------------------+----------------------------------------------------------------
Usigma                          |
                   lngrassratio |  -.4114952   .0333332   -12.34   0.000    -.4768271   -.3461633
                      lnspecial |   3.337511   .4043525     8.25   0.000     2.544995    4.130027
                          _cons |  -18.24302    1.77941   -10.25   0.000     -21.7306   -14.75545
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                          TREND |   .7806773   .0139282    56.05   0.000     .7533785    .8079761
                          _cons |  -2.276328   .0519323   -43.83   0.000    -2.378113   -2.174542
--------------------------------+----------------------------------------------------------------
  E(sigma_u) |   .1066149                                 .1060008     .107229
  E(sigma_v) |   3.522384                                  3.48264    3.562128
------------------------------------------------------------------------------

. di `e(converged)'
0

. do msward_2013_11_21_cost.do

. * Based on msward_code_clarity.do
. capture log close
----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.txt
  log type:  text
 opened on:  22 Nov 2013, 13:17:00

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  13:17:00  on 22 Nov 2013

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(cmdlog G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file G:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU", `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vli
> st') vsigma(TREND)
> estimates store `model1name'_DEU_`tech_or_cost'
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "FRA", `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vli
> st') usigma(TREND) vsigma(TREND) 
> estimates store `model1name'_FRA_`tech_or_cost'
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "IRE", `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vli
> st') usigma(TREND) vsigma(TREND)
> estimates store `model1name'_IRE_`tech_or_cost'
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "UKI", `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vli
> st') usigma(TREND) vsigma(TREND)
> estimates store `model1name'_UKI_`tech_or_cost'
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if atl_plains == 1,  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vli
> st') usigma(TREND) vsigma(TREND)
> estimates store `model1name'_ATL_`tech_or_cost'
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if cont_eur == 1,    `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vli
> st') usigma(TREND) vsigma(TREND)
> estimates store `model1name'_CEU_`tech_or_cost'
> di `e(converged)'
> */
. *sfpanel `dep_vlist' `indep_vlist' France Ireland Wales TREND , cost model(bc95) d(tnormal) posthessian robust emean(`z_vl
> ist') vsigma(TREND)
. * BEST RESULT Effect on Mu parameter = -0.0054 Sigma U Parameter = 2.308268 need to figure out partial effect for this. No
> n-monotonic effect of grass.
. *sfpanel lntotalspecificcosts lndairyproducts lnPTotalCattle lnPCompoundfeedingstuffsforcatt lnPFERTILISERSANDSOILIMPROVER
> S TREND , cost model(bc95) d(tnormal) posthessian robust emean(lngrassratio lnspecial) usigma(lngrassratio lnspecial) vsig
> ma(TREND)
. 
. sfpanel `dep_vlist' `indep_vlist' TREND , cost model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usigma(`z_vlist'
> ) vsigma(TREND)


initial:       Log pseudolikelihood = -402764.04
Iteration 0:   Log pseudolikelihood = -402764.04  
could not calculate numerical derivatives -- discontinuous region with missing values encountered
could not calculate numerical derivatives -- discontinuous region with missing values encountered
estimates post: matrix has missing values
r(504);

end of do-file

r(504);

. do msward_2013_11_21_cost.do

. * Based on msward_code_clarity.do
. capture log close
----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.txt
  log type:  text
 opened on:  22 Nov 2013, 13:23:24

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  13:23:24  on 22 Nov 2013

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(cmdlog G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file G:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU", `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vli
> st') vsigma(TREND)
> estimates store `model1name'_DEU_`tech_or_cost'
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "FRA", `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vli
> st') usigma(TREND) vsigma(TREND) 
> estimates store `model1name'_FRA_`tech_or_cost'
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "IRE", `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vli
> st') usigma(TREND) vsigma(TREND)
> estimates store `model1name'_IRE_`tech_or_cost'
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "UKI", `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vli
> st') usigma(TREND) vsigma(TREND)
> estimates store `model1name'_UKI_`tech_or_cost'
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if atl_plains == 1,  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vli
> st') usigma(TREND) vsigma(TREND)
> estimates store `model1name'_ATL_`tech_or_cost'
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if cont_eur == 1,    `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vli
> st') usigma(TREND) vsigma(TREND)
> estimates store `model1name'_CEU_`tech_or_cost'
> di `e(converged)'
> */
. *sfpanel `dep_vlist' `indep_vlist' France Ireland Wales TREND , cost model(bc95) d(tnormal) posthessian robust emean(`z_vl
> ist') vsigma(TREND)
. * BEST RESULT Effect on Mu parameter = -0.0054 Sigma U Parameter = 2.308268 need to figure out partial effect for this. No
> n-monotonic effect of grass.
. *sfpanel lntotalspecificcosts lndairyproducts lnPTotalCattle lnPCompoundfeedingstuffsforcatt lnPFERTILISERSANDSOILIMPROVER
> S TREND , cost model(bc95) d(tnormal) posthessian robust emean(lngrassratio lnspecial) usigma(lngrassratio lnspecial) vsig
> ma(TREND)
. 
. sfpanel `dep_vlist' `indep_vlist' TREND , cost model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usigma(`z_vlist'
> ) vsigma(TREND)


initial:       Log pseudolikelihood = -127529.32
Iteration 0:   Log pseudolikelihood = -127529.32  
Iteration 1:   Log pseudolikelihood = -68827.285  (backed up)
Iteration 2:   Log pseudolikelihood =  -57578.35  (backed up)
Iteration 3:   Log pseudolikelihood = -57061.161  (backed up)
Iteration 4:   Log pseudolikelihood = -54587.567  (backed up)
Iteration 5:   Log pseudolikelihood = -53533.717  (backed up)
Iteration 6:   Log pseudolikelihood = -53489.536  (backed up)
Iteration 7:   Log pseudolikelihood = -53386.514  (backed up)
Iteration 8:   Log pseudolikelihood = -53337.871  (backed up)
Iteration 9:   Log pseudolikelihood = -53285.283  (backed up)
Iteration 10:  Log pseudolikelihood = -45218.979  (backed up)
Iteration 11:  Log pseudolikelihood = -37513.474  (backed up)
Iteration 12:  Log pseudolikelihood = -33623.351  (backed up)
Iteration 13:  Log pseudolikelihood = -32881.116  (backed up)
Iteration 14:  Log pseudolikelihood = -32675.992  (backed up)
Iteration 15:  Log pseudolikelihood =     -29200  
Iteration 16:  Log pseudolikelihood = -26613.967  
Iteration 17:  Log pseudolikelihood = -22386.728  
Iteration 18:  Log pseudolikelihood = -21594.561  
Iteration 19:  Log pseudolikelihood = -21543.621  (backed up)
Iteration 20:  Log pseudolikelihood = -16691.559  
Iteration 21:  Log pseudolikelihood = -12445.742  
Iteration 22:  Log pseudolikelihood = -10694.325  
Iteration 23:  Log pseudolikelihood = -7980.9527  
Iteration 24:  Log pseudolikelihood = -7389.3241  
Iteration 25:  Log pseudolikelihood = -7235.5898  (backed up)
Iteration 26:  Log pseudolikelihood = -7214.0094  (backed up)
Iteration 27:  Log pseudolikelihood = -7212.1436  (backed up)
Iteration 28:  Log pseudolikelihood = -7210.7612  (backed up)
Iteration 29:  Log pseudolikelihood = -7210.3092  (backed up)
Iteration 30:  Log pseudolikelihood = -7210.0336  (backed up)
Iteration 31:  Log pseudolikelihood = -7209.9542  (backed up)
Iteration 32:  Log pseudolikelihood = -7209.9337  (backed up)
Iteration 33:  Log pseudolikelihood = -7209.9286  (backed up)
Iteration 34:  Log pseudolikelihood = -7209.9273  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 35:  Log pseudolikelihood = -7209.9266  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 36:  Log pseudolikelihood =  -7209.926  (backed up)
Iteration 37:  Log pseudolikelihood =  1078.2714  (backed up)
Iteration 38:  Log pseudolikelihood =   2452.594  
Iteration 39:  Log pseudolikelihood =  2736.0902  
Iteration 40:  Log pseudolikelihood =   3343.182  
Iteration 41:  Log pseudolikelihood =  3370.1725  
Iteration 42:  Log pseudolikelihood =  3430.7253  
Iteration 43:  Log pseudolikelihood =  3551.2754  
Iteration 44:  Log pseudolikelihood =  3576.5788  
Iteration 45:  Log pseudolikelihood =  3635.0632  
Iteration 46:  Log pseudolikelihood =  3657.1783  
Iteration 47:  Log pseudolikelihood =  3661.1198  
Iteration 48:  Log pseudolikelihood =   3667.269  
Iteration 49:  Log pseudolikelihood =  3698.4809  
Iteration 50:  Log pseudolikelihood =   3699.815  
Iteration 51:  Log pseudolikelihood =  3715.0157  
Iteration 52:  Log pseudolikelihood =  3721.2098  
Iteration 53:  Log pseudolikelihood =   3725.237  
Iteration 54:  Log pseudolikelihood =  3726.9294  
Iteration 55:  Log pseudolikelihood =  3727.9182  
Iteration 56:  Log pseudolikelihood =  3728.0949  
Iteration 57:  Log pseudolikelihood =  3728.2414  
Iteration 58:  Log pseudolikelihood =  3729.3149  
Iteration 59:  Log pseudolikelihood =   3731.267  
Iteration 60:  Log pseudolikelihood =   3731.384  
Iteration 61:  Log pseudolikelihood =  3731.3864  
Iteration 62:  Log pseudolikelihood =  3731.4406  
Iteration 63:  Log pseudolikelihood =  3731.8534  
Iteration 64:  Log pseudolikelihood =  3732.0719  
Iteration 65:  Log pseudolikelihood =  3732.1219  
Iteration 66:  Log pseudolikelihood =  3732.1345  
Iteration 67:  Log pseudolikelihood =  3732.1356  
Iteration 68:  Log pseudolikelihood =  3732.1356  

Inefficiency effects model (truncated-normal)        Number of obs =     25606
Group variable: pid                               Number of groups =      7001
Time variable: year                             Obs per group: min =         1
                                                               avg =       3.7
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood =  3732.1356                    Wald chi2(5)  =  31056.66

                                                    (Std. Err. adjusted for 7001 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |   1.021172   .0058682   174.02   0.000      1.00967    1.032674
                 lnPTotalCattle |   .0908232   .0384272     2.36   0.018     .0155072    .1661392
lnPCompoundfeedingstuffsforcatt |   .8211557   .0782973    10.49   0.000     .6676959    .9746156
 lnPFERTILISERSANDSOILIMPROVERS |   .3718991   .0495539     7.50   0.000     .2747753    .4690229
                          TREND |  -.0256454   .0023293   -11.01   0.000    -.0302108     -.02108
                          _cons |  -9.368743   1.519443    -6.17   0.000     -12.3468   -6.390689
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |  -.0054131   .0028567    -1.89   0.058    -.0110122     .000186
                      lnspecial |   -.854449   .0457637   -18.67   0.000    -.9441441   -.7647538
                          _cons |   5.425669   1.488719     3.64   0.000     2.507834    8.343504
--------------------------------+----------------------------------------------------------------
Usigma                          |
                   lngrassratio |   2.308268   .4753376     4.86   0.000     1.376623    3.239912
                      lnspecial |   13.88524   2.056493     6.75   0.000     9.854583    17.91589
                          _cons |  -75.53368   8.781422    -8.60   0.000    -92.74495   -58.32241
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                          TREND |   .5547151   .0123843    44.79   0.000     .5304423    .5789879
                          _cons |  -4.538382    .051596   -87.96   0.000    -4.639508   -4.437256
--------------------------------+----------------------------------------------------------------
  E(sigma_u) |   197.6849                                -186.7471     582.117
  E(sigma_v) |   .5214682                                 .5171171    .5258193
------------------------------------------------------------------------------

. 
. * Second to last run.... above is better.
. *sfpanel lntotalspecificcosts lndairyproducts lnPTotalCattle lnPCompoundfeedingstuffsforcatt lnPFERTILISERSANDSOILIMPROVER
> S TREND , cost model(bc95) d(tnormal) posthessian robust emean(lngrassratio) usigma(lngrassratio) vsigma(TREND)
. estimates store `model1name'_ALL_`tech_or_cost'

. di `e(converged)'
1

. 
. STOP!!
unrecognized command:  STOP
r(199);

end of do-file

r(199);

. di `e(hessian)'
matrix not found
r(111);

. matrix liste(hessian)
matrix operation not found
r(501);

. matrix list e(hessian)

symmetric e(hessian)[14,14]
             c1          c2          c3          c4          c5          c6          c7          c8          c9         c10
 r1   -54086024
 r2   283739.31  -2585.8331
 r3   -19873953   104535.97  -7327873.9
 r4   -19904770   103993.47  -7339535.7  -7352630.9
 r5  -9873683.2   31835.529  -3649265.4  -3685705.1  -2717526.6
 r6  -4311200.6   22763.989  -1589571.1  -1591967.9   -787584.8  -344843.05
 r7   -10634327   56471.783  -3958906.8    -3965883  -1974738.9  -858872.29  -2720022.2
 r8   -18915260   99717.504  -6969824.3  -6980521.3  -3458634.9  -1511987.6  -3755473.4  -6636612.4
 r9    -4311048    22763.57  -1589508.6  -1591904.6  -787523.37  -344829.65  -858836.48  -1511940.5  -344819.83
r10  -4541.4438   28.621022  -1506.9158  -1484.9535  -741.54336  -328.29402  -544.58013  -1730.3666  -335.02879  -2079.3823
r11  -9784.7949   59.226666  -3400.4399  -3371.4031  -1527.1814  -739.74536  -1730.3666  -3677.9922  -749.33051  -2538.9074
r12  -1994.6254   12.106451  -688.01514  -681.57477  -309.91791  -149.68823  -335.02879  -749.33051  -151.70079  -561.26658
r13  -52.007524  -87.319913   1606.6778   992.45567  -3871.5169   289.58544   1297.6906   1156.9322   267.15181  -4173.7015
r14   1950.9881  -12.119461    670.3971   663.54107   289.58544   145.90764   294.34348   697.60707   140.92391  -1790.7548

            c11         c12         c13         c14
r11  -3164.7274
r12  -698.72026  -154.35936
r13  -5180.6492  -1150.8952  -107860.82
r14  -2266.3554  -504.79654  -28707.851  -11632.757

. di 1/1.021172
.97926696

. lincom lndairyproducts -1

 ( 1)  [Frontier]lndairyproducts = 1

------------------------------------------------------------------------------
lntotalspe~s |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .021172   .0058682     3.61   0.000     .0096705    .0326735
------------------------------------------------------------------------------

. do msward_2013_11_21_cost.do

. * Based on msward_code_clarity.do
. capture log close
----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.txt
  log type:  text
 opened on:  22 Nov 2013, 13:58:02

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  13:58:02  on 22 Nov 2013

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(cmdlog G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file G:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU", `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vli
> st') vsigma(TREND)
> estimates store `model1name'_DEU_`tech_or_cost'
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "FRA", `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vli
> st') usigma(TREND) vsigma(TREND) 
> estimates store `model1name'_FRA_`tech_or_cost'
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "IRE", `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vli
> st') usigma(TREND) vsigma(TREND)
> estimates store `model1name'_IRE_`tech_or_cost'
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "UKI", `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vli
> st') usigma(TREND) vsigma(TREND)
> estimates store `model1name'_UKI_`tech_or_cost'
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if atl_plains == 1,  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vli
> st') usigma(TREND) vsigma(TREND)
> estimates store `model1name'_ATL_`tech_or_cost'
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if cont_eur == 1,    `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vli
> st') usigma(TREND) vsigma(TREND)
> estimates store `model1name'_CEU_`tech_or_cost'
> di `e(converged)'
> */
. *sfpanel `dep_vlist' `indep_vlist' France Ireland Wales TREND , cost model(bc95) d(tnormal) posthessian robust emean(`z_vl
> ist') vsigma(TREND)
. * BEST RESULT Effect on Mu parameter = -0.0054 Sigma U Parameter = 2.308268 need to figure out partial effect for this. No
> n-monotonic effect of grass.
. *sfpanel lntotalspecificcosts lndairyproducts lnPTotalCattle lnPCompoundfeedingstuffsforcatt lnPFERTILISERSANDSOILIMPROVER
> S TREND , cost model(bc95) d(tnormal) posthessian robust emean(lngrassratio lnspecial) usigma(lngrassratio lnspecial) vsig
> ma(TREND)
. 
. sfpanel `dep_vlist' `indep_vlist' TREND , cost model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usigma(`z_vlist'
> ) vsigma(TREND)


initial:       Log pseudolikelihood =  -127539.4
Iteration 0:   Log pseudolikelihood =  -127539.4  
Iteration 1:   Log pseudolikelihood = -69092.505  (backed up)
Iteration 2:   Log pseudolikelihood = -57690.764  (backed up)
Iteration 3:   Log pseudolikelihood = -57191.073  (backed up)
Iteration 4:   Log pseudolikelihood = -54661.926  (backed up)
Iteration 5:   Log pseudolikelihood = -53612.941  (backed up)
Iteration 6:   Log pseudolikelihood = -53559.301  (backed up)
Iteration 7:   Log pseudolikelihood = -53397.603  (backed up)
Iteration 8:   Log pseudolikelihood = -53170.406  (backed up)
Iteration 9:   Log pseudolikelihood = -52871.616  (backed up)
Iteration 10:  Log pseudolikelihood = -50083.027  (backed up)
Iteration 11:  Log pseudolikelihood = -50053.604  (backed up)
Iteration 12:  Log pseudolikelihood = -48902.955  
Iteration 13:  Log pseudolikelihood = -48872.657  
Iteration 14:  Log pseudolikelihood = -48872.657  (backed up)
Iteration 15:  Log pseudolikelihood = -45856.824  (backed up)
Iteration 16:  Log pseudolikelihood = -45586.955  (backed up)
Iteration 17:  Log pseudolikelihood = -45586.955  (backed up)
Iteration 18:  Log pseudolikelihood = -45450.617  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 19:  Log pseudolikelihood = -45450.617  (backed up)
Iteration 20:  Log pseudolikelihood =  -45031.95  (backed up)
Iteration 21:  Log pseudolikelihood =  -45007.08  (backed up)
Iteration 22:  Log pseudolikelihood = -44995.105  (backed up)
Iteration 23:  Log pseudolikelihood = -40622.825  (backed up)
Iteration 24:  Log pseudolikelihood = -40580.847  (backed up)
Iteration 25:  Log pseudolikelihood = -40513.803  (backed up)
Iteration 26:  Log pseudolikelihood = -40505.305  (backed up)
Iteration 27:  Log pseudolikelihood = -40447.738  (backed up)
Iteration 28:  Log pseudolikelihood = -40447.377  (backed up)
Iteration 29:  Log pseudolikelihood = -40446.819  (backed up)
Iteration 30:  Log pseudolikelihood = -40446.819  (backed up)
Iteration 31:  Log pseudolikelihood = -40379.438  (backed up)
Iteration 32:  Log pseudolikelihood = -40180.946  
Iteration 33:  Log pseudolikelihood = -38703.274  
Iteration 34:  Log pseudolikelihood = -35627.683  
Iteration 35:  Log pseudolikelihood =  -32858.97  
Iteration 36:  Log pseudolikelihood = -32357.942  (backed up)
Iteration 37:  Log pseudolikelihood = -32259.371  (backed up)
Iteration 38:  Log pseudolikelihood = -32244.355  (backed up)
Iteration 39:  Log pseudolikelihood = -32241.972  (backed up)
Iteration 40:  Log pseudolikelihood = -32240.242  (backed up)
Iteration 41:  Log pseudolikelihood = -32240.178  (backed up)
Iteration 42:  Log pseudolikelihood = -32240.154  (backed up)
Iteration 43:  Log pseudolikelihood =  -32240.15  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 44:  Log pseudolikelihood = -32240.148  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 45:  Log pseudolikelihood = -32240.148  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 46:  Log pseudolikelihood = -32240.148  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 47:  Log pseudolikelihood = -32240.148  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 48:  Log pseudolikelihood = -32240.148  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 49:  Log pseudolikelihood = -32240.148  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 50:  Log pseudolikelihood = -32240.148  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 51:  Log pseudolikelihood = -32240.148  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 52:  Log pseudolikelihood = -32240.148  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 53:  Log pseudolikelihood = -32240.148  (backed up)
Iteration 54:  Log pseudolikelihood = -30876.876  
Iteration 55:  Log pseudolikelihood = -29715.838  
Iteration 56:  Log pseudolikelihood = -28567.994  
Iteration 57:  Log pseudolikelihood = -27480.666  (backed up)
Iteration 58:  Log pseudolikelihood = -20282.728  
Iteration 59:  Log pseudolikelihood = -11871.087  
Iteration 60:  Log pseudolikelihood = -7071.1859  
Iteration 61:  Log pseudolikelihood = -5678.4956  
Iteration 62:  Log pseudolikelihood = -5210.7156  
Iteration 63:  Log pseudolikelihood = -4939.7462  
Iteration 64:  Log pseudolikelihood = -4894.7861  (backed up)
Iteration 65:  Log pseudolikelihood = -4891.7633  (backed up)
Iteration 66:  Log pseudolikelihood = -4890.0671  (backed up)
Iteration 67:  Log pseudolikelihood = -4889.8355  (backed up)
Iteration 68:  Log pseudolikelihood = -4889.7108  (backed up)
Iteration 69:  Log pseudolikelihood = -4889.6441  (backed up)
Iteration 70:  Log pseudolikelihood = -4889.6353  (backed up)
Iteration 71:  Log pseudolikelihood = -4889.6259  (backed up)
Iteration 72:  Log pseudolikelihood = -1172.7196  
Iteration 73:  Log pseudolikelihood = -55.634137  
Iteration 74:  Log pseudolikelihood =  456.35856  
Iteration 75:  Log pseudolikelihood =  873.21761  
Iteration 76:  Log pseudolikelihood =  896.51072  
Iteration 77:  Log pseudolikelihood =  900.71391  (backed up)
Iteration 78:  Log pseudolikelihood =  903.00585  (backed up)
Iteration 79:  Log pseudolikelihood =  904.15759  (backed up)
Iteration 80:  Log pseudolikelihood =  904.44644  (backed up)
Iteration 81:  Log pseudolikelihood =  904.59148  (backed up)
Iteration 82:  Log pseudolikelihood =  904.66451  (backed up)
Iteration 83:  Log pseudolikelihood =  904.66906  (backed up)
Iteration 84:  Log pseudolikelihood =  904.67152  (backed up)
Iteration 85:  Log pseudolikelihood =  904.67183  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 86:  Log pseudolikelihood =  904.67197  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 87:  Log pseudolikelihood =  904.67202  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 88:  Log pseudolikelihood =  904.67203  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 89:  Log pseudolikelihood =  904.67203  (backed up)
could not calculate numerical derivatives -- discontinuous region with missing values encountered
could not calculate numerical derivatives -- discontinuous region with missing values encountered
estimates post: matrix has missing values
r(504);

end of do-file

r(504);

. do msward_2013_11_22_cost.do

. * Based on msward_code_clarity.do
. capture log close
----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.txt
  log type:  text
 opened on:  22 Nov 2013, 14:08:16

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  14:08:16  on 22 Nov 2013

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(cmdlog G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file G:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU",  cost model(bc95) d(tnormal) posthessian robust emean(`z_vlis
> t') usigma(`z_vlist') vsigma(TREND)


initial:       Log pseudolikelihood = -66396.332
Iteration 0:   Log pseudolikelihood = -66396.332  
Iteration 1:   Log pseudolikelihood = -34506.552  (backed up)
Iteration 2:   Log pseudolikelihood = -29757.324  (backed up)
Iteration 3:   Log pseudolikelihood = -28954.692  (backed up)
Iteration 4:   Log pseudolikelihood = -28514.349  (backed up)
Iteration 5:   Log pseudolikelihood = -28338.804  (backed up)
Iteration 6:   Log pseudolikelihood = -28331.201  (backed up)
Iteration 7:   Log pseudolikelihood = -28202.833  (backed up)
Iteration 8:   Log pseudolikelihood = -27456.787  (backed up)
Iteration 9:   Log pseudolikelihood = -27038.418  (backed up)
Iteration 10:  Log pseudolikelihood = -25526.676  (backed up)
Iteration 11:  Log pseudolikelihood =  -21506.91  
Iteration 12:  Log pseudolikelihood = -20202.621  (backed up)
Iteration 13:  Log pseudolikelihood = -18272.707  
Iteration 14:  Log pseudolikelihood = -15340.757  
Iteration 15:  Log pseudolikelihood = -14652.859  (backed up)
Iteration 16:  Log pseudolikelihood = -14587.986  (backed up)
Iteration 17:  Log pseudolikelihood = -6241.1917  
Iteration 18:  Log pseudolikelihood = -5481.4936  
Iteration 19:  Log pseudolikelihood = -4547.5998  
Iteration 20:  Log pseudolikelihood = -4272.5234  
Iteration 21:  Log pseudolikelihood = -3682.4736  
Iteration 22:  Log pseudolikelihood = -2620.5176  
Iteration 23:  Log pseudolikelihood = -1966.4358  
Iteration 24:  Log pseudolikelihood =  -1930.623  (backed up)
Iteration 25:  Log pseudolikelihood = -1873.1133  (backed up)
Iteration 26:  Log pseudolikelihood = -1858.2887  (backed up)
Iteration 27:  Log pseudolikelihood = -1855.6886  (backed up)
Iteration 28:  Log pseudolikelihood = -1855.4766  (backed up)
Iteration 29:  Log pseudolikelihood = -1855.3086  (backed up)
Iteration 30:  Log pseudolikelihood = -1855.2979  (backed up)
Iteration 31:  Log pseudolikelihood = -1855.2975  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 32:  Log pseudolikelihood = -1855.2973  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 33:  Log pseudolikelihood = -1855.2973  (backed up)
Iteration 34:  Log pseudolikelihood =   184.2202  
Iteration 35:  Log pseudolikelihood =  226.25951  (backed up)
Iteration 36:  Log pseudolikelihood =  226.25951  (backed up)
Iteration 37:  Log pseudolikelihood =  229.62469  (backed up)
Iteration 38:  Log pseudolikelihood =  229.62469  (backed up)
Iteration 39:  Log pseudolikelihood =  230.40663  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 40:  Log pseudolikelihood =  230.40663  (backed up)
Iteration 41:  Log pseudolikelihood =  230.81343  (backed up)
Iteration 42:  Log pseudolikelihood =  230.81452  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 43:  Log pseudolikelihood =  230.82827  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 44:  Log pseudolikelihood =  230.82829  (backed up)
Iteration 45:  Log pseudolikelihood =  332.27201  (backed up)
Iteration 46:  Log pseudolikelihood =  392.31022  (backed up)
Iteration 47:  Log pseudolikelihood =  446.54016  (backed up)
Iteration 48:  Log pseudolikelihood =    450.504  (backed up)
Iteration 49:  Log pseudolikelihood =  451.13031  (backed up)
Iteration 50:  Log pseudolikelihood =  539.22159  
Iteration 51:  Log pseudolikelihood =  622.58426  (backed up)
Iteration 52:  Log pseudolikelihood =  875.25826  
Iteration 53:  Log pseudolikelihood =   1620.961  
Iteration 54:  Log pseudolikelihood =  1875.6087  
Iteration 55:  Log pseudolikelihood =  1939.1132  
Iteration 56:  Log pseudolikelihood =  1977.4045  
Iteration 57:  Log pseudolikelihood =  1983.3567  
Iteration 58:  Log pseudolikelihood =  1993.3591  
Iteration 59:  Log pseudolikelihood =  1998.8035  
Iteration 60:  Log pseudolikelihood =   2009.185  
Iteration 61:  Log pseudolikelihood =  2011.0524  
Iteration 62:  Log pseudolikelihood =  2011.4865  
Iteration 63:  Log pseudolikelihood =  2011.5187  (backed up)
Iteration 64:  Log pseudolikelihood =  2011.5381  (backed up)
Iteration 65:  Log pseudolikelihood =  2011.5433  (backed up)
Iteration 66:  Log pseudolikelihood =  2011.5459  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 67:  Log pseudolikelihood =  2011.5473  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 68:  Log pseudolikelihood =  2011.5475  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 69:  Log pseudolikelihood =  2011.5476  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 70:  Log pseudolikelihood =  2011.5476  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 71:  Log pseudolikelihood =  2011.5476  (backed up)
Iteration 72:  Log pseudolikelihood =  2012.5432  
Iteration 73:  Log pseudolikelihood =  2013.7359  
Iteration 74:  Log pseudolikelihood =  2014.0602  
Iteration 75:  Log pseudolikelihood =  2014.1351  
Iteration 76:  Log pseudolikelihood =  2014.1377  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 77:  Log pseudolikelihood =   2014.138  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 78:  Log pseudolikelihood =  2014.1381  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 79:  Log pseudolikelihood =  2014.1381  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 80:  Log pseudolikelihood =  2014.1381  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 81:  Log pseudolikelihood =  2014.1381  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 82:  Log pseudolikelihood =  2014.1381  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 83:  Log pseudolikelihood =  2014.1381  (backed up)
could not calculate numerical derivatives -- discontinuous region with missing values encountered
could not calculate numerical derivatives -- discontinuous region with missing values encountered
estimates post: matrix has missing values
r(504);

end of do-file

r(504);

. do msward_2013_11_22_cost.do

. * Based on msward_code_clarity.do
. capture log close
----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.txt
  log type:  text
 opened on:  22 Nov 2013, 14:15:42

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  14:15:42  on 22 Nov 2013

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(cmdlog G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file G:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU",  cost model(bc95) d(tnormal) posthessian robust emean(`z_vlis
> t') vsigma(TREND)


initial:       Log pseudolikelihood = -42525.399
Iteration 0:   Log pseudolikelihood = -42525.399  
Iteration 1:   Log pseudolikelihood = -38225.927  (backed up)
Iteration 2:   Log pseudolikelihood = -37853.446  (backed up)
Iteration 3:   Log pseudolikelihood = -34550.006  (backed up)
Iteration 4:   Log pseudolikelihood = -34377.569  (backed up)
Iteration 5:   Log pseudolikelihood = -32754.185  (backed up)
Iteration 6:   Log pseudolikelihood = -32685.673  (backed up)
Iteration 7:   Log pseudolikelihood = -32615.071  (backed up)
Iteration 8:   Log pseudolikelihood = -32614.606  (backed up)
Iteration 9:   Log pseudolikelihood = -32614.606  (backed up)
Iteration 10:  Log pseudolikelihood = -29859.015  
Iteration 11:  Log pseudolikelihood = -29235.268  
Iteration 12:  Log pseudolikelihood = -28109.945  
Iteration 13:  Log pseudolikelihood = -26998.997  
Iteration 14:  Log pseudolikelihood = -22653.057  
Iteration 15:  Log pseudolikelihood = -21229.646  
Iteration 16:  Log pseudolikelihood =  -14627.56  
Iteration 17:  Log pseudolikelihood = -14257.204  
Iteration 18:  Log pseudolikelihood =   -10497.3  
Iteration 19:  Log pseudolikelihood = -8389.9952  
Iteration 20:  Log pseudolikelihood = -7043.9257  
Iteration 21:  Log pseudolikelihood = -5849.6539  
Iteration 22:  Log pseudolikelihood = -5051.3558  
Iteration 23:  Log pseudolikelihood = -4678.4082  
Iteration 24:  Log pseudolikelihood = -4587.3678  
Iteration 25:  Log pseudolikelihood = -4523.8259  
Iteration 26:  Log pseudolikelihood = -4411.2822  
Iteration 27:  Log pseudolikelihood = -4351.9103  
Iteration 28:  Log pseudolikelihood = -4326.0409  
Iteration 29:  Log pseudolikelihood = -4231.3755  
Iteration 30:  Log pseudolikelihood = -4059.5883  
Iteration 31:  Log pseudolikelihood = -3928.1843  
Iteration 32:  Log pseudolikelihood = -3846.0975  
Iteration 33:  Log pseudolikelihood = -3778.9773  
Iteration 34:  Log pseudolikelihood = -3741.8128  
Iteration 35:  Log pseudolikelihood = -3731.1887  
Iteration 36:  Log pseudolikelihood = -3726.6659  
Iteration 37:  Log pseudolikelihood =  -3724.581  
Iteration 38:  Log pseudolikelihood =  -3724.065  
Iteration 39:  Log pseudolikelihood = -3723.6663  
Iteration 40:  Log pseudolikelihood =  -3722.654  
Iteration 41:  Log pseudolikelihood = -3719.7449  
Iteration 42:  Log pseudolikelihood = -3717.4039  
Iteration 43:  Log pseudolikelihood = -3712.6526  
Iteration 44:  Log pseudolikelihood = -3710.4785  
Iteration 45:  Log pseudolikelihood = -3710.1396  
Iteration 46:  Log pseudolikelihood = -3710.1261  
Iteration 47:  Log pseudolikelihood =  -3710.126  

Inefficiency effects model (truncated-normal)        Number of obs =     13369
Group variable: pid                               Number of groups =      2966
Time variable: year                             Obs per group: min =         1
                                                               avg =       4.5
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood = -3710.1260                    Wald chi2(5)  =  15741.23

                                                    (Std. Err. adjusted for 2966 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |   1.018425   .0091923   110.79   0.000     1.000408    1.036441
                 lnPTotalCattle |   .1849968   .0476318     3.88   0.000     .0916401    .2783534
lnPCompoundfeedingstuffsforcatt |   .6127854   .0273143    22.43   0.000     .5592503    .6663204
 lnPFERTILISERSANDSOILIMPROVERS |   .1613312   .0463931     3.48   0.001     .0704024    .2522599
                          TREND |   .0007735   .0028821     0.27   0.788    -.0048754    .0064224
                          _cons |  -5.970793   .2269811   -26.31   0.000    -6.415668   -5.525918
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |   4.549041   2.425056     1.88   0.061     -.203982    9.302064
                      lnspecial |  -10.39102          .        .       .            .           .
                          _cons |   10.66122   14.18414     0.75   0.452    -17.13919    38.46162
--------------------------------+----------------------------------------------------------------
Usigma                          |
                          _cons |   1.087618   .3023651     3.60   0.000     .4949937    1.680243
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                          TREND |   .0520202   .0112184     4.64   0.000     .0300326    .0740078
                          _cons |  -2.724706   .0753686   -36.15   0.000    -2.872426   -2.576986
--------------------------------+----------------------------------------------------------------
  E(sigma_v) |   .2925477                                 .2922191    .2928763
     sigma_u |   1.722556   .2604204     6.61   0.000     1.280815    2.316648
------------------------------------------------------------------------------

. estimates store `model1name'_DEU_`tech_or_cost'

. di `e(converged)'
1

. 
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "FRA",cost model(bc95) d(tnormal) posthessian robust emean(`z_vlist'
> ) usigma(`z_vlist') vsigma(TREND)


initial:       Log pseudolikelihood = -18928.767
Iteration 0:   Log pseudolikelihood = -18928.767  
Iteration 1:   Log pseudolikelihood =  -12721.39  (backed up)
Iteration 2:   Log pseudolikelihood = -8933.7001  (backed up)
Iteration 3:   Log pseudolikelihood = -8902.4794  (backed up)
Iteration 4:   Log pseudolikelihood = -7794.5228  (backed up)
Iteration 5:   Log pseudolikelihood = -7736.9277  (backed up)
Iteration 6:   Log pseudolikelihood = -7707.5824  (backed up)
Iteration 7:   Log pseudolikelihood = -7622.0211  (backed up)
Iteration 8:   Log pseudolikelihood = -7608.7781  (backed up)
Iteration 9:   Log pseudolikelihood = -7588.8977  (backed up)
Iteration 10:  Log pseudolikelihood = -7576.1853  (backed up)
Iteration 11:  Log pseudolikelihood = -7575.0364  (backed up)
Iteration 12:  Log pseudolikelihood = -6688.5732  
Iteration 13:  Log pseudolikelihood = -6489.0222  
Iteration 14:  Log pseudolikelihood = -6115.4153  
Iteration 15:  Log pseudolikelihood = -6115.4153  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 16:  Log pseudolikelihood = -6115.4153  (backed up)
Iteration 17:  Log pseudolikelihood = -5850.7425  (backed up)
Iteration 18:  Log pseudolikelihood = -5180.1992  (backed up)
Iteration 19:  Log pseudolikelihood = -5086.5221  (backed up)
Iteration 20:  Log pseudolikelihood = -4546.0913  (backed up)
Iteration 21:  Log pseudolikelihood = -4239.5278  (backed up)
Iteration 22:  Log pseudolikelihood = -4169.1684  (backed up)
Iteration 23:  Log pseudolikelihood = -3949.8727  (backed up)
Iteration 24:  Log pseudolikelihood = -3949.0032  (backed up)
Iteration 25:  Log pseudolikelihood = -3146.5351  
Iteration 26:  Log pseudolikelihood = -2702.8606  
Iteration 27:  Log pseudolikelihood = -2375.1244  
Iteration 28:  Log pseudolikelihood =  -1725.543  
Iteration 29:  Log pseudolikelihood = -1094.3365  
Iteration 30:  Log pseudolikelihood = -941.57428  
Iteration 31:  Log pseudolikelihood = -531.01169  
Iteration 32:  Log pseudolikelihood =  -353.8928  
Iteration 33:  Log pseudolikelihood = -282.52731  
Iteration 34:  Log pseudolikelihood = -214.09089  
Iteration 35:  Log pseudolikelihood = -187.14916  
Iteration 36:  Log pseudolikelihood = -174.58306  
Iteration 37:  Log pseudolikelihood = -171.71825  
Iteration 38:  Log pseudolikelihood = -160.40284  
Iteration 39:  Log pseudolikelihood = -158.28692  
Iteration 40:  Log pseudolikelihood = -150.44095  
Iteration 41:  Log pseudolikelihood = -147.99584  
Iteration 42:  Log pseudolikelihood = -140.47645  
Iteration 43:  Log pseudolikelihood = -132.92674  
Iteration 44:  Log pseudolikelihood =  -127.2179  
Iteration 45:  Log pseudolikelihood = -109.81909  
Iteration 46:  Log pseudolikelihood = -103.50368  
Iteration 47:  Log pseudolikelihood = -102.38547  
Iteration 48:  Log pseudolikelihood = -100.25308  
Iteration 49:  Log pseudolikelihood = -98.243713  
Iteration 50:  Log pseudolikelihood = -95.572164  
Iteration 51:  Log pseudolikelihood = -94.676693  
Iteration 52:  Log pseudolikelihood = -93.729947  
Iteration 53:  Log pseudolikelihood = -92.922891  
Iteration 54:  Log pseudolikelihood = -91.588908  
Iteration 55:  Log pseudolikelihood = -90.467598  
Iteration 56:  Log pseudolikelihood = -89.957819  
Iteration 57:  Log pseudolikelihood = -89.746079  
Iteration 58:  Log pseudolikelihood = -89.673474  
Iteration 59:  Log pseudolikelihood = -89.663152  
Iteration 60:  Log pseudolikelihood = -89.662671  
Iteration 61:  Log pseudolikelihood = -89.662649  
Iteration 62:  Log pseudolikelihood = -89.662648  

Inefficiency effects model (truncated-normal)        Number of obs =      3727
Group variable: pid                               Number of groups =      1629
Time variable: year                             Obs per group: min =         1
                                                               avg =       2.3
                                                               max =         8

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood =   -89.6626                    Wald chi2(5)  =   3811.53

                                                    (Std. Err. adjusted for 1629 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |   1.018245   .0170056    59.88   0.000     .9849143    1.051575
                 lnPTotalCattle |  -.1565048   .1079462    -1.45   0.147    -.3680755    .0550658
lnPCompoundfeedingstuffsforcatt |   1.128881   .1510499     7.47   0.000     .8328285    1.424933
 lnPFERTILISERSANDSOILIMPROVERS |   .8765143    .136035     6.44   0.000     .6098907    1.143138
                          TREND |  -.0557834   .0062078    -8.99   0.000    -.0679504   -.0436164
                          _cons |  -12.68203    .792346   -16.01   0.000      -14.235   -11.12906
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |  -.0431394   .0077414    -5.57   0.000    -.0583122   -.0279666
                      lnspecial |  -.8970746   .0591554   -15.16   0.000    -1.013017   -.7811323
                          _cons |   5.359872   .2834122    18.91   0.000     4.804394     5.91535
--------------------------------+----------------------------------------------------------------
Usigma                          |
                   lngrassratio |   4.325771   .8730738     4.95   0.000     2.614578    6.036964
                      lnspecial |   7.828909   1.606469     4.87   0.000     4.680287    10.97753
                          _cons |    -55.459   9.419981    -5.89   0.000    -73.92183   -36.99618
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                          TREND |    .311708   .0193171    16.14   0.000     .2738473    .3495688
                          _cons |  -3.863947   .1052454   -36.71   0.000    -4.070224    -3.65767
--------------------------------+----------------------------------------------------------------
  E(sigma_u) |   .0423355                                 .0282807    .0563902
  E(sigma_v) |   .3428615                                 .3384413    .3472817
------------------------------------------------------------------------------

. estimates store `model1name'_FRA_`tech_or_cost'

. di `e(converged)'
1

. 
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "IRE",  cost model(bc95) d(tnormal) posthessian robust emean(`z_vlis
> t') usigma(`z_vlist') vsigma(TREND)


initial:       Log pseudolikelihood = -18144.035
Iteration 0:   Log pseudolikelihood = -18144.035  
Iteration 1:   Log pseudolikelihood = -9169.2577  (backed up)
Iteration 2:   Log pseudolikelihood = -7875.5011  (backed up)
Iteration 3:   Log pseudolikelihood = -7596.3634  (backed up)
Iteration 4:   Log pseudolikelihood = -7506.2121  (backed up)
Iteration 5:   Log pseudolikelihood = -7446.5607  (backed up)
Iteration 6:   Log pseudolikelihood = -7417.4254  (backed up)
Iteration 7:   Log pseudolikelihood = -7177.1065  
Iteration 8:   Log pseudolikelihood = -7105.1036  (backed up)
Iteration 9:   Log pseudolikelihood = -7103.9593  (backed up)
Iteration 10:  Log pseudolikelihood = -7103.9593  (backed up)
Iteration 11:  Log pseudolikelihood =  -6911.165  (backed up)
Iteration 12:  Log pseudolikelihood = -6902.9111  
Iteration 13:  Log pseudolikelihood = -6900.8975  
Iteration 14:  Log pseudolikelihood =  -6900.115  
Iteration 15:  Log pseudolikelihood = -6900.0872  
Iteration 16:  Log pseudolikelihood = -6900.0872  (backed up)
Iteration 17:  Log pseudolikelihood = -6899.9842  
Iteration 18:  Log pseudolikelihood = -6899.8054  
Iteration 19:  Log pseudolikelihood = -6899.3346  
Iteration 20:  Log pseudolikelihood = -6899.1798  
Iteration 21:  Log pseudolikelihood = -6898.8845  
Iteration 22:  Log pseudolikelihood = -6898.6031  
Iteration 23:  Log pseudolikelihood = -6898.5555  
Iteration 24:  Log pseudolikelihood = -6898.5469  
Iteration 25:  Log pseudolikelihood = -6898.5469  (backed up)
Iteration 26:  Log pseudolikelihood = -6898.5469  (backed up)
Iteration 27:  Log pseudolikelihood =  -6898.349  (backed up)
Iteration 28:  Log pseudolikelihood = -6898.3171  
Iteration 29:  Log pseudolikelihood = -6898.2989  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 30:  Log pseudolikelihood = -6898.2979  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 31:  Log pseudolikelihood = -6898.0716  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 32:  Log pseudolikelihood = -6898.0068  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 33:  Log pseudolikelihood = -6897.9952  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 34:  Log pseudolikelihood = -6897.9951  (backed up)
Iteration 35:  Log pseudolikelihood =  -6785.774  (backed up)
Iteration 36:  Log pseudolikelihood = -6777.0877  (backed up)
Iteration 37:  Log pseudolikelihood = -6777.0877  (backed up)
Iteration 38:  Log pseudolikelihood = -6773.6495  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 39:  Log pseudolikelihood = -6773.6495  (backed up)
Iteration 40:  Log pseudolikelihood = -6764.0434  (backed up)
Iteration 41:  Log pseudolikelihood =  -6593.677  (backed up)
Iteration 42:  Log pseudolikelihood = -5673.9659  (backed up)
Iteration 43:  Log pseudolikelihood = -5574.6423  (backed up)
Iteration 44:  Log pseudolikelihood = -5501.7105  (backed up)
Iteration 45:  Log pseudolikelihood = -5280.5405  (backed up)
Iteration 46:  Log pseudolikelihood = -5203.1151  (backed up)
Iteration 47:  Log pseudolikelihood = -5158.1734  (backed up)
Iteration 48:  Log pseudolikelihood = -5155.5022  (backed up)
Iteration 49:  Log pseudolikelihood = -5155.5022  (backed up)
Iteration 50:  Log pseudolikelihood = -5155.5022  (backed up)
Iteration 51:  Log pseudolikelihood = -5155.4922  (backed up)
Iteration 52:  Log pseudolikelihood = -5155.4877  (backed up)
Iteration 53:  Log pseudolikelihood = -5155.4877  (backed up)
Iteration 54:  Log pseudolikelihood = -5155.4877  (backed up)
Iteration 55:  Log pseudolikelihood = -5155.2659  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 56:  Log pseudolikelihood = -5155.2591  (backed up)
Iteration 57:  Log pseudolikelihood = -5155.2591  (backed up)
Iteration 58:  Log pseudolikelihood = -5155.2591  (backed up)
Iteration 59:  Log pseudolikelihood = -5155.2591  (backed up)
Iteration 60:  Log pseudolikelihood = -5155.2591  (backed up)
Iteration 61:  Log pseudolikelihood = -5117.5874  
Iteration 62:  Log pseudolikelihood = -5017.2232  
Iteration 63:  Log pseudolikelihood = -4997.5184  
Iteration 64:  Log pseudolikelihood = -4997.5184  (backed up)
Iteration 65:  Log pseudolikelihood =  -4997.356  (backed up)
Iteration 66:  Log pseudolikelihood =  -4997.356  (backed up)
Iteration 67:  Log pseudolikelihood = -4977.3034  (backed up)
Iteration 68:  Log pseudolikelihood = -4970.2553  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 69:  Log pseudolikelihood = -4969.2889  (backed up)
Iteration 70:  Log pseudolikelihood = -4924.0671  (backed up)
Iteration 71:  Log pseudolikelihood = -4758.3063  (backed up)
Iteration 72:  Log pseudolikelihood = -4341.0005  (backed up)
Iteration 73:  Log pseudolikelihood = -4317.7948  (backed up)
Iteration 74:  Log pseudolikelihood =  -4313.529  (backed up)
Iteration 75:  Log pseudolikelihood = -4312.6201  (backed up)
Iteration 76:  Log pseudolikelihood = -4312.1877  (backed up)
Iteration 77:  Log pseudolikelihood =  -4312.092  (backed up)
Iteration 78:  Log pseudolikelihood = -4312.0836  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 79:  Log pseudolikelihood = -4312.0836  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 80:  Log pseudolikelihood = -4311.3274  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 81:  Log pseudolikelihood = -4311.3037  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 82:  Log pseudolikelihood = -4311.2919  (backed up)
Iteration 83:  Log pseudolikelihood = -4308.1485  (backed up)
Iteration 84:  Log pseudolikelihood = -4226.3819  (backed up)
Iteration 85:  Log pseudolikelihood = -4219.9652  (backed up)
Iteration 86:  Log pseudolikelihood = -4219.9652  (backed up)
Iteration 87:  Log pseudolikelihood = -4219.5875  
Iteration 88:  Log pseudolikelihood = -4136.7629  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 89:  Log pseudolikelihood =  -3815.217  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 90:  Log pseudolikelihood =  -3815.217  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 91:  Log pseudolikelihood = -3538.5588  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 92:  Log pseudolikelihood = -3538.5588  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 93:  Log pseudolikelihood =  -2480.889  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 94:  Log pseudolikelihood = -2070.6793  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 95:  Log pseudolikelihood = -1877.3081  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 96:  Log pseudolikelihood = -1725.2534  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 97:  Log pseudolikelihood = -1567.1676  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 98:  Log pseudolikelihood = -1237.5189  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 99:  Log pseudolikelihood = -1237.5189  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 100: Log pseudolikelihood = -1237.5189  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered

Inefficiency effects model (truncated-normal)        Number of obs =      3549
Group variable: pid                               Number of groups =       724
Time variable: year                             Obs per group: min =         1
                                                               avg =       4.9
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood = -1237.5189                    Wald chi2(4)  =  1.05e+06

                                                     (Std. Err. adjusted for 724 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |   1.100143   .0503967    21.83   0.000     1.001367    1.198918
                 lnPTotalCattle |   3.166929    .953826     3.32   0.001     1.297464    5.036393
lnPCompoundfeedingstuffsforcatt |   9.609172   .4130043    23.27   0.000     8.799698    10.41865
 lnPFERTILISERSANDSOILIMPROVERS |  -13.87175          .        .       .            .           .
                          TREND |   .8026629   .1721602     4.66   0.000     .4652351    1.140091
                          _cons |   9.253878          .        .       .            .           .
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |   .3528913   .1685298     2.09   0.036     .0225791    .6832036
                      lnspecial |  -.7032382    .178703    -3.94   0.000     -1.05349   -.3529868
                          _cons |    7.91841          .        .       .            .           .
--------------------------------+----------------------------------------------------------------
Usigma                          |
                   lngrassratio |   -6.47027   11.13919    -0.58   0.561    -28.30268    15.36214
                      lnspecial |  -45.28248   39.80143    -1.14   0.255    -123.2919     32.7269
                          _cons |  -12.21688   178.6931    -0.07   0.945    -362.4488    338.0151
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                          TREND |   1.408158    .222555     6.33   0.000     .9719578    1.844357
                          _cons |   -4.45014          .        .       .            .           .
--------------------------------+----------------------------------------------------------------
  E(sigma_u) |   1.25e-40                                -1.19e-40    3.69e-40
  E(sigma_v) |   12.28675                                 11.68225    12.89125
------------------------------------------------------------------------------

. estimates store `model1name'_IRE_`tech_or_cost'

. di `e(converged)'
0

. 
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "UKI",  cost model(bc95) d(tnormal) posthessian robust emean(`z_vlis
> t') usigma(`z_vlist') vsigma(TREND)


initial:       Log pseudolikelihood = -24060.184
Iteration 0:   Log pseudolikelihood = -24060.184  
Iteration 1:   Log pseudolikelihood = -13980.747  (backed up)
Iteration 2:   Log pseudolikelihood = -10460.322  (backed up)
Iteration 3:   Log pseudolikelihood = -9839.5825  (backed up)
Iteration 4:   Log pseudolikelihood =  -9692.368  (backed up)
Iteration 5:   Log pseudolikelihood = -9633.7258  (backed up)
Iteration 6:   Log pseudolikelihood = -9626.1441  (backed up)
Iteration 7:   Log pseudolikelihood = -9297.0978  (backed up)
Iteration 8:   Log pseudolikelihood = -9255.9732  (backed up)
Iteration 9:   Log pseudolikelihood = -9192.9869  (backed up)
Iteration 10:  Log pseudolikelihood = -7558.3388  
Iteration 11:  Log pseudolikelihood = -6721.1028  (backed up)
Iteration 12:  Log pseudolikelihood =  -6596.637  (backed up)
Iteration 13:  Log pseudolikelihood = -6532.4798  (backed up)
Iteration 14:  Log pseudolikelihood = -6509.5401  (backed up)
Iteration 15:  Log pseudolikelihood = -6507.9653  (backed up)
Iteration 16:  Log pseudolikelihood = -6507.4541  (backed up)
Iteration 17:  Log pseudolikelihood = -6507.3106  (backed up)
Iteration 18:  Log pseudolikelihood = -6507.2192  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 19:  Log pseudolikelihood =  -6507.198  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 20:  Log pseudolikelihood = -6507.1939  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 21:  Log pseudolikelihood = -6507.1917  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 22:  Log pseudolikelihood = -6507.1911  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 23:  Log pseudolikelihood = -6507.1906  (backed up)
Iteration 24:  Log pseudolikelihood = -4161.7089  
Iteration 25:  Log pseudolikelihood = -3871.7388  
Iteration 26:  Log pseudolikelihood = -3833.7149  
Iteration 27:  Log pseudolikelihood = -3831.7197  
Iteration 28:  Log pseudolikelihood = -3831.7197  (backed up)
Iteration 29:  Log pseudolikelihood = -3831.6939  (backed up)
Iteration 30:  Log pseudolikelihood = -3831.6939  (backed up)
Iteration 31:  Log pseudolikelihood = -3748.3149  (backed up)
Iteration 32:  Log pseudolikelihood = -3710.9396  
Iteration 33:  Log pseudolikelihood = -3563.2249  
Iteration 34:  Log pseudolikelihood = -3473.3603  
Iteration 35:  Log pseudolikelihood = -3293.1264  
Iteration 36:  Log pseudolikelihood = -3144.9323  
Iteration 37:  Log pseudolikelihood = -3072.1562  
Iteration 38:  Log pseudolikelihood = -3041.3904  
Iteration 39:  Log pseudolikelihood = -3023.7923  
Iteration 40:  Log pseudolikelihood = -3011.5509  
Iteration 41:  Log pseudolikelihood = -2987.2278  
Iteration 42:  Log pseudolikelihood = -2981.2748  (backed up)
Iteration 43:  Log pseudolikelihood = -2971.1523  
Iteration 44:  Log pseudolikelihood = -2961.3462  
Iteration 45:  Log pseudolikelihood = -2960.3414  
Iteration 46:  Log pseudolikelihood = -2960.1409  (backed up)
Iteration 47:  Log pseudolikelihood =  -2960.133  (backed up)
Iteration 48:  Log pseudolikelihood = -2960.1327  (backed up)
Iteration 49:  Log pseudolikelihood = -2960.1327  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 50:  Log pseudolikelihood = -2960.1327  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 51:  Log pseudolikelihood = -2960.1327  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 52:  Log pseudolikelihood = -2960.1327  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 53:  Log pseudolikelihood = -2960.1327  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 54:  Log pseudolikelihood = -2960.1327  (backed up)
Iteration 55:  Log pseudolikelihood = -2950.8543  
Iteration 56:  Log pseudolikelihood = -2950.8543  (backed up)
Iteration 57:  Log pseudolikelihood = -2950.8543  (backed up)
Iteration 58:  Log pseudolikelihood = -2946.2232  
Iteration 59:  Log pseudolikelihood = -2944.6252  
Iteration 60:  Log pseudolikelihood = -2944.1319  (backed up)
Iteration 61:  Log pseudolikelihood = -2944.0026  (backed up)
Iteration 62:  Log pseudolikelihood =  -2943.978  (backed up)
Iteration 63:  Log pseudolikelihood = -2943.9698  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 64:  Log pseudolikelihood = -2943.9694  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 65:  Log pseudolikelihood = -2943.9693  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 66:  Log pseudolikelihood = -2943.9693  (backed up)
could not calculate numerical derivatives -- discontinuous region with missing values encountered
could not calculate numerical derivatives -- discontinuous region with missing values encountered
estimates post: matrix has missing values
r(504);

end of do-file

r(504);

. do msward_2013_11_22_cost.do

. * Based on msward_code_clarity.do
. capture log close
----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.txt
  log type:  text
 opened on:  22 Nov 2013, 14:30:48

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  14:30:48  on 22 Nov 2013

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(cmdlog G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file G:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU",  cost model(bc95) d(tnormal) posthessian robust emean(`z_vlis
> t') vsigma(TREND)
> estimates store `model1name'_DEU_`tech_or_cost'
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "FRA",cost model(bc95) d(tnormal) posthessian robust emean(`z_vlist'
> ) usigma(`z_vlist') vsigma(TREND)
> estimates store `model1name'_FRA_`tech_or_cost'
> di `e(converged)'
> */
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "IRE",  cost model(bc95) d(tnormal) posthessian robust emean(`z_vlis
> t') vsigma(TREND)


initial:       Log pseudolikelihood =  -11082.86
Iteration 0:   Log pseudolikelihood =  -11082.86  
Iteration 1:   Log pseudolikelihood = -10522.986  (backed up)
Iteration 2:   Log pseudolikelihood = -10516.967  (backed up)
Iteration 3:   Log pseudolikelihood = -10490.723  (backed up)
Iteration 4:   Log pseudolikelihood = -10090.625  (backed up)
Iteration 5:   Log pseudolikelihood = -10087.361  (backed up)
Iteration 6:   Log pseudolikelihood = -10008.504  (backed up)
Iteration 7:   Log pseudolikelihood =  -9402.279  
Iteration 8:   Log pseudolikelihood = -9016.9263  
Iteration 9:   Log pseudolikelihood = -8460.6486  
Iteration 10:  Log pseudolikelihood = -7882.0366  
Iteration 11:  Log pseudolikelihood =  -7040.711  
Iteration 12:  Log pseudolikelihood = -6419.6499  
Iteration 13:  Log pseudolikelihood = -6201.3741  
Iteration 14:  Log pseudolikelihood = -4444.6265  
Iteration 15:  Log pseudolikelihood = -3915.4222  
Iteration 16:  Log pseudolikelihood = -2605.7866  
Iteration 17:  Log pseudolikelihood = -1932.6452  
Iteration 18:  Log pseudolikelihood = -1463.1349  
Iteration 19:  Log pseudolikelihood = -373.87202  
Iteration 20:  Log pseudolikelihood =  123.04214  
Iteration 21:  Log pseudolikelihood =  235.65428  
Iteration 22:  Log pseudolikelihood =  355.27165  
Iteration 23:  Log pseudolikelihood =  666.14509  
Iteration 24:  Log pseudolikelihood =  669.58341  
Iteration 25:  Log pseudolikelihood =  1212.9445  
Iteration 26:  Log pseudolikelihood =  1444.6413  
Iteration 27:  Log pseudolikelihood =  1785.6074  
Iteration 28:  Log pseudolikelihood =  1820.9363  
Iteration 29:  Log pseudolikelihood =  1836.6951  
Iteration 30:  Log pseudolikelihood =  1841.5375  
Iteration 31:  Log pseudolikelihood =  1870.6136  
Iteration 32:  Log pseudolikelihood =  1873.9435  
Iteration 33:  Log pseudolikelihood =  1880.0951  
Iteration 34:  Log pseudolikelihood =  1884.9963  
Iteration 35:  Log pseudolikelihood =  1886.0539  
Iteration 36:  Log pseudolikelihood =  1887.0176  
Iteration 37:  Log pseudolikelihood =  1891.8619  
Iteration 38:  Log pseudolikelihood =  1892.2697  (backed up)
Iteration 39:  Log pseudolikelihood =  1892.5353  (backed up)
Iteration 40:  Log pseudolikelihood =  1892.7551  (backed up)
Iteration 41:  Log pseudolikelihood =  1892.7918  (backed up)
Iteration 42:  Log pseudolikelihood =  1892.8137  (backed up)
Iteration 43:  Log pseudolikelihood =  1892.8168  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 44:  Log pseudolikelihood =  1892.8176  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 45:  Log pseudolikelihood =  1892.8177  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 46:  Log pseudolikelihood =  1892.8177  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 47:  Log pseudolikelihood =  1892.8177  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 48:  Log pseudolikelihood =  1892.8177  (backed up)
Iteration 49:  Log pseudolikelihood =  1894.1911  
Iteration 50:  Log pseudolikelihood =   1894.214  
Iteration 51:  Log pseudolikelihood =   1894.214  (backed up)
Iteration 52:  Log pseudolikelihood =  1895.4937  
Iteration 53:  Log pseudolikelihood =  1895.7286  
Iteration 54:  Log pseudolikelihood =  1895.7286  (backed up)
Iteration 55:  Log pseudolikelihood =  1895.7286  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 56:  Log pseudolikelihood =  1895.7286  (backed up)
Iteration 57:  Log pseudolikelihood =   1895.733  (backed up)
Iteration 58:  Log pseudolikelihood =  1896.3179  (backed up)
Iteration 59:  Log pseudolikelihood =  1896.5791  (backed up)
Iteration 60:  Log pseudolikelihood =  1896.6916  (backed up)
Iteration 61:  Log pseudolikelihood =  1896.7061  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 62:  Log pseudolikelihood =  1896.7077  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 63:  Log pseudolikelihood =  1896.7079  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 64:  Log pseudolikelihood =  1896.7079  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 65:  Log pseudolikelihood =  1896.7079  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 66:  Log pseudolikelihood =  1896.7079  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 67:  Log pseudolikelihood =  1896.7079  (backed up)
Iteration 68:  Log pseudolikelihood =  1897.3359  
Iteration 69:  Log pseudolikelihood =  1897.3854  
Iteration 70:  Log pseudolikelihood =  1897.5571  
Iteration 71:  Log pseudolikelihood =  1897.5705  
Iteration 72:  Log pseudolikelihood =  1897.5705  (backed up)
Iteration 73:  Log pseudolikelihood =  1897.5728  (backed up)
Iteration 74:  Log pseudolikelihood =  1897.5869  
Iteration 75:  Log pseudolikelihood =  1897.5899  
Iteration 76:  Log pseudolikelihood =  1897.5905  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 77:  Log pseudolikelihood =  1897.5907  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 78:  Log pseudolikelihood =  1897.5907  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 79:  Log pseudolikelihood =  1897.5907  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 80:  Log pseudolikelihood =  1897.5907  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 81:  Log pseudolikelihood =  1897.5907  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 82:  Log pseudolikelihood =  1897.5907  (backed up)
numerical derivatives are approximate
nearby values are missing
could not calculate numerical derivatives -- discontinuous region with missing values encountered
numerical derivatives are approximate
nearby values are missing
could not calculate numerical derivatives -- discontinuous region with missing values encountered
estimates post: matrix has missing values
r(504);

end of do-file

r(504);

. do msward_2013_11_22_cost.do

. * Based on msward_code_clarity.do
. capture log close
----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.txt
  log type:  text
 opened on:  22 Nov 2013, 14:34:41

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  14:34:41  on 22 Nov 2013

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(cmdlog G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file G:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU",  cost model(bc95) d(tnormal) posthessian robust emean(`z_vlis
> t') vsigma(TREND)
> estimates store `model1name'_DEU_`tech_or_cost'
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "FRA",cost model(bc95) d(tnormal) posthessian robust emean(`z_vlist'
> ) usigma(`z_vlist') vsigma(TREND)
> estimates store `model1name'_FRA_`tech_or_cost'
> di `e(converged)'
> */
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "IRE",  cost model(bc95) d(tnormal) posthessian robust emean(`z_vlis
> t') 


initial:       Log pseudolikelihood =  -28202.62
Iteration 0:   Log pseudolikelihood =  -28202.62  
Iteration 1:   Log pseudolikelihood =  -7834.127  (backed up)
Iteration 2:   Log pseudolikelihood =  -7325.231  (backed up)
Iteration 3:   Log pseudolikelihood = -7303.6134  (backed up)
Iteration 4:   Log pseudolikelihood = -6725.2573  (backed up)
Iteration 5:   Log pseudolikelihood = -6678.6417  (backed up)
Iteration 6:   Log pseudolikelihood = -6671.4467  (backed up)
Iteration 7:   Log pseudolikelihood = -6671.4467  (backed up)
Iteration 8:   Log pseudolikelihood = -6668.6278  (backed up)
Iteration 9:   Log pseudolikelihood = -6668.6278  (backed up)
Iteration 10:  Log pseudolikelihood =  -6660.801  
Iteration 11:  Log pseudolikelihood = -6654.2971  
Iteration 12:  Log pseudolikelihood = -6653.3083  
Iteration 13:  Log pseudolikelihood = -6653.3083  (backed up)
Iteration 14:  Log pseudolikelihood = -6650.4169  
Iteration 15:  Log pseudolikelihood = -6533.9853  
Iteration 16:  Log pseudolikelihood = -6262.3589  
Iteration 17:  Log pseudolikelihood = -5104.4955  
Iteration 18:  Log pseudolikelihood = -5066.7747  
Iteration 19:  Log pseudolikelihood = -4884.1783  
Iteration 20:  Log pseudolikelihood = -4614.2481  
Iteration 21:  Log pseudolikelihood = -4305.8161  
Iteration 22:  Log pseudolikelihood = -4183.4362  
Iteration 23:  Log pseudolikelihood = -3822.5581  
Iteration 24:  Log pseudolikelihood = -3791.4617  
Iteration 25:  Log pseudolikelihood = -3619.8368  
Iteration 26:  Log pseudolikelihood = -3606.4566  
Iteration 27:  Log pseudolikelihood = -3602.4788  
Iteration 28:  Log pseudolikelihood = -3602.4788  (backed up)
Iteration 29:  Log pseudolikelihood = -3602.4788  (backed up)
Iteration 30:  Log pseudolikelihood =   -3597.97  
Iteration 31:  Log pseudolikelihood = -3597.8553  
Iteration 32:  Log pseudolikelihood = -3597.8553  (backed up)
Iteration 33:  Log pseudolikelihood = -3597.8553  (backed up)
Iteration 34:  Log pseudolikelihood = -3033.2038  
Iteration 35:  Log pseudolikelihood = -2095.0095  
Iteration 36:  Log pseudolikelihood = -1826.9973  
Iteration 37:  Log pseudolikelihood = -1714.7746  
Iteration 38:  Log pseudolikelihood = -1701.2178  
Iteration 39:  Log pseudolikelihood = -1695.2411  
Iteration 40:  Log pseudolikelihood = -1670.2254  
Iteration 41:  Log pseudolikelihood = -1506.9295  
Iteration 42:  Log pseudolikelihood = -1242.1309  
Iteration 43:  Log pseudolikelihood = -1162.5646  
Iteration 44:  Log pseudolikelihood = -1153.6246  
Iteration 45:  Log pseudolikelihood = -1151.6387  
Iteration 46:  Log pseudolikelihood = -1149.9469  
Iteration 47:  Log pseudolikelihood = -1098.8703  
Iteration 48:  Log pseudolikelihood = -932.25536  
Iteration 49:  Log pseudolikelihood = -899.47684  
Iteration 50:  Log pseudolikelihood = -887.93441  (backed up)
Iteration 51:  Log pseudolikelihood = -882.07396  (backed up)
Iteration 52:  Log pseudolikelihood = -879.17256  (backed up)
Iteration 53:  Log pseudolikelihood = -878.45378  (backed up)
Iteration 54:  Log pseudolikelihood =  -878.2747  (backed up)
Iteration 55:  Log pseudolikelihood = -878.25233  (backed up)
Iteration 56:  Log pseudolikelihood = -878.24954  (backed up)
Iteration 57:  Log pseudolikelihood = -878.24885  (backed up)
Iteration 58:  Log pseudolikelihood = -878.24848  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 59:  Log pseudolikelihood = -878.24833  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 60:  Log pseudolikelihood =  -878.2482  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 61:  Log pseudolikelihood =  -878.2482  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 62:  Log pseudolikelihood =  -878.2482  (backed up)
numerical derivatives are approximate
nearby values are missing
could not calculate numerical derivatives -- discontinuous region with missing values encountered
numerical derivatives are approximate
nearby values are missing
could not calculate numerical derivatives -- discontinuous region with missing values encountered
estimates post: matrix has missing values
r(504);

end of do-file

r(504);

. do msward_2013_11_22_cost.do

. * Based on msward_code_clarity.do
. capture log close
----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.txt
  log type:  text
 opened on:  22 Nov 2013, 14:42:41

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  14:42:41  on 22 Nov 2013

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(cmdlog G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file G:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. 
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vl
> ist') vsigma(TREND)


initial:       Log pseudolikelihood = -42525.399
Iteration 0:   Log pseudolikelihood = -42525.399  
Iteration 1:   Log pseudolikelihood = -38225.927  (backed up)
Iteration 2:   Log pseudolikelihood = -37853.446  (backed up)
Iteration 3:   Log pseudolikelihood = -34550.006  (backed up)
Iteration 4:   Log pseudolikelihood = -34377.569  (backed up)
Iteration 5:   Log pseudolikelihood = -32754.185  (backed up)
Iteration 6:   Log pseudolikelihood = -32685.673  (backed up)
Iteration 7:   Log pseudolikelihood = -32615.071  (backed up)
Iteration 8:   Log pseudolikelihood = -32614.606  (backed up)
Iteration 9:   Log pseudolikelihood = -32614.606  (backed up)
Iteration 10:  Log pseudolikelihood = -29859.015  
Iteration 11:  Log pseudolikelihood = -29235.268  
Iteration 12:  Log pseudolikelihood = -28109.945  
Iteration 13:  Log pseudolikelihood = -26998.997  
Iteration 14:  Log pseudolikelihood = -22653.057  
Iteration 15:  Log pseudolikelihood = -21229.646  
Iteration 16:  Log pseudolikelihood =  -14627.56  
Iteration 17:  Log pseudolikelihood = -14257.204  
Iteration 18:  Log pseudolikelihood =   -10497.3  
Iteration 19:  Log pseudolikelihood = -8389.9952  
Iteration 20:  Log pseudolikelihood = -7043.9257  
Iteration 21:  Log pseudolikelihood = -5849.6539  
Iteration 22:  Log pseudolikelihood = -5051.3558  
Iteration 23:  Log pseudolikelihood = -4678.4082  
Iteration 24:  Log pseudolikelihood = -4587.3678  
Iteration 25:  Log pseudolikelihood = -4523.8259  
Iteration 26:  Log pseudolikelihood = -4411.2822  
Iteration 27:  Log pseudolikelihood = -4351.9103  
Iteration 28:  Log pseudolikelihood = -4326.0409  
Iteration 29:  Log pseudolikelihood = -4231.3755  
Iteration 30:  Log pseudolikelihood = -4059.5883  
Iteration 31:  Log pseudolikelihood = -3928.1843  
Iteration 32:  Log pseudolikelihood = -3846.0975  
Iteration 33:  Log pseudolikelihood = -3778.9773  
Iteration 34:  Log pseudolikelihood = -3741.8128  
Iteration 35:  Log pseudolikelihood = -3731.1887  
Iteration 36:  Log pseudolikelihood = -3726.6659  
Iteration 37:  Log pseudolikelihood =  -3724.581  
Iteration 38:  Log pseudolikelihood =  -3724.065  
Iteration 39:  Log pseudolikelihood = -3723.6663  
Iteration 40:  Log pseudolikelihood =  -3722.654  
Iteration 41:  Log pseudolikelihood = -3719.7449  
Iteration 42:  Log pseudolikelihood = -3717.4039  
Iteration 43:  Log pseudolikelihood = -3712.6526  
Iteration 44:  Log pseudolikelihood = -3710.4785  
Iteration 45:  Log pseudolikelihood = -3710.1396  
Iteration 46:  Log pseudolikelihood = -3710.1261  
Iteration 47:  Log pseudolikelihood =  -3710.126  

Inefficiency effects model (truncated-normal)        Number of obs =     13369
Group variable: pid                               Number of groups =      2966
Time variable: year                             Obs per group: min =         1
                                                               avg =       4.5
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood = -3710.1260                    Wald chi2(5)  =  15741.23

                                                    (Std. Err. adjusted for 2966 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |   1.018425   .0091923   110.79   0.000     1.000408    1.036441
                 lnPTotalCattle |   .1849968   .0476318     3.88   0.000     .0916401    .2783534
lnPCompoundfeedingstuffsforcatt |   .6127854   .0273143    22.43   0.000     .5592503    .6663204
 lnPFERTILISERSANDSOILIMPROVERS |   .1613312   .0463931     3.48   0.001     .0704024    .2522599
                          TREND |   .0007735   .0028821     0.27   0.788    -.0048754    .0064224
                          _cons |  -5.970793   .2269811   -26.31   0.000    -6.415668   -5.525918
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |   4.549041   2.425056     1.88   0.061     -.203982    9.302064
                      lnspecial |  -10.39102          .        .       .            .           .
                          _cons |   10.66122   14.18414     0.75   0.452    -17.13919    38.46162
--------------------------------+----------------------------------------------------------------
Usigma                          |
                          _cons |   1.087618   .3023651     3.60   0.000     .4949937    1.680243
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                          TREND |   .0520202   .0112184     4.64   0.000     .0300326    .0740078
                          _cons |  -2.724706   .0753686   -36.15   0.000    -2.872426   -2.576986
--------------------------------+----------------------------------------------------------------
  E(sigma_v) |   .2925477                                 .2922191    .2928763
     sigma_u |   1.722556   .2604204     6.61   0.000     1.280815    2.316648
------------------------------------------------------------------------------

. estimates store `model1name'_DEU_`tech_or_cost'

. di `e(converged)'
1

. 
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "FRA",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vl
> ist') usigma(`z_vlist') vsigma(`z_vlist'D)

variable lnspecialD not found
r(111);

end of do-file

r(111);

. do msward_2013_11_22_cost.do

. * Based on msward_code_clarity.do
. capture log close
----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.txt
  log type:  text
 opened on:  22 Nov 2013, 14:49:33

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  14:49:33  on 22 Nov 2013

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(cmdlog G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file G:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. 
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vl
> ist') vsigma(TREND)


initial:       Log pseudolikelihood = -42525.399
Iteration 0:   Log pseudolikelihood = -42525.399  
Iteration 1:   Log pseudolikelihood = -38225.927  (backed up)
Iteration 2:   Log pseudolikelihood = -37853.446  (backed up)
Iteration 3:   Log pseudolikelihood = -34550.006  (backed up)
Iteration 4:   Log pseudolikelihood = -34377.569  (backed up)
Iteration 5:   Log pseudolikelihood = -32754.185  (backed up)
Iteration 6:   Log pseudolikelihood = -32685.673  (backed up)
Iteration 7:   Log pseudolikelihood = -32615.071  (backed up)
Iteration 8:   Log pseudolikelihood = -32614.606  (backed up)
Iteration 9:   Log pseudolikelihood = -32614.606  (backed up)
Iteration 10:  Log pseudolikelihood = -29859.015  
Iteration 11:  Log pseudolikelihood = -29235.268  
Iteration 12:  Log pseudolikelihood = -28109.945  
Iteration 13:  Log pseudolikelihood = -26998.997  
Iteration 14:  Log pseudolikelihood = -22653.057  
Iteration 15:  Log pseudolikelihood = -21229.646  
Iteration 16:  Log pseudolikelihood =  -14627.56  
Iteration 17:  Log pseudolikelihood = -14257.204  
Iteration 18:  Log pseudolikelihood =   -10497.3  
Iteration 19:  Log pseudolikelihood = -8389.9952  
Iteration 20:  Log pseudolikelihood = -7043.9257  
Iteration 21:  Log pseudolikelihood = -5849.6539  
Iteration 22:  Log pseudolikelihood = -5051.3558  
Iteration 23:  Log pseudolikelihood = -4678.4082  
Iteration 24:  Log pseudolikelihood = -4587.3678  
Iteration 25:  Log pseudolikelihood = -4523.8259  
Iteration 26:  Log pseudolikelihood = -4411.2822  
Iteration 27:  Log pseudolikelihood = -4351.9103  
Iteration 28:  Log pseudolikelihood = -4326.0409  
Iteration 29:  Log pseudolikelihood = -4231.3755  
Iteration 30:  Log pseudolikelihood = -4059.5883  
Iteration 31:  Log pseudolikelihood = -3928.1843  
Iteration 32:  Log pseudolikelihood = -3846.0975  
Iteration 33:  Log pseudolikelihood = -3778.9773  
Iteration 34:  Log pseudolikelihood = -3741.8128  
Iteration 35:  Log pseudolikelihood = -3731.1887  
Iteration 36:  Log pseudolikelihood = -3726.6659  
Iteration 37:  Log pseudolikelihood =  -3724.581  
Iteration 38:  Log pseudolikelihood =  -3724.065  
Iteration 39:  Log pseudolikelihood = -3723.6663  
Iteration 40:  Log pseudolikelihood =  -3722.654  
Iteration 41:  Log pseudolikelihood = -3719.7449  
Iteration 42:  Log pseudolikelihood = -3717.4039  
Iteration 43:  Log pseudolikelihood = -3712.6526  
Iteration 44:  Log pseudolikelihood = -3710.4785  
Iteration 45:  Log pseudolikelihood = -3710.1396  
Iteration 46:  Log pseudolikelihood = -3710.1261  
Iteration 47:  Log pseudolikelihood =  -3710.126  

Inefficiency effects model (truncated-normal)        Number of obs =     13369
Group variable: pid                               Number of groups =      2966
Time variable: year                             Obs per group: min =         1
                                                               avg =       4.5
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood = -3710.1260                    Wald chi2(5)  =  15741.23

                                                    (Std. Err. adjusted for 2966 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |   1.018425   .0091923   110.79   0.000     1.000408    1.036441
                 lnPTotalCattle |   .1849968   .0476318     3.88   0.000     .0916401    .2783534
lnPCompoundfeedingstuffsforcatt |   .6127854   .0273143    22.43   0.000     .5592503    .6663204
 lnPFERTILISERSANDSOILIMPROVERS |   .1613312   .0463931     3.48   0.001     .0704024    .2522599
                          TREND |   .0007735   .0028821     0.27   0.788    -.0048754    .0064224
                          _cons |  -5.970793   .2269811   -26.31   0.000    -6.415668   -5.525918
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |   4.549041   2.425056     1.88   0.061     -.203982    9.302064
                      lnspecial |  -10.39102          .        .       .            .           .
                          _cons |   10.66122   14.18414     0.75   0.452    -17.13919    38.46162
--------------------------------+----------------------------------------------------------------
Usigma                          |
                          _cons |   1.087618   .3023651     3.60   0.000     .4949937    1.680243
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                          TREND |   .0520202   .0112184     4.64   0.000     .0300326    .0740078
                          _cons |  -2.724706   .0753686   -36.15   0.000    -2.872426   -2.576986
--------------------------------+----------------------------------------------------------------
  E(sigma_v) |   .2925477                                 .2922191    .2928763
     sigma_u |   1.722556   .2604204     6.61   0.000     1.280815    2.316648
------------------------------------------------------------------------------

. estimates store `model1name'_DEU_`tech_or_cost'

. di `e(converged)'
1

. 
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "FRA",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vl
> ist') usigma(`z_vlist') vsigma(`z_vlist')


initial:       Log pseudolikelihood = -19864.886
Iteration 0:   Log pseudolikelihood = -19864.886  
Iteration 1:   Log pseudolikelihood = -11595.298  (backed up)
Iteration 2:   Log pseudolikelihood = -6813.7895  (backed up)
Iteration 3:   Log pseudolikelihood = -6563.9613  (backed up)
Iteration 4:   Log pseudolikelihood = -6474.5267  (backed up)
Iteration 5:   Log pseudolikelihood = -6349.0827  (backed up)
Iteration 6:   Log pseudolikelihood = -6297.7938  (backed up)
Iteration 7:   Log pseudolikelihood = -6254.8535  (backed up)
Iteration 8:   Log pseudolikelihood = -6236.5193  (backed up)
Iteration 9:   Log pseudolikelihood = -6108.3969  
Iteration 10:  Log pseudolikelihood = -5889.6013  
Iteration 11:  Log pseudolikelihood = -5889.6013  (backed up)
Iteration 12:  Log pseudolikelihood = -5887.5107  
Iteration 13:  Log pseudolikelihood = -5559.2232  
Iteration 14:  Log pseudolikelihood = -5131.2427  
Iteration 15:  Log pseudolikelihood = -4993.1338  
Iteration 16:  Log pseudolikelihood = -4916.5868  
Iteration 17:  Log pseudolikelihood = -4851.9375  (backed up)
Iteration 18:  Log pseudolikelihood = -4841.5033  (backed up)
Iteration 19:  Log pseudolikelihood = -4838.0111  (backed up)
Iteration 20:  Log pseudolikelihood = -4837.5322  (backed up)
Iteration 21:  Log pseudolikelihood = -4837.2046  (backed up)
Iteration 22:  Log pseudolikelihood = -4837.1653  (backed up)
Iteration 23:  Log pseudolikelihood = -4837.1653  (backed up)
Iteration 24:  Log pseudolikelihood = -4778.0929  
Iteration 25:  Log pseudolikelihood = -4428.0138  
Iteration 26:  Log pseudolikelihood = -4219.9193  
Iteration 27:  Log pseudolikelihood = -4055.9291  
Iteration 28:  Log pseudolikelihood = -3438.2776  
Iteration 29:  Log pseudolikelihood =  -2509.029  
Iteration 30:  Log pseudolikelihood = -2327.4218  
Iteration 31:  Log pseudolikelihood = -2166.1748  
Iteration 32:  Log pseudolikelihood = -2153.9303  (backed up)
Iteration 33:  Log pseudolikelihood =  -2148.262  (backed up)
Iteration 34:  Log pseudolikelihood = -2147.5448  (backed up)
Iteration 35:  Log pseudolikelihood = -2147.1543  (backed up)
Iteration 36:  Log pseudolikelihood = -2147.0901  (backed up)
Iteration 37:  Log pseudolikelihood = -2147.0796  (backed up)
Iteration 38:  Log pseudolikelihood = -2147.0726  (backed up)
Iteration 39:  Log pseudolikelihood = -2147.0712  (backed up)
Iteration 40:  Log pseudolikelihood =  -2147.071  (backed up)
Iteration 41:  Log pseudolikelihood =  -2147.071  (backed up)
Iteration 42:  Log pseudolikelihood = -2147.0709  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 43:  Log pseudolikelihood = -2147.0709  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 44:  Log pseudolikelihood = -2147.0709  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 45:  Log pseudolikelihood = -2147.0709  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 46:  Log pseudolikelihood = -2147.0709  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 47:  Log pseudolikelihood = -2147.0709  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 48:  Log pseudolikelihood = -2147.0709  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 49:  Log pseudolikelihood = -2147.0709  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 50:  Log pseudolikelihood = -2147.0709  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 51:  Log pseudolikelihood = -2147.0709  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 52:  Log pseudolikelihood = -2147.0709  (backed up)
Iteration 53:  Log pseudolikelihood = -2090.1121  (backed up)
Iteration 54:  Log pseudolikelihood =  -1949.079  
Iteration 55:  Log pseudolikelihood =  -1949.079  (backed up)
Iteration 56:  Log pseudolikelihood =  -1949.079  (backed up)
Iteration 57:  Log pseudolikelihood = -1948.2053  
Iteration 58:  Log pseudolikelihood = -1948.2043  
Iteration 59:  Log pseudolikelihood = -1948.2043  (backed up)
Iteration 60:  Log pseudolikelihood = -1946.8936  (backed up)
Iteration 61:  Log pseudolikelihood = -1940.9641  
Iteration 62:  Log pseudolikelihood = -1935.0122  
Iteration 63:  Log pseudolikelihood = -1931.1259  
Iteration 64:  Log pseudolikelihood = -1928.0416  
Iteration 65:  Log pseudolikelihood = -1923.7583  
Iteration 66:  Log pseudolikelihood =  -1923.586  
Iteration 67:  Log pseudolikelihood =  -1923.586  (backed up)
Iteration 68:  Log pseudolikelihood = -1923.5578  (backed up)
Iteration 69:  Log pseudolikelihood = -1923.5578  (backed up)
Iteration 70:  Log pseudolikelihood = -1923.5511  
Iteration 71:  Log pseudolikelihood = -1923.5511  (backed up)
Iteration 72:  Log pseudolikelihood = -1920.0771  
Iteration 73:  Log pseudolikelihood = -1896.4727  
Iteration 74:  Log pseudolikelihood = -1892.5353  
Iteration 75:  Log pseudolikelihood = -1873.7238  
Iteration 76:  Log pseudolikelihood = -1860.3366  
Iteration 77:  Log pseudolikelihood = -1859.8934  
Iteration 78:  Log pseudolikelihood = -1859.8934  (backed up)
Iteration 79:  Log pseudolikelihood = -1837.7924  
Iteration 80:  Log pseudolikelihood = -1814.4521  
Iteration 81:  Log pseudolikelihood = -1813.4721  
Iteration 82:  Log pseudolikelihood = -1813.4721  (backed up)
Iteration 83:  Log pseudolikelihood = -1813.4721  (backed up)
Iteration 84:  Log pseudolikelihood =  -1813.365  (backed up)
Iteration 85:  Log pseudolikelihood = -1806.8205  
Iteration 86:  Log pseudolikelihood = -1765.3736  
Iteration 87:  Log pseudolikelihood = -1734.2162  
Iteration 88:  Log pseudolikelihood = -1733.7561  
Iteration 89:  Log pseudolikelihood = -1733.7561  (backed up)
Iteration 90:  Log pseudolikelihood = -1733.7561  (backed up)
Iteration 91:  Log pseudolikelihood = -1717.6578  
Iteration 92:  Log pseudolikelihood = -1689.0241  
Iteration 93:  Log pseudolikelihood = -1687.9602  
Iteration 94:  Log pseudolikelihood = -1687.9602  (backed up)
Iteration 95:  Log pseudolikelihood = -1687.9575  
Iteration 96:  Log pseudolikelihood = -1687.9575  (backed up)
Iteration 97:  Log pseudolikelihood = -1683.1061  
Iteration 98:  Log pseudolikelihood = -1682.1359  
Iteration 99:  Log pseudolikelihood = -1682.1341  
Iteration 100: Log pseudolikelihood = -1682.1341  (backed up)

Inefficiency effects model (truncated-normal)        Number of obs =      3727
Group variable: pid                               Number of groups =      1629
Time variable: year                             Obs per group: min =         1
                                                               avg =       2.3
                                                               max =         8

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood = -1682.1341                    Wald chi2(5)  =   2834.00

                                                    (Std. Err. adjusted for 1629 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |   1.080176   .0206342    52.35   0.000     1.039734    1.120618
                 lnPTotalCattle |   .7468181    .175038     4.27   0.000     .4037499    1.089886
lnPCompoundfeedingstuffsforcatt |  -1.658272   .2788289    -5.95   0.000    -2.204766   -1.111777
 lnPFERTILISERSANDSOILIMPROVERS |   1.369954   .1834163     7.47   0.000     1.010465    1.729444
                          TREND |  -.0557684   .0078136    -7.14   0.000    -.0710829    -.040454
                          _cons |  -1.744567   1.166915    -1.50   0.135    -4.031679    .5425443
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |   2.119619   .0920515    23.03   0.000     1.939201    2.300036
                      lnspecial |   .6014002   .0756384     7.95   0.000     .4531517    .7496487
                          _cons |  -11.40766          .        .       .            .           .
--------------------------------+----------------------------------------------------------------
Usigma                          |
                   lngrassratio |  -1.021667   .0647752   -15.77   0.000    -1.148624   -.8947101
                      lnspecial |   -2.62967   .0471249   -55.80   0.000    -2.722033   -2.537307
                          _cons |   14.10721          .        .       .            .           .
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                   lngrassratio |  -.0192356   .0952203    -0.20   0.840    -.2058639    .1673927
                      lnspecial |   7.218567   .0670641   107.64   0.000     7.087123     7.35001
                          _cons |  -33.50697          .        .       .            .           .
--------------------------------+----------------------------------------------------------------
  E(sigma_u) |   1.134337                                 1.105552    1.163122
  E(sigma_v) |   .5033374                                 .3305072    .6761677
------------------------------------------------------------------------------

. estimates store `model1name'_FRA_`tech_or_cost' 

. di `e(converged)'
0

. 
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "IRE",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vl
> ist') usigma(`z_vlist') vsigma(`z_vlist')


initial:       Log pseudolikelihood = -19403.607
Iteration 0:   Log pseudolikelihood = -19403.607  
Iteration 1:   Log pseudolikelihood = -11938.723  (backed up)
Iteration 2:   Log pseudolikelihood = -5916.3899  (backed up)
Iteration 3:   Log pseudolikelihood = -5851.0182  (backed up)
Iteration 4:   Log pseudolikelihood = -5829.9909  (backed up)
Iteration 5:   Log pseudolikelihood = -5753.2177  (backed up)
Iteration 6:   Log pseudolikelihood = -5702.4877  (backed up)
Iteration 7:   Log pseudolikelihood = -5658.6213  (backed up)
Iteration 8:   Log pseudolikelihood = -5477.2596  
Iteration 9:   Log pseudolikelihood = -5443.0853  
Iteration 10:  Log pseudolikelihood = -5440.2164  (backed up)
Iteration 11:  Log pseudolikelihood = -5385.2156  
Iteration 12:  Log pseudolikelihood = -4862.0533  
Iteration 13:  Log pseudolikelihood = -4559.7376  
Iteration 14:  Log pseudolikelihood = -4312.8423  
Iteration 15:  Log pseudolikelihood = -4225.5764  
Iteration 16:  Log pseudolikelihood = -4125.3545  
Iteration 17:  Log pseudolikelihood = -4049.8465  
Iteration 18:  Log pseudolikelihood = -4044.2402  (backed up)
Iteration 19:  Log pseudolikelihood = -4042.1371  (backed up)
Iteration 20:  Log pseudolikelihood = -4041.7736  (backed up)
Iteration 21:  Log pseudolikelihood = -4041.6302  (backed up)
Iteration 22:  Log pseudolikelihood = -4041.6118  (backed up)
Iteration 23:  Log pseudolikelihood = -4041.5661  (backed up)
Iteration 24:  Log pseudolikelihood = -4041.5637  (backed up)
Iteration 25:  Log pseudolikelihood = -4041.5636  (backed up)
Iteration 26:  Log pseudolikelihood = -4041.5636  (backed up)
Iteration 27:  Log pseudolikelihood = -4041.5628  (backed up)
Iteration 28:  Log pseudolikelihood =  -4041.562  (backed up)
Iteration 29:  Log pseudolikelihood = -4041.5617  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 30:  Log pseudolikelihood = -4041.5617  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 31:  Log pseudolikelihood = -4041.5615  (backed up)
Iteration 32:  Log pseudolikelihood = -3462.3395  
Iteration 33:  Log pseudolikelihood = -3245.6685  
Iteration 34:  Log pseudolikelihood = -2453.9696  
Iteration 35:  Log pseudolikelihood = -2041.1649  
Iteration 36:  Log pseudolikelihood = -1906.7837  
Iteration 37:  Log pseudolikelihood = -1861.1746  (backed up)
Iteration 38:  Log pseudolikelihood =  -1835.096  (backed up)
Iteration 39:  Log pseudolikelihood = -1833.2112  (backed up)
Iteration 40:  Log pseudolikelihood = -1833.1492  (backed up)
Iteration 41:  Log pseudolikelihood = -1833.1196  (backed up)
Iteration 42:  Log pseudolikelihood = -1833.1178  (backed up)
Iteration 43:  Log pseudolikelihood = -1833.1169  (backed up)
Iteration 44:  Log pseudolikelihood = -1833.1164  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 45:  Log pseudolikelihood = -1833.1163  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 46:  Log pseudolikelihood = -1833.1162  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 47:  Log pseudolikelihood = -1833.1162  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 48:  Log pseudolikelihood = -1833.1162  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 49:  Log pseudolikelihood = -1833.1162  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 50:  Log pseudolikelihood = -1833.1162  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 51:  Log pseudolikelihood = -1833.1162  (backed up)
could not calculate numerical derivatives -- discontinuous region with missing values encountered
could not calculate numerical derivatives -- discontinuous region with missing values encountered
estimates post: matrix has missing values
r(504);

end of do-file

r(504);

. do msward_2013_11_22_cost.do

. * Based on msward_code_clarity.do
. capture log close
----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.txt
  log type:  text
 opened on:  22 Nov 2013, 15:02:09

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  15:02:09  on 22 Nov 2013

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(cmdlog G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file G:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vl
> ist') vsigma(TREND)
> estimates store `model1name'_DEU_`tech_or_cost'
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "FRA",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vl
> ist') usigma(`z_vlist') vsigma(TREND)
> estimates store `model1name'_FRA_`tech_or_cost' 
> di `e(converged)'
> */
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "IRE",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vl
> ist') usigma(`z_vlist') 


initial:       Log pseudolikelihood = -18260.666
Iteration 0:   Log pseudolikelihood = -18260.666  
Iteration 1:   Log pseudolikelihood = -13434.349  (backed up)
Iteration 2:   Log pseudolikelihood = -7622.8719  (backed up)
Iteration 3:   Log pseudolikelihood = -7497.4589  (backed up)
Iteration 4:   Log pseudolikelihood = -6425.6533  (backed up)
Iteration 5:   Log pseudolikelihood = -6369.4881  (backed up)
Iteration 6:   Log pseudolikelihood = -6131.8482  (backed up)
Iteration 7:   Log pseudolikelihood = -6075.2981  (backed up)
Iteration 8:   Log pseudolikelihood = -6007.8542  
Iteration 9:   Log pseudolikelihood =  -4783.877  
Iteration 10:  Log pseudolikelihood = -4081.0749  
Iteration 11:  Log pseudolikelihood = -3759.2684  
Iteration 12:  Log pseudolikelihood = -3651.3242  
Iteration 13:  Log pseudolikelihood = -3651.3242  (backed up)
Iteration 14:  Log pseudolikelihood = -3641.0347  
Iteration 15:  Log pseudolikelihood = -3533.5117  
Iteration 16:  Log pseudolikelihood = -3391.3291  
Iteration 17:  Log pseudolikelihood = -3163.0996  
Iteration 18:  Log pseudolikelihood = -3036.9014  
Iteration 19:  Log pseudolikelihood = -2943.5348  
Iteration 20:  Log pseudolikelihood = -2396.5157  
Iteration 21:  Log pseudolikelihood = -2229.2182  
Iteration 22:  Log pseudolikelihood = -1796.7738  
Iteration 23:  Log pseudolikelihood = -1428.8869  
Iteration 24:  Log pseudolikelihood = -935.18086  
Iteration 25:  Log pseudolikelihood = -477.09202  
Iteration 26:  Log pseudolikelihood = -282.65771  
Iteration 27:  Log pseudolikelihood =  23.549829  
Iteration 28:  Log pseudolikelihood =  121.74684  
Iteration 29:  Log pseudolikelihood =  212.66839  
Iteration 30:  Log pseudolikelihood =   267.9872  
Iteration 31:  Log pseudolikelihood =  293.85277  
Iteration 32:  Log pseudolikelihood =  309.58281  
Iteration 33:  Log pseudolikelihood =  314.77481  
Iteration 34:  Log pseudolikelihood =  320.11677  
Iteration 35:  Log pseudolikelihood =  327.22821  
Iteration 36:  Log pseudolikelihood =  331.05563  
Iteration 37:  Log pseudolikelihood =  335.00247  
Iteration 38:  Log pseudolikelihood =   336.5606  
Iteration 39:  Log pseudolikelihood =  337.52135  
Iteration 40:  Log pseudolikelihood =  337.91694  
Iteration 41:  Log pseudolikelihood =  338.47052  
Iteration 42:  Log pseudolikelihood =  338.98321  
Iteration 43:  Log pseudolikelihood =  341.34784  
Iteration 44:  Log pseudolikelihood =  342.10785  
Iteration 45:  Log pseudolikelihood =   342.4216  
Iteration 46:  Log pseudolikelihood =  343.16424  
Iteration 47:  Log pseudolikelihood =  343.22501  
Iteration 48:  Log pseudolikelihood =  343.23451  
Iteration 49:  Log pseudolikelihood =   343.2353  
Iteration 50:  Log pseudolikelihood =  343.23533  

Inefficiency effects model (truncated-normal)        Number of obs =      3549
Group variable: pid                               Number of groups =       724
Time variable: year                             Obs per group: min =         1
                                                               avg =       4.9
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood =   343.2353                    Wald chi2(5)  =   7402.14

                                                     (Std. Err. adjusted for 724 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |    .984384   .0121129    81.27   0.000      .960643    1.008125
                 lnPTotalCattle |   .2705533   .0724399     3.73   0.000     .1285738    .4125328
lnPCompoundfeedingstuffsforcatt |   1.019733    .090773    11.23   0.000     .8418212    1.197645
 lnPFERTILISERSANDSOILIMPROVERS |   .3441195   .0810692     4.24   0.000     .1852269    .5030122
                          TREND |   -.044969   .0050669    -8.88   0.000    -.0548999   -.0350382
                          _cons |   -16.3578   .5192922   -31.50   0.000     -17.3756   -15.34001
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |  -.0998233   .0137938    -7.24   0.000    -.1268586   -.0727879
                      lnspecial |  -1.019213   .0501654   -20.32   0.000    -1.117536   -.9208911
                          _cons |   13.07795          .        .       .            .           .
--------------------------------+----------------------------------------------------------------
Usigma                          |
                   lngrassratio |  -1.397906   .3153606    -4.43   0.000    -2.016002   -.7798106
                      lnspecial |   2.757505   .9449816     2.92   0.004     .9053754    4.609635
                          _cons |  -13.09381   4.434923    -2.95   0.003     -21.7861   -4.401524
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                          _cons |  -3.179744   .0846214   -37.58   0.000    -3.345599   -3.013889
--------------------------------+----------------------------------------------------------------
  E(sigma_u) |   .0779142                                 .0754564    .0803719
     sigma_v |   .2039517   .0086293    23.63   0.000     .1877208     .221586
------------------------------------------------------------------------------

. estimates store `model1name'_IRE_`tech_or_cost'

. di `e(converged)'
1

. 
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "UKI",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vl
> ist') usigma(`z_vlist')


initial:       Log pseudolikelihood = -23991.175
Iteration 0:   Log pseudolikelihood = -23991.175  
Iteration 1:   Log pseudolikelihood = -18498.644  (backed up)
Iteration 2:   Log pseudolikelihood = -17830.249  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   Log pseudolikelihood = -10799.095  (backed up)
Iteration 4:   Log pseudolikelihood = -10761.213  (backed up)
Iteration 5:   Log pseudolikelihood = -9732.3019  (backed up)
Iteration 6:   Log pseudolikelihood = -8596.8721  (backed up)
Iteration 7:   Log pseudolikelihood = -8589.0818  (backed up)
Iteration 8:   Log pseudolikelihood = -8084.8637  
Iteration 9:   Log pseudolikelihood = -7634.0649  (backed up)
Iteration 10:  Log pseudolikelihood = -6958.8726  
Iteration 11:  Log pseudolikelihood = -6934.3472  
Iteration 12:  Log pseudolikelihood =  -6222.521  
Iteration 13:  Log pseudolikelihood = -6078.4533  
Iteration 14:  Log pseudolikelihood = -5559.6406  
Iteration 15:  Log pseudolikelihood = -4991.2346  
Iteration 16:  Log pseudolikelihood = -3772.6173  
Iteration 17:  Log pseudolikelihood = -3665.0266  
Iteration 18:  Log pseudolikelihood = -3068.8555  
Iteration 19:  Log pseudolikelihood = -2914.2336  
Iteration 20:  Log pseudolikelihood = -2896.6358  
Iteration 21:  Log pseudolikelihood = -2896.6358  (backed up)
Iteration 22:  Log pseudolikelihood = -2896.3037  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 23:  Log pseudolikelihood = -2896.3037  (backed up)
Iteration 24:  Log pseudolikelihood = -2877.2468  (backed up)
Iteration 25:  Log pseudolikelihood =  -1844.637  (backed up)
Iteration 26:  Log pseudolikelihood = -672.95596  (backed up)
Iteration 27:  Log pseudolikelihood = -562.67172  (backed up)
Iteration 28:  Log pseudolikelihood = -559.29497  (backed up)
Iteration 29:  Log pseudolikelihood = -554.22045  (backed up)
Iteration 30:  Log pseudolikelihood = -376.81103  
Iteration 31:  Log pseudolikelihood = -332.34637  
Iteration 32:  Log pseudolikelihood = -328.32745  
Iteration 33:  Log pseudolikelihood = -319.51643  
Iteration 34:  Log pseudolikelihood = -317.80602  
Iteration 35:  Log pseudolikelihood = -294.70582  
Iteration 36:  Log pseudolikelihood = -289.38312  
Iteration 37:  Log pseudolikelihood = -281.79031  
Iteration 38:  Log pseudolikelihood = -276.11472  
Iteration 39:  Log pseudolikelihood = -275.14164  
Iteration 40:  Log pseudolikelihood = -272.47089  
Iteration 41:  Log pseudolikelihood = -269.46304  
Iteration 42:  Log pseudolikelihood = -267.36649  
Iteration 43:  Log pseudolikelihood =  -266.9446  
Iteration 44:  Log pseudolikelihood = -266.29822  
Iteration 45:  Log pseudolikelihood = -265.94323  
Iteration 46:  Log pseudolikelihood = -265.46469  
Iteration 47:  Log pseudolikelihood = -265.31097  
Iteration 48:  Log pseudolikelihood = -265.25399  
Iteration 49:  Log pseudolikelihood = -265.24387  
Iteration 50:  Log pseudolikelihood = -265.24308  
Iteration 51:  Log pseudolikelihood =  -265.2429  
Iteration 52:  Log pseudolikelihood =  -265.2429  

Inefficiency effects model (truncated-normal)        Number of obs =      4961
Group variable: pid                               Number of groups =      1682
Time variable: year                             Obs per group: min =         1
                                                               avg =       2.9
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood =  -265.2429                    Wald chi2(5)  =   9769.85

                                                    (Std. Err. adjusted for 1682 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |    .991189    .011176    88.69   0.000     .9692844    1.013094
                 lnPTotalCattle |   .2824773   .0811232     3.48   0.000     .1234788    .4414758
lnPCompoundfeedingstuffsforcatt |   .9705705   .1065852     9.11   0.000     .7616674    1.179474
 lnPFERTILISERSANDSOILIMPROVERS |   .6137901   .0966777     6.35   0.000     .4243052    .8032751
                          TREND |  -.0504789   .0067898    -7.43   0.000    -.0637867   -.0371711
                          _cons |   -21.3268   .4539999   -46.98   0.000    -22.21663   -20.43698
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |   .0172176   .0055437     3.11   0.002     .0063522     .028083
                      lnspecial |  -.8387546   .0721304   -11.63   0.000    -.9801276   -.6973816
                          _cons |   15.98282   .2919159    54.75   0.000     15.41067    16.55496
--------------------------------+----------------------------------------------------------------
Usigma                          |
                   lngrassratio |   2.198627   .4834996     4.55   0.000     1.250985    3.146269
                      lnspecial |  -2.296248   1.369504    -1.68   0.094    -4.980426    .3879308
                          _cons |  -1.756786   5.769211    -0.30   0.761    -13.06423     9.55066
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                          _cons |  -2.800038   .0669579   -41.82   0.000    -2.931273   -2.668803
--------------------------------+----------------------------------------------------------------
  E(sigma_u) |   .0514477                                 .0498037    .0530917
     sigma_v |   .2465923   .0082557    29.87   0.000     .2309309    .2633157
------------------------------------------------------------------------------

. estimates store `model1name'_UKI_`tech_or_cost'

. di `e(converged)'
1

. 
. sfpanel `dep_vlist' `indep_vlist' TREND if atl_plains == 1, `cost'  model(bc95) d(tnormal) posthessian robust emean(`z_vli
> st') usigma(`z_vlist') vsigma(TREND)


initial:       Log pseudolikelihood = -36775.006
Iteration 0:   Log pseudolikelihood = -36775.006  
Iteration 1:   Log pseudolikelihood = -21749.985  (backed up)
Iteration 2:   Log pseudolikelihood = -17760.886  (backed up)
Iteration 3:   Log pseudolikelihood = -17667.024  (backed up)
Iteration 4:   Log pseudolikelihood = -16898.296  (backed up)
Iteration 5:   Log pseudolikelihood = -16855.231  (backed up)
Iteration 6:   Log pseudolikelihood = -16850.746  (backed up)
Iteration 7:   Log pseudolikelihood = -16782.295  (backed up)
Iteration 8:   Log pseudolikelihood = -16712.316  (backed up)
Iteration 9:   Log pseudolikelihood = -14006.933  
Iteration 10:  Log pseudolikelihood = -13324.618  (backed up)
Iteration 11:  Log pseudolikelihood = -13037.116  
Iteration 12:  Log pseudolikelihood = -12614.586  
Iteration 13:  Log pseudolikelihood = -10636.025  
Iteration 14:  Log pseudolikelihood =  -10499.33  
Iteration 15:  Log pseudolikelihood = -10484.827  (backed up)
Iteration 16:  Log pseudolikelihood = -10479.463  (backed up)
Iteration 17:  Log pseudolikelihood = -10478.288  (backed up)
Iteration 18:  Log pseudolikelihood = -10477.198  (backed up)
Iteration 19:  Log pseudolikelihood = -10476.865  (backed up)
Iteration 20:  Log pseudolikelihood = -10476.836  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 21:  Log pseudolikelihood = -10476.818  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 22:  Log pseudolikelihood = -10476.817  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 23:  Log pseudolikelihood = -10476.816  (backed up)
Iteration 24:  Log pseudolikelihood = -9689.2404  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 25:  Log pseudolikelihood = -9689.2404  (backed up)
Iteration 26:  Log pseudolikelihood = -9681.8095  (backed up)
Iteration 27:  Log pseudolikelihood = -8997.4291  (backed up)
Iteration 28:  Log pseudolikelihood = -8987.9554  (backed up)
Iteration 29:  Log pseudolikelihood = -5611.9985  (backed up)
Iteration 30:  Log pseudolikelihood = -5559.8236  (backed up)
Iteration 31:  Log pseudolikelihood = -5456.8612  (backed up)
Iteration 32:  Log pseudolikelihood = -5400.5525  (backed up)
Iteration 33:  Log pseudolikelihood = -4836.4922  (backed up)
Iteration 34:  Log pseudolikelihood = -3992.5228  (backed up)
Iteration 35:  Log pseudolikelihood = -3398.5248  (backed up)
Iteration 36:  Log pseudolikelihood = -3068.4181  
Iteration 37:  Log pseudolikelihood = -1393.0333  
Iteration 38:  Log pseudolikelihood = -841.36674  
Iteration 39:  Log pseudolikelihood = -835.87971  
Iteration 40:  Log pseudolikelihood =  1535.1438  
Iteration 41:  Log pseudolikelihood =  2069.6049  
Iteration 42:  Log pseudolikelihood =  2122.7941  
Iteration 43:  Log pseudolikelihood =  2191.5103  
Iteration 44:  Log pseudolikelihood =  2214.4473  
Iteration 45:  Log pseudolikelihood =  2219.0204  
Iteration 46:  Log pseudolikelihood =  2228.8579  
Iteration 47:  Log pseudolikelihood =  2230.4878  
Iteration 48:  Log pseudolikelihood =  2230.6232  
Iteration 49:  Log pseudolikelihood =  2231.2891  
Iteration 50:  Log pseudolikelihood =  2231.3064  
Iteration 51:  Log pseudolikelihood =  2231.6673  
Iteration 52:  Log pseudolikelihood =  2231.7612  
Iteration 53:  Log pseudolikelihood =  2231.7666  
Iteration 54:  Log pseudolikelihood =   2231.767  
Iteration 55:  Log pseudolikelihood =   2231.767  

Inefficiency effects model (truncated-normal)        Number of obs =      7353
Group variable: pid                               Number of groups =      1909
Time variable: year                             Obs per group: min =         1
                                                               avg =       3.9
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood =  2231.7670                    Wald chi2(5)  =  11562.39

                                                    (Std. Err. adjusted for 1909 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |   .9812546   .0093214   105.27   0.000     .9629851    .9995241
                 lnPTotalCattle |  -.0697699   .0696829    -1.00   0.317    -.2063459    .0668062
lnPCompoundfeedingstuffsforcatt |   .7743301   .1673987     4.63   0.000     .4462347    1.102426
 lnPFERTILISERSANDSOILIMPROVERS |   .5226542   .0828377     6.31   0.000     .3602953    .6850131
                          TREND |  -.0497909    .004245   -11.73   0.000     -.058111   -.0414708
                          _cons |  -21.36733          .        .       .            .           .
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |  -.0518436   .0074689    -6.94   0.000    -.0664823    -.037205
                      lnspecial |  -.9833663   .0610059   -16.12   0.000    -1.102936   -.8637969
                          _cons |   18.16485   .6355415    28.58   0.000     16.91922    19.41049
--------------------------------+----------------------------------------------------------------
Usigma                          |
                   lngrassratio |   .3987186          .        .       .            .           .
                      lnspecial |  -4.506775          .        .       .            .           .
                          _cons |   -3.22521          .        .       .            .           .
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                          TREND |   .5616244   .0224623    25.00   0.000     .5175992    .6056497
                          _cons |  -4.713819   .0776168   -60.73   0.000    -4.865945   -4.561693
--------------------------------+----------------------------------------------------------------
  E(sigma_u) |   .0000213                                 .0000204    .0000223
  E(sigma_v) |   .4786841                                 .4710621    .4863061
------------------------------------------------------------------------------

. estimates store `model1name'_ATL_`tech_or_cost'

. di `e(converged)'
1

. 
. sfpanel `dep_vlist' `indep_vlist' TREND if cont_eur == 1,   `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlis
> t') usigma(`z_vlist') vsigma(TREND)


initial:       Log pseudolikelihood = -90754.312
Iteration 0:   Log pseudolikelihood = -90754.312  
Iteration 1:   Log pseudolikelihood = -71441.768  (backed up)
Iteration 2:   Log pseudolikelihood = -51699.243  (backed up)
Iteration 3:   Log pseudolikelihood = -49412.005  (backed up)
Iteration 4:   Log pseudolikelihood = -47595.671  (backed up)
Iteration 5:   Log pseudolikelihood = -45574.898  (backed up)
Iteration 6:   Log pseudolikelihood = -45571.192  (backed up)
Iteration 7:   Log pseudolikelihood = -45459.286  (backed up)
Iteration 8:   Log pseudolikelihood = -45385.069  (backed up)
Iteration 9:   Log pseudolikelihood = -44410.705  
Iteration 10:  Log pseudolikelihood =  -43331.16  
Iteration 11:  Log pseudolikelihood =  -39293.99  
Iteration 12:  Log pseudolikelihood = -37776.963  
Iteration 13:  Log pseudolikelihood = -36410.456  
Iteration 14:  Log pseudolikelihood = -35810.699  (backed up)
Iteration 15:  Log pseudolikelihood =  -35368.82  (backed up)
Iteration 16:  Log pseudolikelihood = -32425.927  
Iteration 17:  Log pseudolikelihood = -31503.041  (backed up)
Iteration 18:  Log pseudolikelihood = -26617.366  
Iteration 19:  Log pseudolikelihood =  -26565.44  (backed up)
Iteration 20:  Log pseudolikelihood = -22129.937  
Iteration 21:  Log pseudolikelihood = -21392.647  
Iteration 22:  Log pseudolikelihood = -21382.348  
Iteration 23:  Log pseudolikelihood = -21382.348  (backed up)
Iteration 24:  Log pseudolikelihood = -21254.588  (backed up)
Iteration 25:  Log pseudolikelihood = -21254.588  (backed up)
Iteration 26:  Log pseudolikelihood = -21253.266  
Iteration 27:  Log pseudolikelihood = -21253.266  (backed up)
Iteration 28:  Log pseudolikelihood = -21252.737  (backed up)
Iteration 29:  Log pseudolikelihood = -21146.451  
Iteration 30:  Log pseudolikelihood = -20691.172  
Iteration 31:  Log pseudolikelihood = -18770.287  
Iteration 32:  Log pseudolikelihood =  -16348.24  
Iteration 33:  Log pseudolikelihood = -15127.983  
Iteration 34:  Log pseudolikelihood = -14529.403  
Iteration 35:  Log pseudolikelihood = -12887.685  
Iteration 36:  Log pseudolikelihood = -11938.915  
Iteration 37:  Log pseudolikelihood = -11189.504  
Iteration 38:  Log pseudolikelihood = -10351.072  
Iteration 39:  Log pseudolikelihood = -9534.5885  
Iteration 40:  Log pseudolikelihood = -9371.0691  
Iteration 41:  Log pseudolikelihood = -9113.0759  
Iteration 42:  Log pseudolikelihood = -8969.4955  
Iteration 43:  Log pseudolikelihood = -8912.1649  
Iteration 44:  Log pseudolikelihood = -8783.9567  
Iteration 45:  Log pseudolikelihood =  -8318.116  
Iteration 46:  Log pseudolikelihood = -7888.9777  
Iteration 47:  Log pseudolikelihood = -7745.7416  
Iteration 48:  Log pseudolikelihood =  -7705.721  
Iteration 49:  Log pseudolikelihood = -7704.4518  
Iteration 50:  Log pseudolikelihood = -7680.0684  
Iteration 51:  Log pseudolikelihood = -7674.0603  
Iteration 52:  Log pseudolikelihood = -7673.6529  
Iteration 53:  Log pseudolikelihood = -7673.6529  (backed up)
Iteration 54:  Log pseudolikelihood = -7669.3482  (backed up)
Iteration 55:  Log pseudolikelihood = -7659.2609  
Iteration 56:  Log pseudolikelihood = -7635.7874  
Iteration 57:  Log pseudolikelihood = -7612.4132  
Iteration 58:  Log pseudolikelihood = -7459.3684  
Iteration 59:  Log pseudolikelihood =  -7154.538  
Iteration 60:  Log pseudolikelihood = -7128.9838  
Iteration 61:  Log pseudolikelihood = -7127.3176  
Iteration 62:  Log pseudolikelihood = -7127.3176  
Iteration 63:  Log pseudolikelihood = -7127.3176  (backed up)
Iteration 64:  Log pseudolikelihood = -7127.2966  
Iteration 65:  Log pseudolikelihood = -7127.0907  
Iteration 66:  Log pseudolikelihood = -7123.2619  
Iteration 67:  Log pseudolikelihood =  -7017.075  
Iteration 68:  Log pseudolikelihood = -6833.0445  
Iteration 69:  Log pseudolikelihood = -6771.0382  
Iteration 70:  Log pseudolikelihood = -6686.2776  
Iteration 71:  Log pseudolikelihood = -6655.5883  
Iteration 72:  Log pseudolikelihood = -6653.7288  
Iteration 73:  Log pseudolikelihood = -6649.5253  
Iteration 74:  Log pseudolikelihood = -6649.5244  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 75:  Log pseudolikelihood = -6649.5244  (backed up)
Iteration 76:  Log pseudolikelihood =  -6580.691  (backed up)
Iteration 77:  Log pseudolikelihood = -6443.9039  (backed up)
Iteration 78:  Log pseudolikelihood = -6352.3214  (backed up)
Iteration 79:  Log pseudolikelihood = -996.00476  (backed up)
Iteration 80:  Log pseudolikelihood = -710.91163  (backed up)
Iteration 81:  Log pseudolikelihood = -706.29483  (backed up)
Iteration 82:  Log pseudolikelihood = -676.44545  (backed up)
Iteration 83:  Log pseudolikelihood = -586.11997  (backed up)
Iteration 84:  Log pseudolikelihood = -521.67068  (backed up)
Iteration 85:  Log pseudolikelihood = -459.73567  (backed up)
Iteration 86:  Log pseudolikelihood =  71.478531  
Iteration 87:  Log pseudolikelihood =  324.76819  
Iteration 88:  Log pseudolikelihood =  1296.1152  
Iteration 89:  Log pseudolikelihood =  1484.6856  
Iteration 90:  Log pseudolikelihood =  1508.7786  
Iteration 91:  Log pseudolikelihood =  1578.3256  
Iteration 92:  Log pseudolikelihood =  1591.4403  
Iteration 93:  Log pseudolikelihood =  1596.4921  
Iteration 94:  Log pseudolikelihood =  1601.6302  
Iteration 95:  Log pseudolikelihood =  1614.5422  
Iteration 96:  Log pseudolikelihood =  1627.1734  
Iteration 97:  Log pseudolikelihood =   1628.706  
Iteration 98:  Log pseudolikelihood =  1631.5284  
Iteration 99:  Log pseudolikelihood =    1632.02  
Iteration 100: Log pseudolikelihood =  1632.8879  

Inefficiency effects model (truncated-normal)        Number of obs =     18253
Group variable: pid                               Number of groups =      5092
Time variable: year                             Obs per group: min =         1
                                                               avg =       3.6
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood =  1632.8879                    Wald chi2(5)  =  20620.85

                                                    (Std. Err. adjusted for 5092 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |   1.033133   .0072878   141.76   0.000     1.018849    1.047417
                 lnPTotalCattle |   .1191519   .0469263     2.54   0.011     .0271781    .2111257
lnPCompoundfeedingstuffsforcatt |   .9417864   .0869492    10.83   0.000     .7713691    1.112204
 lnPFERTILISERSANDSOILIMPROVERS |    .237207   .0604203     3.93   0.000     .1187855    .3556286
                          TREND |  -.0148184   .0027622    -5.36   0.000    -.0202323   -.0094045
                          _cons |  -41.75274   .3207396  -130.18   0.000    -42.38138   -41.12411
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |   .0047507   .0030259     1.57   0.116      -.00118    .0106814
                      lnspecial |  -.7408819   .0407999   -18.16   0.000    -.8208482   -.6609156
                          _cons |   37.18274   .1808628   205.59   0.000     36.82826    37.53723
--------------------------------+----------------------------------------------------------------
Usigma                          |
                   lngrassratio |  -3.464639   .7200409    -4.81   0.000    -4.875893   -2.053385
                      lnspecial |  -39.52423          .        .       .            .           .
                          _cons |   136.3535          .        .       .            .           .
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                          TREND |   .5461369   .0134316    40.66   0.000     .5198114    .5724623
                          _cons |  -4.370751   .0494656   -88.36   0.000    -4.467702     -4.2738
--------------------------------+----------------------------------------------------------------
  E(sigma_u) |   1.68e+08                                -1.61e+08    4.97e+08
  E(sigma_v) |   .5556521                                 .5502628    .5610415
------------------------------------------------------------------------------

. estimates store `model1name'_CEU_`tech_or_cost'

. di `e(converged)'
0

. 
. * BEST RESULT Effect on Mu parameter = -0.0054 Sigma U Parameter = 2.308268 need to figure out partial effect for this. No
> n-monotonic effect of grass. HARD CODE for reference. 
. *sfpanel lntotalspecificcosts lndairyproducts lnPTotalCattle lnPCompoundfeedingstuffsforcatt lnPFERTILISERSANDSOILIMPROVER
> S TREND , cost model(bc95) d(tnormal) posthessian robust emean(lngrassratio lnspecial) usigma(lngrassratio lnspecial) vsig
> ma(TREND)
. 
. sfpanel `dep_vlist' `indep_vlist' TREND , `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usigma(`z_vlis
> t') vsigma(TREND)


initial:       Log pseudolikelihood = -129151.41
Iteration 0:   Log pseudolikelihood = -129151.41  
Iteration 1:   Log pseudolikelihood = -74158.753  (backed up)
Iteration 2:   Log pseudolikelihood = -58846.831  (backed up)
Iteration 3:   Log pseudolikelihood =  -53951.07  (backed up)
Iteration 4:   Log pseudolikelihood = -53178.408  (backed up)
Iteration 5:   Log pseudolikelihood = -52422.649  (backed up)
Iteration 6:   Log pseudolikelihood = -51880.254  (backed up)
Iteration 7:   Log pseudolikelihood = -51648.038  (backed up)
Iteration 8:   Log pseudolikelihood = -51634.535  (backed up)
Iteration 9:   Log pseudolikelihood = -51593.997  (backed up)
Iteration 10:  Log pseudolikelihood = -51511.554  (backed up)
Iteration 11:  Log pseudolikelihood =   -51503.6  (backed up)
Iteration 12:  Log pseudolikelihood = -51503.418  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 13:  Log pseudolikelihood = -51503.386  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 14:  Log pseudolikelihood = -51503.385  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 15:  Log pseudolikelihood = -51503.385  (backed up)
--Break--
r(1);

end of do-file

--Break--
r(1);

. do msward_2013_11_22_cost.do

. * Based on msward_code_clarity.do
. capture log close
----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.txt
  log type:  text
 opened on:  22 Nov 2013, 15:19:30

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  15:19:30  on 22 Nov 2013

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(cmdlog G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file G:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vl
> ist') vsigma(TREND)
> estimates store `model1name'_DEU_`tech_or_cost'
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "FRA",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vl
> ist') usigma(`z_vlist') vsigma(TREND)
> estimates store `model1name'_FRA_`tech_or_cost' 
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "IRE",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vl
> ist') usigma(`z_vlist') 
> estimates store `model1name'_IRE_`tech_or_cost'
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "UKI",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vl
> ist') usigma(`z_vlist')
> estimates store `model1name'_UKI_`tech_or_cost'
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if atl_plains == 1, `cost'  model(bc95) d(tnormal) posthessian robust emean(`z_vli
> st') usigma(`z_vlist') vsigma(TREND)
> estimates store `model1name'_ATL_`tech_or_cost'
> di `e(converged)'
> */
. sfpanel `dep_vlist' `indep_vlist' TREND if cont_eur == 1,   `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlis
> t') usigma(`z_vlist') 


initial:       Log pseudolikelihood = -90455.043
Iteration 0:   Log pseudolikelihood = -90455.043  
Iteration 1:   Log pseudolikelihood = -71969.594  (backed up)
Iteration 2:   Log pseudolikelihood = -32683.044  (backed up)
Iteration 3:   Log pseudolikelihood = -32174.778  (backed up)
Iteration 4:   Log pseudolikelihood = -29688.461  (backed up)
Iteration 5:   Log pseudolikelihood = -25886.042  (backed up)
Iteration 6:   Log pseudolikelihood = -23735.322  (backed up)
Iteration 7:   Log pseudolikelihood = -23460.213  (backed up)
Iteration 8:   Log pseudolikelihood = -23220.117  (backed up)
Iteration 9:   Log pseudolikelihood = -22559.193  
Iteration 10:  Log pseudolikelihood = -22084.658  (backed up)
Iteration 11:  Log pseudolikelihood = -21813.349  (backed up)
Iteration 12:  Log pseudolikelihood = -20786.736  (backed up)
Iteration 13:  Log pseudolikelihood = -19678.681  (backed up)
Iteration 14:  Log pseudolikelihood = -11767.171  
Iteration 15:  Log pseudolikelihood = -9500.0284  
Iteration 16:  Log pseudolikelihood = -8303.9423  
Iteration 17:  Log pseudolikelihood = -6464.7928  
Iteration 18:  Log pseudolikelihood =  -4592.424  
Iteration 19:  Log pseudolikelihood = -4519.9198  
Iteration 20:  Log pseudolikelihood = -4420.3917  
Iteration 21:  Log pseudolikelihood = -4388.6361  
Iteration 22:  Log pseudolikelihood = -4382.4111  
Iteration 23:  Log pseudolikelihood = -4379.1789  
Iteration 24:  Log pseudolikelihood = -4378.7913  (backed up)
Iteration 25:  Log pseudolikelihood = -4378.7858  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 26:  Log pseudolikelihood = -4378.7831  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 27:  Log pseudolikelihood = -4378.7831  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 28:  Log pseudolikelihood = -4378.7831  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 29:  Log pseudolikelihood = -4378.7831  (backed up)
Iteration 30:  Log pseudolikelihood = -4374.9749  
Iteration 31:  Log pseudolikelihood = -4369.8123  
Iteration 32:  Log pseudolikelihood = -4365.4066  
Iteration 33:  Log pseudolikelihood = -4364.6697  
Iteration 34:  Log pseudolikelihood = -4364.4387  (backed up)
Iteration 35:  Log pseudolikelihood = -4364.3803  (backed up)
Iteration 36:  Log pseudolikelihood = -4364.3509  (backed up)
Iteration 37:  Log pseudolikelihood = -4364.3435  (backed up)
Iteration 38:  Log pseudolikelihood = -4364.3398  (backed up)
Iteration 39:  Log pseudolikelihood = -4364.3389  (backed up)
Iteration 40:  Log pseudolikelihood = -4364.3384  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 41:  Log pseudolikelihood = -4364.3382  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 42:  Log pseudolikelihood = -4364.3381  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 43:  Log pseudolikelihood = -4364.3381  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 44:  Log pseudolikelihood = -4364.3381  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 45:  Log pseudolikelihood = -4364.3381  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 46:  Log pseudolikelihood = -4364.2859  (backed up)
Iteration 47:  Log pseudolikelihood = -4356.5881  
Iteration 48:  Log pseudolikelihood = -4347.2214  
Iteration 49:  Log pseudolikelihood =  -4340.568  
Iteration 50:  Log pseudolikelihood = -4339.0931  
Iteration 51:  Log pseudolikelihood = -4338.9942  
Iteration 52:  Log pseudolikelihood = -4338.9849  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 53:  Log pseudolikelihood =  -4338.973  
Iteration 54:  Log pseudolikelihood = -4338.9728  (backed up)
Iteration 55:  Log pseudolikelihood = -4338.9728  (backed up)
Iteration 56:  Log pseudolikelihood = -4338.9726  (backed up)
Iteration 57:  Log pseudolikelihood = -4338.9721  (backed up)
Iteration 58:  Log pseudolikelihood = -4338.9708  (backed up)
Iteration 59:  Log pseudolikelihood = -4338.9706  (backed up)
Iteration 60:  Log pseudolikelihood = -4338.9693  (backed up)
Iteration 61:  Log pseudolikelihood = -4338.9693  (backed up)
Iteration 62:  Log pseudolikelihood = -4338.9691  
Iteration 63:  Log pseudolikelihood = -4338.9655  
Iteration 64:  Log pseudolikelihood = -4338.9631  
Iteration 65:  Log pseudolikelihood = -4338.9623  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 66:  Log pseudolikelihood = -4338.9621  
Iteration 67:  Log pseudolikelihood = -4338.9621  (backed up)
Iteration 68:  Log pseudolikelihood = -4338.9621  (backed up)
Iteration 69:  Log pseudolikelihood = -4338.9621  (backed up)
Iteration 70:  Log pseudolikelihood = -4338.9621  (backed up)
Iteration 71:  Log pseudolikelihood = -4338.9621  (backed up)
Iteration 72:  Log pseudolikelihood = -4338.9621  (backed up)
Iteration 73:  Log pseudolikelihood = -4338.9621  (backed up)
Iteration 74:  Log pseudolikelihood = -4338.9621  (backed up)
Iteration 75:  Log pseudolikelihood = -4338.9621  (backed up)

Inefficiency effects model (truncated-normal)        Number of obs =     18253
Group variable: pid                               Number of groups =      5092
Time variable: year                             Obs per group: min =         1
                                                               avg =       3.6
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood = -4338.9621                    Wald chi2(5)  =  27255.70

                                                    (Std. Err. adjusted for 5092 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |   1.033251   .0072089   143.33   0.000     1.019122     1.04738
                 lnPTotalCattle |   .0126241   .0459243     0.27   0.783    -.0773858     .102634
lnPCompoundfeedingstuffsforcatt |   .6499794   .0316044    20.57   0.000     .5880358    .7119229
 lnPFERTILISERSANDSOILIMPROVERS |   .7032475   .0536898    13.10   0.000     .5980174    .8084776
                          TREND |  -.0258635   .0027504    -9.40   0.000    -.0312542   -.0204728
                          _cons |  -10.04211          .        .       .            .           .
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |   .0056517   .0028584     1.98   0.048     .0000495     .011254
                      lnspecial |  -.7338315   .0435942   -16.83   0.000    -.8192745   -.6483885
                          _cons |   4.642598   .2282171    20.34   0.000     4.195301    5.089895
--------------------------------+----------------------------------------------------------------
Usigma                          |
                   lngrassratio |  -3.370097   .4227595    -7.97   0.000     -4.19869   -2.541503
                      lnspecial |    3.57323          .        .       .            .           .
                          _cons |  -46.66738          .        .       .            .           .
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                          _cons |  -2.362451   .0284408   -83.07   0.000    -2.418194   -2.306708
--------------------------------+----------------------------------------------------------------
  E(sigma_u) |   3.17e-06                                 2.19e-06    4.15e-06
     sigma_v |   .3069024   .0043643    70.32   0.000     .2984666    .3155765
------------------------------------------------------------------------------

. estimates store `model1name'_CEU_`tech_or_cost'

. di `e(converged)'
1

. STOP!!
unrecognized command:  STOP
r(199);

end of do-file

r(199);

. do msward_2013_11_22_cost.do

. * Based on msward_code_clarity.do
. capture log close
----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.txt
  log type:  text
 opened on:  22 Nov 2013, 15:25:17

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  15:25:17  on 22 Nov 2013

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(cmdlog G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file G:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. 
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vl
> ist') vsigma(TREND)


initial:       Log pseudolikelihood = -42525.399
Iteration 0:   Log pseudolikelihood = -42525.399  
Iteration 1:   Log pseudolikelihood = -38225.927  (backed up)
Iteration 2:   Log pseudolikelihood = -37853.446  (backed up)
Iteration 3:   Log pseudolikelihood = -34550.006  (backed up)
Iteration 4:   Log pseudolikelihood = -34377.569  (backed up)
Iteration 5:   Log pseudolikelihood = -32754.185  (backed up)
Iteration 6:   Log pseudolikelihood = -32685.673  (backed up)
Iteration 7:   Log pseudolikelihood = -32615.071  (backed up)
Iteration 8:   Log pseudolikelihood = -32614.606  (backed up)
Iteration 9:   Log pseudolikelihood = -32614.606  (backed up)
Iteration 10:  Log pseudolikelihood = -29859.015  
Iteration 11:  Log pseudolikelihood = -29235.268  
Iteration 12:  Log pseudolikelihood = -28109.945  
Iteration 13:  Log pseudolikelihood = -26998.997  
Iteration 14:  Log pseudolikelihood = -22653.057  
Iteration 15:  Log pseudolikelihood = -21229.646  
Iteration 16:  Log pseudolikelihood =  -14627.56  
Iteration 17:  Log pseudolikelihood = -14257.204  
Iteration 18:  Log pseudolikelihood =   -10497.3  
Iteration 19:  Log pseudolikelihood = -8389.9952  
Iteration 20:  Log pseudolikelihood = -7043.9257  
Iteration 21:  Log pseudolikelihood = -5849.6539  
Iteration 22:  Log pseudolikelihood = -5051.3558  
Iteration 23:  Log pseudolikelihood = -4678.4082  
Iteration 24:  Log pseudolikelihood = -4587.3678  
Iteration 25:  Log pseudolikelihood = -4523.8259  
Iteration 26:  Log pseudolikelihood = -4411.2822  
Iteration 27:  Log pseudolikelihood = -4351.9103  
Iteration 28:  Log pseudolikelihood = -4326.0409  
Iteration 29:  Log pseudolikelihood = -4231.3755  
Iteration 30:  Log pseudolikelihood = -4059.5883  
Iteration 31:  Log pseudolikelihood = -3928.1843  
Iteration 32:  Log pseudolikelihood = -3846.0975  
Iteration 33:  Log pseudolikelihood = -3778.9773  
Iteration 34:  Log pseudolikelihood = -3741.8128  
Iteration 35:  Log pseudolikelihood = -3731.1887  
Iteration 36:  Log pseudolikelihood = -3726.6659  
Iteration 37:  Log pseudolikelihood =  -3724.581  
Iteration 38:  Log pseudolikelihood =  -3724.065  
Iteration 39:  Log pseudolikelihood = -3723.6663  
Iteration 40:  Log pseudolikelihood =  -3722.654  
Iteration 41:  Log pseudolikelihood = -3719.7449  
Iteration 42:  Log pseudolikelihood = -3717.4039  
Iteration 43:  Log pseudolikelihood = -3712.6526  
Iteration 44:  Log pseudolikelihood = -3710.4785  
Iteration 45:  Log pseudolikelihood = -3710.1396  
Iteration 46:  Log pseudolikelihood = -3710.1261  
Iteration 47:  Log pseudolikelihood =  -3710.126  

Inefficiency effects model (truncated-normal)        Number of obs =     13369
Group variable: pid                               Number of groups =      2966
Time variable: year                             Obs per group: min =         1
                                                               avg =       4.5
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood = -3710.1260                    Wald chi2(5)  =  15741.23

                                                    (Std. Err. adjusted for 2966 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |   1.018425   .0091923   110.79   0.000     1.000408    1.036441
                 lnPTotalCattle |   .1849968   .0476318     3.88   0.000     .0916401    .2783534
lnPCompoundfeedingstuffsforcatt |   .6127854   .0273143    22.43   0.000     .5592503    .6663204
 lnPFERTILISERSANDSOILIMPROVERS |   .1613312   .0463931     3.48   0.001     .0704024    .2522599
                          TREND |   .0007735   .0028821     0.27   0.788    -.0048754    .0064224
                          _cons |  -5.970793   .2269811   -26.31   0.000    -6.415668   -5.525918
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |   4.549041   2.425056     1.88   0.061     -.203982    9.302064
                      lnspecial |  -10.39102          .        .       .            .           .
                          _cons |   10.66122   14.18414     0.75   0.452    -17.13919    38.46162
--------------------------------+----------------------------------------------------------------
Usigma                          |
                          _cons |   1.087618   .3023651     3.60   0.000     .4949937    1.680243
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                          TREND |   .0520202   .0112184     4.64   0.000     .0300326    .0740078
                          _cons |  -2.724706   .0753686   -36.15   0.000    -2.872426   -2.576986
--------------------------------+----------------------------------------------------------------
  E(sigma_v) |   .2925477                                 .2922191    .2928763
     sigma_u |   1.722556   .2604204     6.61   0.000     1.280815    2.316648
------------------------------------------------------------------------------

. estimates store `model1name'_DEU_`tech_or_cost'

. di `e(converged)'
1

. 
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "FRA",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vl
> ist') usigma(`z_vlist') vsigma(TREND)


initial:       Log pseudolikelihood = -18928.767
Iteration 0:   Log pseudolikelihood = -18928.767  
Iteration 1:   Log pseudolikelihood =  -12721.39  (backed up)
Iteration 2:   Log pseudolikelihood = -8933.7001  (backed up)
Iteration 3:   Log pseudolikelihood = -8902.4794  (backed up)
Iteration 4:   Log pseudolikelihood = -7794.5228  (backed up)
Iteration 5:   Log pseudolikelihood = -7736.9277  (backed up)
Iteration 6:   Log pseudolikelihood = -7707.5824  (backed up)
Iteration 7:   Log pseudolikelihood = -7622.0211  (backed up)
Iteration 8:   Log pseudolikelihood = -7608.7781  (backed up)
Iteration 9:   Log pseudolikelihood = -7588.8977  (backed up)
Iteration 10:  Log pseudolikelihood = -7576.1853  (backed up)
Iteration 11:  Log pseudolikelihood = -7575.0364  (backed up)
Iteration 12:  Log pseudolikelihood = -6688.5732  
Iteration 13:  Log pseudolikelihood = -6489.0222  
Iteration 14:  Log pseudolikelihood = -6115.4153  
Iteration 15:  Log pseudolikelihood = -6115.4153  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 16:  Log pseudolikelihood = -6115.4153  (backed up)
Iteration 17:  Log pseudolikelihood = -5850.7425  (backed up)
Iteration 18:  Log pseudolikelihood = -5180.1992  (backed up)
Iteration 19:  Log pseudolikelihood = -5086.5221  (backed up)
Iteration 20:  Log pseudolikelihood = -4546.0913  (backed up)
Iteration 21:  Log pseudolikelihood = -4239.5278  (backed up)
Iteration 22:  Log pseudolikelihood = -4169.1684  (backed up)
Iteration 23:  Log pseudolikelihood = -3949.8727  (backed up)
Iteration 24:  Log pseudolikelihood = -3949.0032  (backed up)
Iteration 25:  Log pseudolikelihood = -3146.5351  
Iteration 26:  Log pseudolikelihood = -2702.8606  
Iteration 27:  Log pseudolikelihood = -2375.1244  
Iteration 28:  Log pseudolikelihood =  -1725.543  
Iteration 29:  Log pseudolikelihood = -1094.3365  
Iteration 30:  Log pseudolikelihood = -941.57428  
Iteration 31:  Log pseudolikelihood = -531.01169  
Iteration 32:  Log pseudolikelihood =  -353.8928  
Iteration 33:  Log pseudolikelihood = -282.52731  
Iteration 34:  Log pseudolikelihood = -214.09089  
Iteration 35:  Log pseudolikelihood = -187.14916  
Iteration 36:  Log pseudolikelihood = -174.58306  
Iteration 37:  Log pseudolikelihood = -171.71825  
Iteration 38:  Log pseudolikelihood = -160.40284  
Iteration 39:  Log pseudolikelihood = -158.28692  
Iteration 40:  Log pseudolikelihood = -150.44095  
Iteration 41:  Log pseudolikelihood = -147.99584  
Iteration 42:  Log pseudolikelihood = -140.47645  
Iteration 43:  Log pseudolikelihood = -132.92674  
Iteration 44:  Log pseudolikelihood =  -127.2179  
Iteration 45:  Log pseudolikelihood = -109.81909  
Iteration 46:  Log pseudolikelihood = -103.50368  
Iteration 47:  Log pseudolikelihood = -102.38547  
Iteration 48:  Log pseudolikelihood = -100.25308  
Iteration 49:  Log pseudolikelihood = -98.243713  
Iteration 50:  Log pseudolikelihood = -95.572164  
Iteration 51:  Log pseudolikelihood = -94.676693  
Iteration 52:  Log pseudolikelihood = -93.729947  
Iteration 53:  Log pseudolikelihood = -92.922891  
Iteration 54:  Log pseudolikelihood = -91.588908  
Iteration 55:  Log pseudolikelihood = -90.467598  
Iteration 56:  Log pseudolikelihood = -89.957819  
Iteration 57:  Log pseudolikelihood = -89.746079  
Iteration 58:  Log pseudolikelihood = -89.673474  
Iteration 59:  Log pseudolikelihood = -89.663152  
Iteration 60:  Log pseudolikelihood = -89.662671  
Iteration 61:  Log pseudolikelihood = -89.662649  
Iteration 62:  Log pseudolikelihood = -89.662648  

Inefficiency effects model (truncated-normal)        Number of obs =      3727
Group variable: pid                               Number of groups =      1629
Time variable: year                             Obs per group: min =         1
                                                               avg =       2.3
                                                               max =         8

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood =   -89.6626                    Wald chi2(5)  =   3811.53

                                                    (Std. Err. adjusted for 1629 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |   1.018245   .0170056    59.88   0.000     .9849143    1.051575
                 lnPTotalCattle |  -.1565048   .1079462    -1.45   0.147    -.3680755    .0550658
lnPCompoundfeedingstuffsforcatt |   1.128881   .1510499     7.47   0.000     .8328285    1.424933
 lnPFERTILISERSANDSOILIMPROVERS |   .8765143    .136035     6.44   0.000     .6098907    1.143138
                          TREND |  -.0557834   .0062078    -8.99   0.000    -.0679504   -.0436164
                          _cons |  -12.68203    .792346   -16.01   0.000      -14.235   -11.12906
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |  -.0431394   .0077414    -5.57   0.000    -.0583122   -.0279666
                      lnspecial |  -.8970746   .0591554   -15.16   0.000    -1.013017   -.7811323
                          _cons |   5.359872   .2834122    18.91   0.000     4.804394     5.91535
--------------------------------+----------------------------------------------------------------
Usigma                          |
                   lngrassratio |   4.325771   .8730738     4.95   0.000     2.614578    6.036964
                      lnspecial |   7.828909   1.606469     4.87   0.000     4.680287    10.97753
                          _cons |    -55.459   9.419981    -5.89   0.000    -73.92183   -36.99618
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                          TREND |    .311708   .0193171    16.14   0.000     .2738473    .3495688
                          _cons |  -3.863947   .1052454   -36.71   0.000    -4.070224    -3.65767
--------------------------------+----------------------------------------------------------------
  E(sigma_u) |   .0423355                                 .0282807    .0563902
  E(sigma_v) |   .3428615                                 .3384413    .3472817
------------------------------------------------------------------------------

. estimates store `model1name'_FRA_`tech_or_cost' 

. di `e(converged)'
1

. 
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "IRE",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vl
> ist') usigma(`z_vlist') 


initial:       Log pseudolikelihood = -18260.666
Iteration 0:   Log pseudolikelihood = -18260.666  
Iteration 1:   Log pseudolikelihood = -13434.349  (backed up)
Iteration 2:   Log pseudolikelihood = -7622.8719  (backed up)
Iteration 3:   Log pseudolikelihood = -7497.4589  (backed up)
Iteration 4:   Log pseudolikelihood = -6425.6533  (backed up)
Iteration 5:   Log pseudolikelihood = -6369.4881  (backed up)
Iteration 6:   Log pseudolikelihood = -6131.8482  (backed up)
Iteration 7:   Log pseudolikelihood = -6075.2981  (backed up)
Iteration 8:   Log pseudolikelihood = -6007.8542  
Iteration 9:   Log pseudolikelihood =  -4783.877  
Iteration 10:  Log pseudolikelihood = -4081.0749  
Iteration 11:  Log pseudolikelihood = -3759.2684  
Iteration 12:  Log pseudolikelihood = -3651.3242  
Iteration 13:  Log pseudolikelihood = -3651.3242  (backed up)
Iteration 14:  Log pseudolikelihood = -3641.0347  
Iteration 15:  Log pseudolikelihood = -3533.5117  
Iteration 16:  Log pseudolikelihood = -3391.3291  
Iteration 17:  Log pseudolikelihood = -3163.0996  
Iteration 18:  Log pseudolikelihood = -3036.9014  
Iteration 19:  Log pseudolikelihood = -2943.5348  
Iteration 20:  Log pseudolikelihood = -2396.5157  
Iteration 21:  Log pseudolikelihood = -2229.2182  
Iteration 22:  Log pseudolikelihood = -1796.7738  
Iteration 23:  Log pseudolikelihood = -1428.8869  
Iteration 24:  Log pseudolikelihood = -935.18086  
Iteration 25:  Log pseudolikelihood = -477.09202  
Iteration 26:  Log pseudolikelihood = -282.65771  
Iteration 27:  Log pseudolikelihood =  23.549829  
Iteration 28:  Log pseudolikelihood =  121.74684  
Iteration 29:  Log pseudolikelihood =  212.66839  
Iteration 30:  Log pseudolikelihood =   267.9872  
Iteration 31:  Log pseudolikelihood =  293.85277  
Iteration 32:  Log pseudolikelihood =  309.58281  
Iteration 33:  Log pseudolikelihood =  314.77481  
Iteration 34:  Log pseudolikelihood =  320.11677  
Iteration 35:  Log pseudolikelihood =  327.22821  
Iteration 36:  Log pseudolikelihood =  331.05563  
Iteration 37:  Log pseudolikelihood =  335.00247  
Iteration 38:  Log pseudolikelihood =   336.5606  
Iteration 39:  Log pseudolikelihood =  337.52135  
Iteration 40:  Log pseudolikelihood =  337.91694  
Iteration 41:  Log pseudolikelihood =  338.47052  
Iteration 42:  Log pseudolikelihood =  338.98321  
Iteration 43:  Log pseudolikelihood =  341.34784  
Iteration 44:  Log pseudolikelihood =  342.10785  
Iteration 45:  Log pseudolikelihood =   342.4216  
Iteration 46:  Log pseudolikelihood =  343.16424  
Iteration 47:  Log pseudolikelihood =  343.22501  
Iteration 48:  Log pseudolikelihood =  343.23451  
Iteration 49:  Log pseudolikelihood =   343.2353  
Iteration 50:  Log pseudolikelihood =  343.23533  

Inefficiency effects model (truncated-normal)        Number of obs =      3549
Group variable: pid                               Number of groups =       724
Time variable: year                             Obs per group: min =         1
                                                               avg =       4.9
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood =   343.2353                    Wald chi2(5)  =   7402.14

                                                     (Std. Err. adjusted for 724 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |    .984384   .0121129    81.27   0.000      .960643    1.008125
                 lnPTotalCattle |   .2705533   .0724399     3.73   0.000     .1285738    .4125328
lnPCompoundfeedingstuffsforcatt |   1.019733    .090773    11.23   0.000     .8418212    1.197645
 lnPFERTILISERSANDSOILIMPROVERS |   .3441195   .0810692     4.24   0.000     .1852269    .5030122
                          TREND |   -.044969   .0050669    -8.88   0.000    -.0548999   -.0350382
                          _cons |   -16.3578   .5192922   -31.50   0.000     -17.3756   -15.34001
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |  -.0998233   .0137938    -7.24   0.000    -.1268586   -.0727879
                      lnspecial |  -1.019213   .0501654   -20.32   0.000    -1.117536   -.9208911
                          _cons |   13.07795          .        .       .            .           .
--------------------------------+----------------------------------------------------------------
Usigma                          |
                   lngrassratio |  -1.397906   .3153606    -4.43   0.000    -2.016002   -.7798106
                      lnspecial |   2.757505   .9449816     2.92   0.004     .9053754    4.609635
                          _cons |  -13.09381   4.434923    -2.95   0.003     -21.7861   -4.401524
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                          _cons |  -3.179744   .0846214   -37.58   0.000    -3.345599   -3.013889
--------------------------------+----------------------------------------------------------------
  E(sigma_u) |   .0779142                                 .0754564    .0803719
     sigma_v |   .2039517   .0086293    23.63   0.000     .1877208     .221586
------------------------------------------------------------------------------

. estimates store `model1name'_IRE_`tech_or_cost'

. di `e(converged)'
1

. 
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "UKI",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vl
> ist') usigma(`z_vlist')


initial:       Log pseudolikelihood = -23991.175
Iteration 0:   Log pseudolikelihood = -23991.175  
Iteration 1:   Log pseudolikelihood = -18498.644  (backed up)
Iteration 2:   Log pseudolikelihood = -17830.249  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   Log pseudolikelihood = -10799.095  (backed up)
Iteration 4:   Log pseudolikelihood = -10761.213  (backed up)
Iteration 5:   Log pseudolikelihood = -9732.3019  (backed up)
Iteration 6:   Log pseudolikelihood = -8596.8721  (backed up)
Iteration 7:   Log pseudolikelihood = -8589.0818  (backed up)
Iteration 8:   Log pseudolikelihood = -8084.8637  
Iteration 9:   Log pseudolikelihood = -7634.0649  (backed up)
Iteration 10:  Log pseudolikelihood = -6958.8726  
Iteration 11:  Log pseudolikelihood = -6934.3472  
Iteration 12:  Log pseudolikelihood =  -6222.521  
Iteration 13:  Log pseudolikelihood = -6078.4533  
Iteration 14:  Log pseudolikelihood = -5559.6406  
Iteration 15:  Log pseudolikelihood = -4991.2346  
Iteration 16:  Log pseudolikelihood = -3772.6173  
Iteration 17:  Log pseudolikelihood = -3665.0266  
Iteration 18:  Log pseudolikelihood = -3068.8555  
Iteration 19:  Log pseudolikelihood = -2914.2336  
Iteration 20:  Log pseudolikelihood = -2896.6358  
Iteration 21:  Log pseudolikelihood = -2896.6358  (backed up)
Iteration 22:  Log pseudolikelihood = -2896.3037  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 23:  Log pseudolikelihood = -2896.3037  (backed up)
Iteration 24:  Log pseudolikelihood = -2877.2468  (backed up)
Iteration 25:  Log pseudolikelihood =  -1844.637  (backed up)
Iteration 26:  Log pseudolikelihood = -672.95596  (backed up)
Iteration 27:  Log pseudolikelihood = -562.67172  (backed up)
Iteration 28:  Log pseudolikelihood = -559.29497  (backed up)
Iteration 29:  Log pseudolikelihood = -554.22045  (backed up)
Iteration 30:  Log pseudolikelihood = -376.81103  
Iteration 31:  Log pseudolikelihood = -332.34637  
Iteration 32:  Log pseudolikelihood = -328.32745  
Iteration 33:  Log pseudolikelihood = -319.51643  
Iteration 34:  Log pseudolikelihood = -317.80602  
Iteration 35:  Log pseudolikelihood = -294.70582  
Iteration 36:  Log pseudolikelihood = -289.38312  
Iteration 37:  Log pseudolikelihood = -281.79031  
Iteration 38:  Log pseudolikelihood = -276.11472  
Iteration 39:  Log pseudolikelihood = -275.14164  
Iteration 40:  Log pseudolikelihood = -272.47089  
Iteration 41:  Log pseudolikelihood = -269.46304  
Iteration 42:  Log pseudolikelihood = -267.36649  
Iteration 43:  Log pseudolikelihood =  -266.9446  
Iteration 44:  Log pseudolikelihood = -266.29822  
Iteration 45:  Log pseudolikelihood = -265.94323  
Iteration 46:  Log pseudolikelihood = -265.46469  
Iteration 47:  Log pseudolikelihood = -265.31097  
Iteration 48:  Log pseudolikelihood = -265.25399  
Iteration 49:  Log pseudolikelihood = -265.24387  
Iteration 50:  Log pseudolikelihood = -265.24308  
Iteration 51:  Log pseudolikelihood =  -265.2429  
Iteration 52:  Log pseudolikelihood =  -265.2429  

Inefficiency effects model (truncated-normal)        Number of obs =      4961
Group variable: pid                               Number of groups =      1682
Time variable: year                             Obs per group: min =         1
                                                               avg =       2.9
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood =  -265.2429                    Wald chi2(5)  =   9769.85

                                                    (Std. Err. adjusted for 1682 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |    .991189    .011176    88.69   0.000     .9692844    1.013094
                 lnPTotalCattle |   .2824773   .0811232     3.48   0.000     .1234788    .4414758
lnPCompoundfeedingstuffsforcatt |   .9705705   .1065852     9.11   0.000     .7616674    1.179474
 lnPFERTILISERSANDSOILIMPROVERS |   .6137901   .0966777     6.35   0.000     .4243052    .8032751
                          TREND |  -.0504789   .0067898    -7.43   0.000    -.0637867   -.0371711
                          _cons |   -21.3268   .4541212   -46.96   0.000    -22.21687   -20.43674
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |   .0172176   .0055437     3.11   0.002     .0063522     .028083
                      lnspecial |  -.8387546   .0721304   -11.63   0.000    -.9801276   -.6973816
                          _cons |   15.98282   .2922928    54.68   0.000     15.40993     16.5557
--------------------------------+----------------------------------------------------------------
Usigma                          |
                   lngrassratio |   2.198627   .4834996     4.55   0.000     1.250985    3.146269
                      lnspecial |  -2.296248   1.369504    -1.68   0.094    -4.980426    .3879308
                          _cons |  -1.756786   5.769211    -0.30   0.761    -13.06423     9.55066
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                          _cons |  -2.800038   .0669579   -41.82   0.000    -2.931273   -2.668803
--------------------------------+----------------------------------------------------------------
  E(sigma_u) |   .0514477                                 .0498037    .0530917
     sigma_v |   .2465923   .0082557    29.87   0.000     .2309309    .2633157
------------------------------------------------------------------------------

. estimates store `model1name'_UKI_`tech_or_cost'

. di `e(converged)'
1

. 
. sfpanel `dep_vlist' `indep_vlist' TREND if atl_plains == 1, `cost'  model(bc95) d(tnormal) posthessian robust emean(`z_vli
> st') usigma(`z_vlist') vsigma(TREND)


initial:       Log pseudolikelihood = -36775.006
Iteration 0:   Log pseudolikelihood = -36775.006  
Iteration 1:   Log pseudolikelihood = -21749.985  (backed up)
Iteration 2:   Log pseudolikelihood = -17760.886  (backed up)
Iteration 3:   Log pseudolikelihood = -17667.024  (backed up)
Iteration 4:   Log pseudolikelihood = -16898.296  (backed up)
Iteration 5:   Log pseudolikelihood = -16855.231  (backed up)
Iteration 6:   Log pseudolikelihood = -16850.746  (backed up)
Iteration 7:   Log pseudolikelihood = -16782.295  (backed up)
Iteration 8:   Log pseudolikelihood = -16712.316  (backed up)
Iteration 9:   Log pseudolikelihood = -14006.933  
Iteration 10:  Log pseudolikelihood = -13324.618  (backed up)
Iteration 11:  Log pseudolikelihood = -13037.116  
Iteration 12:  Log pseudolikelihood = -12614.586  
Iteration 13:  Log pseudolikelihood = -10636.025  
Iteration 14:  Log pseudolikelihood =  -10499.33  
Iteration 15:  Log pseudolikelihood = -10484.827  (backed up)
Iteration 16:  Log pseudolikelihood = -10479.463  (backed up)
Iteration 17:  Log pseudolikelihood = -10478.288  (backed up)
Iteration 18:  Log pseudolikelihood = -10477.198  (backed up)
Iteration 19:  Log pseudolikelihood = -10476.865  (backed up)
Iteration 20:  Log pseudolikelihood = -10476.836  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 21:  Log pseudolikelihood = -10476.818  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 22:  Log pseudolikelihood = -10476.817  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 23:  Log pseudolikelihood = -10476.816  (backed up)
Iteration 24:  Log pseudolikelihood = -9689.2404  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 25:  Log pseudolikelihood = -9689.2404  (backed up)
Iteration 26:  Log pseudolikelihood = -9681.8095  (backed up)
Iteration 27:  Log pseudolikelihood = -8997.4291  (backed up)
Iteration 28:  Log pseudolikelihood = -8987.9554  (backed up)
Iteration 29:  Log pseudolikelihood = -5611.9985  (backed up)
Iteration 30:  Log pseudolikelihood = -5559.8236  (backed up)
Iteration 31:  Log pseudolikelihood = -5456.8612  (backed up)
Iteration 32:  Log pseudolikelihood = -5400.5525  (backed up)
Iteration 33:  Log pseudolikelihood = -4836.4922  (backed up)
Iteration 34:  Log pseudolikelihood = -3992.5228  (backed up)
Iteration 35:  Log pseudolikelihood = -3398.5248  (backed up)
Iteration 36:  Log pseudolikelihood = -3068.4181  
Iteration 37:  Log pseudolikelihood = -1393.0333  
Iteration 38:  Log pseudolikelihood = -841.36674  
Iteration 39:  Log pseudolikelihood = -835.87971  
Iteration 40:  Log pseudolikelihood =  1535.1438  
Iteration 41:  Log pseudolikelihood =  2069.6049  
Iteration 42:  Log pseudolikelihood =  2122.7941  
Iteration 43:  Log pseudolikelihood =  2191.5103  
Iteration 44:  Log pseudolikelihood =  2214.4473  
Iteration 45:  Log pseudolikelihood =  2219.0204  
Iteration 46:  Log pseudolikelihood =  2228.8579  
Iteration 47:  Log pseudolikelihood =  2230.4878  
Iteration 48:  Log pseudolikelihood =  2230.6232  
Iteration 49:  Log pseudolikelihood =  2231.2891  
Iteration 50:  Log pseudolikelihood =  2231.3064  
Iteration 51:  Log pseudolikelihood =  2231.6673  
Iteration 52:  Log pseudolikelihood =  2231.7612  
Iteration 53:  Log pseudolikelihood =  2231.7666  
Iteration 54:  Log pseudolikelihood =   2231.767  
Iteration 55:  Log pseudolikelihood =   2231.767  

Inefficiency effects model (truncated-normal)        Number of obs =      7353
Group variable: pid                               Number of groups =      1909
Time variable: year                             Obs per group: min =         1
                                                               avg =       3.9
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood =  2231.7670                    Wald chi2(5)  =  11562.39

                                                    (Std. Err. adjusted for 1909 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |   .9812546   .0093214   105.27   0.000     .9629851    .9995241
                 lnPTotalCattle |  -.0697699   .0696829    -1.00   0.317    -.2063459    .0668062
lnPCompoundfeedingstuffsforcatt |   .7743301   .1673987     4.63   0.000     .4462347    1.102426
 lnPFERTILISERSANDSOILIMPROVERS |   .5226542   .0828377     6.31   0.000     .3602953    .6850131
                          TREND |  -.0497909    .004245   -11.73   0.000     -.058111   -.0414708
                          _cons |  -21.36733          .        .       .            .           .
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |  -.0518436   .0074689    -6.94   0.000    -.0664823    -.037205
                      lnspecial |  -.9833663   .0610059   -16.12   0.000    -1.102936   -.8637969
                          _cons |   18.16485   .6355415    28.58   0.000     16.91922    19.41049
--------------------------------+----------------------------------------------------------------
Usigma                          |
                   lngrassratio |   .3987186          .        .       .            .           .
                      lnspecial |  -4.506775          .        .       .            .           .
                          _cons |   -3.22521          .        .       .            .           .
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                          TREND |   .5616244   .0224623    25.00   0.000     .5175992    .6056497
                          _cons |  -4.713819   .0776168   -60.73   0.000    -4.865945   -4.561693
--------------------------------+----------------------------------------------------------------
  E(sigma_u) |   .0000213                                 .0000204    .0000223
  E(sigma_v) |   .4786841                                 .4710621    .4863061
------------------------------------------------------------------------------

. estimates store `model1name'_ATL_`tech_or_cost'

. di `e(converged)'
1

. 
. sfpanel `dep_vlist' `indep_vlist' TREND if cont_eur == 1,   `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlis
> t') usigma(`z_vlist') 


initial:       Log pseudolikelihood = -90455.043
Iteration 0:   Log pseudolikelihood = -90455.043  
Iteration 1:   Log pseudolikelihood = -71969.594  (backed up)
Iteration 2:   Log pseudolikelihood = -32683.044  (backed up)
Iteration 3:   Log pseudolikelihood = -32174.778  (backed up)
Iteration 4:   Log pseudolikelihood = -29688.461  (backed up)
Iteration 5:   Log pseudolikelihood = -25886.042  (backed up)
Iteration 6:   Log pseudolikelihood = -23735.322  (backed up)
Iteration 7:   Log pseudolikelihood = -23460.213  (backed up)
Iteration 8:   Log pseudolikelihood = -23220.117  (backed up)
Iteration 9:   Log pseudolikelihood = -22559.193  
Iteration 10:  Log pseudolikelihood = -22084.658  (backed up)
Iteration 11:  Log pseudolikelihood = -21813.349  (backed up)
Iteration 12:  Log pseudolikelihood = -20786.736  (backed up)
Iteration 13:  Log pseudolikelihood = -19678.681  (backed up)
Iteration 14:  Log pseudolikelihood = -11767.171  
Iteration 15:  Log pseudolikelihood = -9500.0284  
Iteration 16:  Log pseudolikelihood = -8303.9423  
Iteration 17:  Log pseudolikelihood = -6464.7928  
Iteration 18:  Log pseudolikelihood =  -4592.424  
Iteration 19:  Log pseudolikelihood = -4519.9198  
Iteration 20:  Log pseudolikelihood = -4420.3917  
Iteration 21:  Log pseudolikelihood = -4388.6361  
Iteration 22:  Log pseudolikelihood = -4382.4111  
Iteration 23:  Log pseudolikelihood = -4379.1789  
Iteration 24:  Log pseudolikelihood = -4378.7913  (backed up)
Iteration 25:  Log pseudolikelihood = -4378.7858  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 26:  Log pseudolikelihood = -4378.7831  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 27:  Log pseudolikelihood = -4378.7831  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 28:  Log pseudolikelihood = -4378.7831  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 29:  Log pseudolikelihood = -4378.7831  (backed up)
Iteration 30:  Log pseudolikelihood = -4374.9749  
Iteration 31:  Log pseudolikelihood = -4369.8123  
Iteration 32:  Log pseudolikelihood = -4365.4066  
Iteration 33:  Log pseudolikelihood = -4364.6697  
Iteration 34:  Log pseudolikelihood = -4364.4387  (backed up)
Iteration 35:  Log pseudolikelihood = -4364.3803  (backed up)
Iteration 36:  Log pseudolikelihood = -4364.3509  (backed up)
Iteration 37:  Log pseudolikelihood = -4364.3435  (backed up)
Iteration 38:  Log pseudolikelihood = -4364.3398  (backed up)
Iteration 39:  Log pseudolikelihood = -4364.3389  (backed up)
Iteration 40:  Log pseudolikelihood = -4364.3384  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 41:  Log pseudolikelihood = -4364.3382  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 42:  Log pseudolikelihood = -4364.3381  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 43:  Log pseudolikelihood = -4364.3381  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 44:  Log pseudolikelihood = -4364.3381  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 45:  Log pseudolikelihood = -4364.3381  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 46:  Log pseudolikelihood = -4364.2859  (backed up)
Iteration 47:  Log pseudolikelihood = -4356.5881  
Iteration 48:  Log pseudolikelihood = -4347.2214  
Iteration 49:  Log pseudolikelihood =  -4340.568  
Iteration 50:  Log pseudolikelihood = -4339.0931  
Iteration 51:  Log pseudolikelihood = -4338.9942  
Iteration 52:  Log pseudolikelihood = -4338.9849  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 53:  Log pseudolikelihood =  -4338.973  
Iteration 54:  Log pseudolikelihood = -4338.9728  (backed up)
Iteration 55:  Log pseudolikelihood = -4338.9728  (backed up)
Iteration 56:  Log pseudolikelihood = -4338.9726  (backed up)
Iteration 57:  Log pseudolikelihood = -4338.9721  (backed up)
Iteration 58:  Log pseudolikelihood = -4338.9708  (backed up)
Iteration 59:  Log pseudolikelihood = -4338.9706  (backed up)
Iteration 60:  Log pseudolikelihood = -4338.9693  (backed up)
Iteration 61:  Log pseudolikelihood = -4338.9693  (backed up)
Iteration 62:  Log pseudolikelihood = -4338.9691  
Iteration 63:  Log pseudolikelihood = -4338.9655  
Iteration 64:  Log pseudolikelihood = -4338.9631  
Iteration 65:  Log pseudolikelihood = -4338.9623  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 66:  Log pseudolikelihood = -4338.9621  
Iteration 67:  Log pseudolikelihood = -4338.9621  (backed up)
Iteration 68:  Log pseudolikelihood = -4338.9621  (backed up)
Iteration 69:  Log pseudolikelihood = -4338.9621  (backed up)
Iteration 70:  Log pseudolikelihood = -4338.9621  (backed up)
Iteration 71:  Log pseudolikelihood = -4338.9621  (backed up)
Iteration 72:  Log pseudolikelihood = -4338.9621  (backed up)
Iteration 73:  Log pseudolikelihood = -4338.9621  (backed up)
Iteration 74:  Log pseudolikelihood = -4338.9621  (backed up)
Iteration 75:  Log pseudolikelihood = -4338.9621  (backed up)

Inefficiency effects model (truncated-normal)        Number of obs =     18253
Group variable: pid                               Number of groups =      5092
Time variable: year                             Obs per group: min =         1
                                                               avg =       3.6
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood = -4338.9621                    Wald chi2(5)  =  27255.70

                                                    (Std. Err. adjusted for 5092 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |   1.033251   .0072089   143.33   0.000     1.019122     1.04738
                 lnPTotalCattle |   .0126241   .0459243     0.27   0.783    -.0773858     .102634
lnPCompoundfeedingstuffsforcatt |   .6499794   .0316044    20.57   0.000     .5880358    .7119229
 lnPFERTILISERSANDSOILIMPROVERS |   .7032475   .0536898    13.10   0.000     .5980174    .8084776
                          TREND |  -.0258635   .0027504    -9.40   0.000    -.0312542   -.0204728
                          _cons |  -10.04211          .        .       .            .           .
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |   .0056517   .0028584     1.98   0.048     .0000495     .011254
                      lnspecial |  -.7338315   .0435942   -16.83   0.000    -.8192745   -.6483885
                          _cons |   4.642598   .2282171    20.34   0.000     4.195301    5.089895
--------------------------------+----------------------------------------------------------------
Usigma                          |
                   lngrassratio |  -3.370097   .4227595    -7.97   0.000     -4.19869   -2.541503
                      lnspecial |    3.57323          .        .       .            .           .
                          _cons |  -46.66738          .        .       .            .           .
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                          _cons |  -2.362451   .0284408   -83.07   0.000    -2.418194   -2.306708
--------------------------------+----------------------------------------------------------------
  E(sigma_u) |   3.17e-06                                 2.19e-06    4.15e-06
     sigma_v |   .3069024   .0043643    70.32   0.000     .2984666    .3155765
------------------------------------------------------------------------------

. estimates store `model1name'_CEU_`tech_or_cost'

. di `e(converged)'
1

. 
. * BEST RESULT Effect on Mu parameter = -0.0054 Sigma U Parameter = 2.308268 need to figure out partial effect for this. No
> n-monotonic effect of grass. HARD CODE for reference. 
. *sfpanel lntotalspecificcosts lndairyproducts lnPTotalCattle lnPCompoundfeedingstuffsforcatt lnPFERTILISERSANDSOILIMPROVER
> S TREND , cost model(bc95) d(tnormal) posthessian robust emean(lngrassratio lnspecial) usigma(lngrassratio lnspecial) vsig
> ma(TREND)
. 
. sfpanel `dep_vlist' `indep_vlist' TREND , `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usigma(`z_vlis
> t') vsigma(TREND)


initial:       Log pseudolikelihood = -127529.32
Iteration 0:   Log pseudolikelihood = -127529.32  
Iteration 1:   Log pseudolikelihood = -68827.285  (backed up)
Iteration 2:   Log pseudolikelihood =  -57578.35  (backed up)
Iteration 3:   Log pseudolikelihood = -57061.161  (backed up)
Iteration 4:   Log pseudolikelihood = -54587.567  (backed up)
Iteration 5:   Log pseudolikelihood = -53533.717  (backed up)
Iteration 6:   Log pseudolikelihood = -53489.536  (backed up)
Iteration 7:   Log pseudolikelihood = -53386.514  (backed up)
Iteration 8:   Log pseudolikelihood = -53337.871  (backed up)
Iteration 9:   Log pseudolikelihood = -53285.283  (backed up)
Iteration 10:  Log pseudolikelihood = -45218.979  (backed up)
Iteration 11:  Log pseudolikelihood = -37513.474  (backed up)
Iteration 12:  Log pseudolikelihood = -33623.351  (backed up)
Iteration 13:  Log pseudolikelihood = -32881.116  (backed up)
Iteration 14:  Log pseudolikelihood = -32675.992  (backed up)
Iteration 15:  Log pseudolikelihood =     -29200  
Iteration 16:  Log pseudolikelihood = -26613.967  
Iteration 17:  Log pseudolikelihood = -22386.728  
Iteration 18:  Log pseudolikelihood = -21594.561  
Iteration 19:  Log pseudolikelihood = -21543.621  (backed up)
Iteration 20:  Log pseudolikelihood = -16691.559  
Iteration 21:  Log pseudolikelihood = -12445.742  
Iteration 22:  Log pseudolikelihood = -10694.325  
Iteration 23:  Log pseudolikelihood = -7980.9527  
Iteration 24:  Log pseudolikelihood = -7389.3241  
Iteration 25:  Log pseudolikelihood = -7235.5898  (backed up)
Iteration 26:  Log pseudolikelihood = -7214.0094  (backed up)
Iteration 27:  Log pseudolikelihood = -7212.1436  (backed up)
Iteration 28:  Log pseudolikelihood = -7210.7612  (backed up)
Iteration 29:  Log pseudolikelihood = -7210.3092  (backed up)
Iteration 30:  Log pseudolikelihood = -7210.0336  (backed up)
Iteration 31:  Log pseudolikelihood = -7209.9542  (backed up)
Iteration 32:  Log pseudolikelihood = -7209.9337  (backed up)
Iteration 33:  Log pseudolikelihood = -7209.9286  (backed up)
Iteration 34:  Log pseudolikelihood = -7209.9273  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 35:  Log pseudolikelihood = -7209.9266  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 36:  Log pseudolikelihood =  -7209.926  (backed up)
Iteration 37:  Log pseudolikelihood =  1078.2714  (backed up)
Iteration 38:  Log pseudolikelihood =   2452.594  
Iteration 39:  Log pseudolikelihood =  2736.0902  
Iteration 40:  Log pseudolikelihood =   3343.182  
Iteration 41:  Log pseudolikelihood =  3370.1725  
Iteration 42:  Log pseudolikelihood =  3430.7253  
Iteration 43:  Log pseudolikelihood =  3551.2754  
Iteration 44:  Log pseudolikelihood =  3576.5788  
Iteration 45:  Log pseudolikelihood =  3635.0632  
Iteration 46:  Log pseudolikelihood =  3657.1783  
Iteration 47:  Log pseudolikelihood =  3661.1198  
Iteration 48:  Log pseudolikelihood =   3667.269  
Iteration 49:  Log pseudolikelihood =  3698.4809  
Iteration 50:  Log pseudolikelihood =   3699.815  
Iteration 51:  Log pseudolikelihood =  3715.0157  
Iteration 52:  Log pseudolikelihood =  3721.2098  
Iteration 53:  Log pseudolikelihood =   3725.237  
Iteration 54:  Log pseudolikelihood =  3726.9294  
Iteration 55:  Log pseudolikelihood =  3727.9182  
Iteration 56:  Log pseudolikelihood =  3728.0949  
Iteration 57:  Log pseudolikelihood =  3728.2414  
Iteration 58:  Log pseudolikelihood =  3729.3149  
Iteration 59:  Log pseudolikelihood =   3731.267  
Iteration 60:  Log pseudolikelihood =   3731.384  
Iteration 61:  Log pseudolikelihood =  3731.3864  
Iteration 62:  Log pseudolikelihood =  3731.4406  
Iteration 63:  Log pseudolikelihood =  3731.8534  
Iteration 64:  Log pseudolikelihood =  3732.0719  
Iteration 65:  Log pseudolikelihood =  3732.1219  
Iteration 66:  Log pseudolikelihood =  3732.1345  
Iteration 67:  Log pseudolikelihood =  3732.1356  
Iteration 68:  Log pseudolikelihood =  3732.1356  

Inefficiency effects model (truncated-normal)        Number of obs =     25606
Group variable: pid                               Number of groups =      7001
Time variable: year                             Obs per group: min =         1
                                                               avg =       3.7
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood =  3732.1356                    Wald chi2(5)  =  31056.66

                                                    (Std. Err. adjusted for 7001 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |   1.021172   .0058682   174.02   0.000      1.00967    1.032674
                 lnPTotalCattle |   .0908232   .0384272     2.36   0.018     .0155072    .1661392
lnPCompoundfeedingstuffsforcatt |   .8211557   .0782973    10.49   0.000     .6676959    .9746156
 lnPFERTILISERSANDSOILIMPROVERS |   .3718991   .0495539     7.50   0.000     .2747753    .4690229
                          TREND |  -.0256454   .0023293   -11.01   0.000    -.0302108     -.02108
                          _cons |  -9.368743   1.519443    -6.17   0.000     -12.3468   -6.390689
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |  -.0054131   .0028567    -1.89   0.058    -.0110122     .000186
                      lnspecial |   -.854449   .0457637   -18.67   0.000    -.9441441   -.7647538
                          _cons |   5.425669   1.488719     3.64   0.000     2.507834    8.343504
--------------------------------+----------------------------------------------------------------
Usigma                          |
                   lngrassratio |   2.308268   .4753376     4.86   0.000     1.376623    3.239912
                      lnspecial |   13.88524   2.056493     6.75   0.000     9.854583    17.91589
                          _cons |  -75.53368   8.781422    -8.60   0.000    -92.74495   -58.32241
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                          TREND |   .5547151   .0123843    44.79   0.000     .5304423    .5789879
                          _cons |  -4.538382    .051596   -87.96   0.000    -4.639508   -4.437256
--------------------------------+----------------------------------------------------------------
  E(sigma_u) |   197.6849                                -186.7471     582.117
  E(sigma_v) |   .5214682                                 .5171171    .5258193
------------------------------------------------------------------------------

. estimates store `model1name'_ALL_`tech_or_cost'

. di `e(converged)'
1

. 
. STOP!!
unrecognized command:  STOP
r(199);

end of do-file

r(199);

. dir logs
  <dir>  11/22/13 12:04  logs              

. dir logs/
  <dir>  11/22/13 12:04  .                 
  <dir>  11/22/13 15:49  ..                
   0.1k   6/29/13 17:45  .dta2013_06_29.cmd.txt
  18.0k   6/29/13 17:45  .dta2013_06_29.txt
   0.0k   6/30/13 13:27  .dta2013_06_30.cmd.txt
   6.5k   6/30/13 13:43  .dta2013_06_30.txt
   0.0k   6/27/13 22:19  .txt              
  14.4k   6/28/13 13:14  msward_2013_06_27.txt
   0.0k   6/29/13 17:45  multisward.dta2013_06_29.cmd.txt
  23.1k   6/29/13 18:02  multisward.dta2013_06_29.txt
   0.0k   6/30/13 12:14  multisward.dta2013_06_30.cmd.txt
   6.7k   6/30/13 12:15  multisward.dta2013_06_30.txt
   0.0k   6/28/13 14:13  multisward2013_06_28.cmd.txt
  17.0k   6/28/13 14:14  multisward2013_06_28.txt
   0.0k   6/30/13 15:31  multisward2013_06_30.cmd.txt
   6.8k   6/30/13 15:46  multisward2013_06_30.txt
   0.0k   7/26/13 17:50  multisward2013_07_26.cmd.txt
   1.3k   7/26/13 17:50  multisward2013_07_26.txt
   0.0k   8/01/13 18:55  multisward2013_08_01.cmd.txt
  15.8k   8/01/13 18:56  multisward2013_08_01.txt
   0.1k   8/02/13 18:25  multisward2013_08_02.cmd.txt
  18.7k   8/02/13 18:25  multisward2013_08_02.txt
  21.7k   8/08/13 18:34  multisward2013_08_08.txt
   0.0k   8/09/13 17:00  multisward2013_08_09.cmd.txt
  18.1k   8/09/13 17:00  multisward2013_08_09.txt
   0.2k   8/10/13 12:44  multisward2013_08_10.cmd.txt
   8.7k   8/10/13 12:44  multisward2013_08_10.txt
   0.0k   8/12/13 16:33  multisward2013_08_12.cmd.txt
  16.2k   8/12/13 16:33  multisward2013_08_12.txt
   0.0k   8/13/13 13:03  multisward2013_08_13.cmd.txt
  28.9k   8/13/13 13:08  multisward2013_08_13.txt
   0.3k   8/16/13 19:52  multisward2013_08_16.cmd.txt
  14.4k   8/16/13 19:52  multisward2013_08_16.txt
   0.3k   8/21/13 16:37  multisward2013_08_21.cmd.txt
  14.1k   8/21/13 16:37  multisward2013_08_21.txt
   0.0k   8/22/13 16:44  multisward2013_08_22.cmd.txt
  13.3k   8/22/13 16:44  multisward2013_08_22.txt
   0.0k   6/28/13 21:03  multisward.dta2013_06_28.cmd.txt
  20.4k   8/23/13 18:42  multisward2013_08_23.txt
   0.0k   8/26/13 16:52  multisward2013_08_26.cmd.txt
  12.9k   8/26/13 16:52  multisward2013_08_26.txt
   0.3k   8/29/13 10:52  multisward2013_08_29.cmd.txt
  14.6k   8/29/13 10:52  multisward2013_08_29.txt
   0.0k   8/30/13 14:15  multisward2013_08_30.cmd.txt
  11.1k   8/30/13 14:15  multisward2013_08_30.txt
   0.0k   9/06/13 14:55  multisward2013_09_06.cmd.txt
  11.0k   9/06/13 14:55  multisward2013_09_06.txt
   0.1k   9/10/13 23:05  multisward2013_09_10.cmd.txt
  12.0k   9/10/13 23:05  multisward2013_09_10.txt
   0.0k   9/11/13  5:50  multisward2013_09_11.cmd.txt
   1.4k   9/11/13  5:50  multisward2013_09_11.txt
   0.0k   9/12/13 23:00  multisward2013_09_12.cmd.txt
  32.7k   9/12/13 23:00  multisward2013_09_12.txt
  25.9k   9/13/13  0:17  multisward2013_09_13.txt
   4.4k   9/17/13 21:17  multisward2013_09_17.cmd.txt
 142.0k   9/17/13 21:17  multisward2013_09_17.txt
   0.7k   9/18/13 19:11  multisward2013_09_18.cmd.txt
  51.7k   9/18/13 19:11  multisward2013_09_18.txt
   1.0k   9/23/13 11:37  multisward2013_09_23.cmd.txt
  11.7k   9/23/13 11:37  multisward2013_09_23.txt
   0.5k  10/30/13 20:25  multisward2013_10_30.cmd.txt
  16.9k  10/30/13 20:25  multisward2013_10_30.txt
   0.2k  11/01/13  9:17  multisward2013_10_31.cmd.txt
  12.5k  11/01/13  9:17  multisward2013_10_31.txt
   0.0k  11/01/13  9:43  multisward2013_11_01.cmd.txt
  13.1k  11/01/13  9:45  multisward2013_11_01.txt
   0.6k  11/04/13 12:01  multisward2013_11_04.cmd.txt
  27.4k  11/04/13 12:01  multisward2013_11_04.txt
  26.8k  11/07/13 14:44  multisward2013_11_07.txt
   0.1k  11/16/13 17:35  multisward2013_11_16.cmd.txt
   6.7k  11/16/13 17:35  multisward2013_11_16.txt
   0.0k  11/19/13 16:48  multisward2013_11_18.cmd.txt
  55.2k  11/19/13 16:48  multisward2013_11_18.txt
   0.0k  11/19/13 21:37  multisward2013_11_19.cmd.txt
  72.7k  11/19/13 21:37  multisward2013_11_19.txt
   0.0k  11/21/13 10:26  multisward2013_11_20.cmd.txt
   3.4k  11/21/13 10:26  multisward2013_11_20.txt
   0.0k  11/21/13 14:55  multisward2013_11_21.cmd.txt
   9.0k  11/21/13 14:54  multisward2013_11_21.txt
   3.3k  11/22/13 15:55  multisward2013_11_22.cmd.txt
 230.4k  11/22/13 15:55  multisward2013_11_22.txt
  <dir>   2/20/13 16:08  results           
  18.7k   6/28/13 21:04  multisward.dta2013_06_28.txt
   0.0k   8/08/13 18:34  multisward2013_08_08.cmd.txt
   0.3k   8/23/13 18:42  multisward2013_08_23.cmd.txt
   0.0k   9/13/13  0:14  multisward2013_09_13.cmd.txt
   0.0k  11/07/13 14:44  multisward2013_11_07.cmd.txt

. dir logs/results/
  <dir>   2/20/13 16:08  .                 
  <dir>  11/22/13 12:04  ..                

. dir logs/
  <dir>  11/22/13 12:04  .                 
  <dir>  11/22/13 15:49  ..                
   0.1k   6/29/13 17:45  .dta2013_06_29.cmd.txt
  18.0k   6/29/13 17:45  .dta2013_06_29.txt
   0.0k   6/30/13 13:27  .dta2013_06_30.cmd.txt
   6.5k   6/30/13 13:43  .dta2013_06_30.txt
   0.0k   6/27/13 22:19  .txt              
  14.4k   6/28/13 13:14  msward_2013_06_27.txt
   0.0k   6/29/13 17:45  multisward.dta2013_06_29.cmd.txt
  23.1k   6/29/13 18:02  multisward.dta2013_06_29.txt
   0.0k   6/30/13 12:14  multisward.dta2013_06_30.cmd.txt
   6.7k   6/30/13 12:15  multisward.dta2013_06_30.txt
   0.0k   6/28/13 14:13  multisward2013_06_28.cmd.txt
  17.0k   6/28/13 14:14  multisward2013_06_28.txt
   0.0k   6/30/13 15:31  multisward2013_06_30.cmd.txt
   6.8k   6/30/13 15:46  multisward2013_06_30.txt
   0.0k   7/26/13 17:50  multisward2013_07_26.cmd.txt
   1.3k   7/26/13 17:50  multisward2013_07_26.txt
   0.0k   8/01/13 18:55  multisward2013_08_01.cmd.txt
  15.8k   8/01/13 18:56  multisward2013_08_01.txt
   0.1k   8/02/13 18:25  multisward2013_08_02.cmd.txt
  18.7k   8/02/13 18:25  multisward2013_08_02.txt
  21.7k   8/08/13 18:34  multisward2013_08_08.txt
   0.0k   8/09/13 17:00  multisward2013_08_09.cmd.txt
  18.1k   8/09/13 17:00  multisward2013_08_09.txt
   0.2k   8/10/13 12:44  multisward2013_08_10.cmd.txt
   8.7k   8/10/13 12:44  multisward2013_08_10.txt
   0.0k   8/12/13 16:33  multisward2013_08_12.cmd.txt
  16.2k   8/12/13 16:33  multisward2013_08_12.txt
   0.0k   8/13/13 13:03  multisward2013_08_13.cmd.txt
  28.9k   8/13/13 13:08  multisward2013_08_13.txt
   0.3k   8/16/13 19:52  multisward2013_08_16.cmd.txt
  14.4k   8/16/13 19:52  multisward2013_08_16.txt
   0.3k   8/21/13 16:37  multisward2013_08_21.cmd.txt
  14.1k   8/21/13 16:37  multisward2013_08_21.txt
   0.0k   8/22/13 16:44  multisward2013_08_22.cmd.txt
  13.3k   8/22/13 16:44  multisward2013_08_22.txt
   0.0k   6/28/13 21:03  multisward.dta2013_06_28.cmd.txt
  20.4k   8/23/13 18:42  multisward2013_08_23.txt
   0.0k   8/26/13 16:52  multisward2013_08_26.cmd.txt
  12.9k   8/26/13 16:52  multisward2013_08_26.txt
   0.3k   8/29/13 10:52  multisward2013_08_29.cmd.txt
  14.6k   8/29/13 10:52  multisward2013_08_29.txt
   0.0k   8/30/13 14:15  multisward2013_08_30.cmd.txt
  11.1k   8/30/13 14:15  multisward2013_08_30.txt
   0.0k   9/06/13 14:55  multisward2013_09_06.cmd.txt
  11.0k   9/06/13 14:55  multisward2013_09_06.txt
   0.1k   9/10/13 23:05  multisward2013_09_10.cmd.txt
  12.0k   9/10/13 23:05  multisward2013_09_10.txt
   0.0k   9/11/13  5:50  multisward2013_09_11.cmd.txt
   1.4k   9/11/13  5:50  multisward2013_09_11.txt
   0.0k   9/12/13 23:00  multisward2013_09_12.cmd.txt
  32.7k   9/12/13 23:00  multisward2013_09_12.txt
  25.9k   9/13/13  0:17  multisward2013_09_13.txt
   4.4k   9/17/13 21:17  multisward2013_09_17.cmd.txt
 142.0k   9/17/13 21:17  multisward2013_09_17.txt
   0.7k   9/18/13 19:11  multisward2013_09_18.cmd.txt
  51.7k   9/18/13 19:11  multisward2013_09_18.txt
   1.0k   9/23/13 11:37  multisward2013_09_23.cmd.txt
  11.7k   9/23/13 11:37  multisward2013_09_23.txt
   0.5k  10/30/13 20:25  multisward2013_10_30.cmd.txt
  16.9k  10/30/13 20:25  multisward2013_10_30.txt
   0.2k  11/01/13  9:17  multisward2013_10_31.cmd.txt
  12.5k  11/01/13  9:17  multisward2013_10_31.txt
   0.0k  11/01/13  9:43  multisward2013_11_01.cmd.txt
  13.1k  11/01/13  9:45  multisward2013_11_01.txt
   0.6k  11/04/13 12:01  multisward2013_11_04.cmd.txt
  27.4k  11/04/13 12:01  multisward2013_11_04.txt
  26.8k  11/07/13 14:44  multisward2013_11_07.txt
   0.1k  11/16/13 17:35  multisward2013_11_16.cmd.txt
   6.7k  11/16/13 17:35  multisward2013_11_16.txt
   0.0k  11/19/13 16:48  multisward2013_11_18.cmd.txt
  55.2k  11/19/13 16:48  multisward2013_11_18.txt
   0.0k  11/19/13 21:37  multisward2013_11_19.cmd.txt
  72.7k  11/19/13 21:37  multisward2013_11_19.txt
   0.0k  11/21/13 10:26  multisward2013_11_20.cmd.txt
   3.4k  11/21/13 10:26  multisward2013_11_20.txt
   0.0k  11/21/13 14:55  multisward2013_11_21.cmd.txt
   9.0k  11/21/13 14:54  multisward2013_11_21.txt
   3.3k  11/22/13 15:55  multisward2013_11_22.cmd.txt
 235.0k  11/22/13 15:55  multisward2013_11_22.txt
  <dir>   2/20/13 16:08  results           
  18.7k   6/28/13 21:04  multisward.dta2013_06_28.txt
   0.0k   8/08/13 18:34  multisward2013_08_08.cmd.txt
   0.3k   8/23/13 18:42  multisward2013_08_23.cmd.txt
   0.0k   9/13/13  0:14  multisward2013_09_13.cmd.txt
   0.0k  11/07/13 14:44  multisward2013_11_07.cmd.txt

. view logs/multisward2013_11_22.txt

. log close
      name:  <unnamed>
       log:  G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_11_22.txt
  log type:  text
 closed on:  22 Nov 2013, 15:56:29
----------------------------------------------------------------------------------------------------------------------------
