--------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_09_23.txt
  log type:  text
 opened on:  23 Sep 2014, 13:52:09

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  13:52:09  on 23 Sep 2014

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(note: file D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_09_23.cmd.txt not found)
(cmdlog D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_09_23.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file D:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. local vlist "`dep_vlist' `indep_vlist'"

. foreach var of  local vlist {
  2. 
.   recast double `var'
  3. 
. }

. 
. 
. set more on

. do sub_do/diagnostics.do "`dep_vlist'" "`indep_vlist'"

. args dep_vlist indep_vlist

. 
. macro list _dep_vlist _indep_vlist 
_dep_vlist:     lntotalspecificcosts
_indep_vlist:   lndairyproducts lnPTotalCattle lnPCompoundfeedingstuffsforcatt lnPFERTILISERSANDSOILIMPROVERS

. 
. preserve

. 
. keep `dep_vlist' `indep_vlist' country pid year

. 
. qui reg  `dep_vlist' `indep_vlist' 

. predict xb , xb
(6 missing values generated)

. predict r  , resid
(6 missing values generated)

. predict rst, rstudent
(6 missing values generated)

. predict lev, hat
(6 missing values generated)

. 
. 
. /* Detecting Unusual and Influential Data
> ---------------------------------------------*/
. rvfplot

.   more

. lvr2plot 

.   more

. 
. foreach var of local indep_vlist {
  2.   avplot  `var'
  3.   more
  4.   rvpplot `var', yline(10)
  5.   more
  6. 
. }

. 
. graph drop _all

. 
. 
. /* Hadi's (1992, 1994) Algorithm to ID possible outliers, optimized by
>      Weber (2010) */
. bacon `dep_vlist' `indep_vlist', gen(out1)

Total number of observations:       28747
   BACON outliers (p = 0.15):           5
      Non-outliers remaining:       28742

. tw sc rst xb, ml(out1)

. tw sc rst xb if out1 == 1, ml(country)

. more

. 
. /* Tests for Normality of Residuals 
>    (for SFA, we expect them to be non-normal. 
>     They would be skewed if there is 
>     inefficiency present, but they must be 
>     LEFT-SKEWED!!!)
> --------------------------------------------- */
. kdensity r, norm

. more

. 
. 
. /* Tests for Multicollinearity
> ---------------------------------------------*/
. vif

    Variable |       VIF       1/VIF  
-------------+----------------------
lnPFERTILI~S |      4.08    0.244908
lnPTotalCa~e |      2.98    0.335866
lnPCompoun~t |      1.82    0.548923
lndairypro~s |      1.05    0.953744
-------------+----------------------
    Mean VIF |      2.48

. more

. 
. 
. /* Tests for Non-Linearity
> ---------------------------------------------*/
. foreach var of local indep_vlist {
  2. 
.   acprplot `var'
  3.   more
  4.   cprplot `var'
  5.   more
  6. 
. }

. 
. graph drop _all

. 
. /* Tests for Model Specification
> ---------------------------------------------*/
. linktest 

      Source |       SS       df       MS              Number of obs =   28747
-------------+------------------------------           F(  2, 28744) =81524.36
       Model |  17055.3044     2  8527.65221           Prob > F      =  0.0000
    Residual |   3006.6945 28744  .104602509           R-squared     =  0.8501
-------------+------------------------------           Adj R-squared =  0.8501
       Total |  20061.9989 28746  .697905758           Root MSE      =  .32342

------------------------------------------------------------------------------
lntotalspe~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        _hat |   .1932986   .0443736     4.36   0.000     .1063243    .2802729
      _hatsq |   .0378719   .0020799    18.21   0.000     .0337951    .0419487
       _cons |   4.273287   .2361619    18.09   0.000     3.810399    4.736175
------------------------------------------------------------------------------

. more

. ovtest 

Ramsey RESET test using powers of the fitted values of lntotalspecificcosts
       Ho:  model has no omitted variables
               F(3, 28739) =    193.55
                  Prob > F =      0.0000

. more

. 
. 
. /* Wooldridge's panel test for Serial Correlation
> ---------------------------------------------*/
. xtserial `dep_vlist' `indep_vlist'

Wooldridge test for autocorrelation in panel data
H0: no first-order autocorrelation
    F(  1,    3589) =    189.711
           Prob > F =      0.0000

. more

. 
. 
. * Data description
. describe    pid year `dep_vlist' `indep_vlist'

              storage  display     value
variable name   type   format      label      variable label
--------------------------------------------------------------------------------------------------------------------------------------------------------------------
pid             float  %9.0g                  ID (unique for whole panel)
year            int    %ty         yy         year
lntotalspecif~s double %9.0g                  
lndairyproducts double %9.0g                  
lnPTotalCattle  double %9.0g                  
lnPCompoundfe~t double %9.0g                  
lnPFERTILISER~S double %9.0g                  

. summ        pid year `dep_vlist' `indep_vlist'

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         pid |     28753    3509.337    2307.203          1       7742
        year |     28753    2002.886    2.578091       1999       2007
lntotalspe~s |     28753    10.59034    .8363159   5.529429   14.09032
lndairypro~s |     28747     12.5815    .7696248   8.268732   15.75065
lnPTotalCa~e |     28753   -.0020111    .0826745  -.1154109   .1241626
-------------+--------------------------------------------------------
lnPCompoun~t |     28753    4.653798    .0694497   4.562263   4.852811
lnPFERTILI~S |     28753    4.747869    .1422505   4.517431   5.136386

. 
. * Panel characterstics
. xtdescribe 

     pid:  1, 2, ..., 7742                                   n =       7709
    year:  1999, 2000, ..., 2007                             T =          9
           Delta(year) = 1 year
           Span(year)  = 9 periods
           (pid*year uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                         1       1       1         3         6       9       9

     Freq.  Percent    Cum. |  Pattern
 ---------------------------+-----------
      845     10.96   10.96 |  111111111
      702      9.11   20.07 |  1........
      688      8.92   28.99 |  11.......
      373      4.84   33.83 |  ........1
      231      3.00   36.83 |  111......
      230      2.98   39.81 |  .......11
      203      2.63   42.44 |  ..1111111
      202      2.62   45.06 |  .1.......
      198      2.57   47.63 |  ..1......
     4037     52.37  100.00 | (other patterns)
 ---------------------------+-----------
     7709    100.00         |  XXXXXXXXX

. xtsum       pid year `dep_vlist' `indep_vlist'

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
pid      overall |  3509.337   2307.203          1       7742 |     N =   28753
         between |              2236.93          1       7742 |     n =    7709
         within  |                    0   3509.337   3509.337 | T-bar =  3.7298
                 |                                            |
year     overall |  2002.886   2.578091       1999       2007 |     N =   28753
         between |             2.333301       1999       2007 |     n =    7709
         within  |             1.953716   1997.636   2008.136 | T-bar =  3.7298
                 |                                            |
lntota~s overall |  10.59034   .8363159   5.529429   14.09032 |     N =   28753
         between |             .8654513   5.529429   13.80699 |     n =    7709
         within  |             .1697864   8.755104   12.40564 | T-bar =  3.7298
                 |                                            |
lndair~s overall |   12.5815   .7696248   8.268732   15.75065 |     N =   28747
         between |             .8021383   8.268732   15.60458 |     n =    7705
         within  |             .1256265   10.20696   14.37921 | T-bar = 3.73095
                 |                                            |
lnPTot~e overall | -.0020111   .0826745  -.1154109   .1241626 |     N =   28753
         between |             .0671015  -.1154109   .1241626 |     n =    7709
         within  |             .0677761  -.1642726   .1546755 | T-bar =  3.7298
                 |                                            |
lnPCom~t overall |  4.653798   .0694497   4.562263   4.852811 |     N =   28753
         between |             .0495151   4.562263   4.852811 |     n =    7709
         within  |             .0607838   4.509045   4.861423 | T-bar =  3.7298
                 |                                            |
lnPFER~S overall |  4.747869   .1422505   4.517431   5.136386 |     N =   28753
         between |             .1300917   4.517431   5.136386 |     n =    7709
         within  |             .1055226   4.435519   5.087929 | T-bar =  3.7298

. 
. 
. 
. capture erase panel_est.doc

. 
. 
. * Pooled OLS
. qui reg `dep_vlist' `indep_vlist'

. outreg using panel_est, nodisplay ctitle("", Pooled) ///
>   starlevels(10 5 1)

. 
. 
. * Population-averaged estimator
. qui xtreg `dep_vlist' `indep_vlist', pa

. outreg using panel_est, merge nodisplay ctitle("", Pop. Avg.)

. 
. 
. 
. * Between estimator
. qui xtreg `dep_vlist' `indep_vlist', be

. outreg using panel_est, merge nodisplay ctitle("", Between)

. 
. 
. 
. * Fixed effects estimator 
. qui xtreg `dep_vlist' `indep_vlist', fe

. estimates store fixed

. predict alphafehat, u
(6 missing values generated)

. outreg using panel_est, merge nodisplay ctitle("", FE)

. 
. 
. 
. * First-differences estimator
. qui reg D.(`dep_vlist' `indep_vlist'), noconstant

. outreg using panel_est, merge nodisplay ctitle("", 1st Diff)

. 
. 
. 
. * Random effects estimator
. qui xtreg `dep_vlist' `indep_vlist', re theta

. estimates store random

. outreg using panel_est, merge ctitle("", RE) 

                            ------------------------------------------------------------------------------------------------------------
                                                                   Pooled     Pop. Avg.    Between       FE      1st Diff       RE     
                            ------------------------------------------------------------------------------------------------------------
                             lndairyproducts                        0.984       0.925       0.980       0.676                 0.900    
                                                                 (385.59)***  (237.68)**  (209.04)**  (90.80)**             (225.03)** 
                             lnPTotalCattle                        -0.188       -0.027      -0.598      0.060                 -0.009   
                                                                  (4.69)***     (1.05)     (5.38)**   (2.67)**                (0.40)   
                             lnPCompoundfeedingstuffsforcatt        0.473       0.528       0.886       0.546                 0.531    
                                                                 (12.68)***   (23.47)**    (6.52)**   (28.13)**             (27.07)**  
                             lnPFERTILISERSANDSOILIMPROVERS         0.338       0.184       0.453       0.185                 0.175    
                                                                 (12.39)***    (9.68)**    (6.47)**   (10.88)**             (10.43)**  
                             D.lndairyproducts                                                                     0.570               
                                                                                                                 (66.01)**             
                             D.lnPTotalCattle                                                                      0.031               
                                                                                                                  (1.53)               
                             D.lnPCompoundfeedingstuffsforcatt                                                     0.405               
                                                                                                                 (23.62)**             
                             D.lnPFERTILISERSANDSOILIMPROVERS                                                      0.261               
                                                                                                                 (13.49)**             
                             _cons                                 -5.598       -4.360      -7.991     -1.333                 -4.013   
                                                                 (35.83)***   (42.12)**   (15.22)**   (11.29)**             (42.82)**  
                             R2                                     0.85                     0.86       0.41       0.24                
                             N                                     28,747       28,747      28,747     28,747     19,468      28,747   
                            ------------------------------------------------------------------------------------------------------------
                                                                   * p<0.1; ** p<0.05; *** p<0.01


. more

. 
. 
. * Hausman test for RE vs FE
. hausman fixed random

                 ---- Coefficients ----
             |      (b)          (B)            (b-B)     sqrt(diag(V_b-V_B))
             |     fixed        random       Difference          S.E.
-------------+----------------------------------------------------------------
lndairypro~s |    .6757366     .9002588       -.2245222        .0062752
lnPTotalCa~e |    .0603932    -.0089125        .0693057        .0013618
lnPCompoun~t |     .546399      .531027        .0153721               .
lnPFERTILI~S |      .18524     .1748235        .0104165        .0029503
------------------------------------------------------------------------------
                           b = consistent under Ho and Ha; obtained from xtreg
            B = inconsistent under Ha, efficient under Ho; obtained from xtreg

    Test:  Ho:  difference in coefficients not systematic

                  chi2(4) = (b-B)'[(V_b-V_B)^(-1)](b-B)
                          =     1265.61
                Prob>chi2 =      0.0000
                (V_b-V_B is not positive definite)

. more

. 
. 
. * Breusch-Pagan LM test for RE vs OLS
. estimates restore random // make sure RE estimates are active
(results random are active now)

. xttest0

Breusch and Pagan Lagrangian multiplier test for random effects

        lntotalspecificcosts[pid,t] = Xb + u[pid] + e[pid,t]

        Estimated results:
                         |       Var     sd = sqrt(Var)
                ---------+-----------------------------
               lntotal~s |   .6979058       .8354075
                       e |   .0232747       .1525604
                       u |    .091896       .3031436

        Test:   Var(u) = 0
                             chibar2(01) = 31363.32
                          Prob > chibar2 =   0.0000

. more

. 
. 
. * Individual specific effects from FE
. summ alphafehat

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
  alphafehat |     28747   -1.38e-10    .3821813  -2.476685   2.227497

. hist alphafehat
(bin=44, start=-2.4766853, width=.10691323)

. more

. 
. restore

. graph drop _all

. STOP!!!
unrecognized command:  STOP
r(199);

end of do-file
r(199);

end of do-file

r(199);

. cd ../
D:\Data\data_FADNPanelAnalysis\Do_Files

. dir
  <dir>   5/10/14 20:13  .                 
  <dir>   5/10/14 20:13  ..                
  <dir>   9/23/14 13:53  multisward        
  <dir>   7/30/14 15:44  niie              
  <dir>   4/13/14 14:09  _Colleagues_Projects
  <dir>   4/13/14 14:30  _Project_Archive  

. cd ../../
D:\Data

. cd NFSPanelAnalysis/Do_Files/
unable to change to NFSPanelAnalysis/Do_Files/
r(170);

. cd data_NFSPanelAnalysis/Do_Files/
D:\Data\data_NFSPanelAnalysis\Do_Files

. dir
  <dir>   9/03/14 13:04  .                 
  <dir>   9/03/14 13:04  ..                
  <dir>   5/12/14 11:19  Carroll_et_al     
  <dir>   1/22/14 11:46  data_productivity 
  <dir>   4/13/14 14:42  EnergyCrops       
  <dir>   9/16/14 17:47  FarmPriceVolMSM_PRG
  <dir>   3/22/14 21:39  NFS_Practical     
  <dir>   1/22/14 11:46  ProductivityAnalysis
  <dir>   8/17/14 19:30  Quota             
  <dir>   9/15/14 11:17  RAW_79_83         
1285.9k   6/25/14 18:20  RAW_79_83(old).zip
1949.2k   7/07/14 13:03  RAW_79_83.zip     
  <dir>   3/22/14 21:37  REDP_Book         
  <dir>   4/13/14 14:26  TFPmatthews       
  <dir>   9/03/14 13:04  _Colleagues_Projects
  <dir>   4/13/14 14:34  _Project_Archive  

. cd _Colleagues_Projects
D:\Data\data_NFSPanelAnalysis\Do_Files\_Colleagues_Projects

. dir
  <dir>   9/03/14 13:04  .                 
  <dir>   9/03/14 13:04  ..                
  <dir>   1/22/14 11:46  BeefModelAnalysis 
  <dir>   3/22/14 21:36  CommodityAnalysis 
  <dir>   5/05/14 14:36  ConvertIBDataSet  
  12.3k  11/14/10 13:34  Dairy Demographics.do
  <dir>   3/22/14 21:36  DairyInnovation   
  60.0k   8/01/12 14:21  doFarmDerivedVars.do
  <dir>   1/22/14 11:46  FarmDemography    
  <dir>   1/22/14 11:46  FarmIncome        
  <dir>   3/22/14 21:37  FarmLevelModel    
3218.2k  11/17/08  8:50  FarmLevelModel.zip
  <dir>   3/22/14 21:37  FarmPartnershipAnalysis
  <dir>   9/03/14 16:47  FarmPriceVolMSM   
  <dir>   8/12/14 11:46  FarmPriceVolMSM (2)
 134.6k   7/31/14 11:06  FarmPriceVolMSM (2).zip
  <dir>   1/22/14 11:46  Fezzi_sim         
  <dir>   1/22/14 11:46  ForestryAnalysis  
  <dir>   1/22/14 11:46  HBSNFSMatch       
  <dir>   3/22/14 21:37  IGM               
  <dir>   3/22/14 21:37  IndicatorAnalysis 
  <dir>   3/22/14 21:37  InequalityAnalysis
 145.6k  11/01/11 12:16  labelNFSvars.do   
  <dir>   1/22/14 11:46  LFA_Productivity  
  <dir>   1/22/14 11:46  MarginsValidationAnalysis
  33.6k  12/12/10 16:48  MPATabs.do        
  30.7k  10/11/09 22:21  NFSPanelCreate.do 
  32.1k   7/18/11 17:11  NFSPanelCreate09.do
   5.3k   8/08/08  8:09  NFSPanelCreationOld.do
  <dir>   3/22/14 21:39  Peter Howley_AGMEMOD
  24.8k   4/03/09  8:57  PriceIndexCalc.do 
  <dir>   1/22/14 11:46  REPSAnalysis      
   4.8k  12/14/10 17:01  RERC-Sheep Analysis.do
   0.6k   9/04/12 18:37  Shortcut to REDP_Book.lnk
   2.3k   7/13/10 21:47  SineadOKeefeData.do
   2.3k   7/26/10  8:50  SineadOKeefeDataSum.do
   1.2k  12/14/10 14:17  SMILEtest.do      
  <dir>   3/22/14 21:37  SpatialMatch      
  37.1k   2/09/09 10:25  SpatialMatch.zip  
  11.7k   8/08/08  8:09  TEST.do           
  16.2k   9/25/10  8:06  Viabilitycalc.do  
  <dir>   1/22/14 11:46  WaterSummit       
  <dir>   3/22/14 21:37  WeatherData       
  <dir>   3/22/14 21:37  WFD_Conf          

. cd FarmPriceVolMSM
D:\Data\data_NFSPanelAnalysis\Do_Files\_Colleagues_Projects\FarmPriceVolMSM

. dir
  <dir>   9/03/14 16:47  .                 
  <dir>   9/03/14 16:47  ..                
   7.3k   7/31/14 11:06  allocindexvar.do  
  46.3k   7/31/14 11:07  CreatePricescalar.do
  27.7k   7/31/14 11:06  Cr_Alloc_WinterForage.do
   4.0k   7/31/14 11:06  Cr_bulkfeed_fed_livestock_eu_1.do
   0.7k   7/31/14 11:06  Cr_bulkfeed_fed_livestock_eu_2.do
   1.1k   7/31/14 11:06  Cr_bulkyfeed_fedto_livestock_eu.do
   0.5k   7/31/14 11:06  Cr_car_electricity_telephone.do
   1.0k   7/31/14 11:06  Cr_cattle_dairy_boarding_com.do
   0.4k   7/31/14 11:06  Cr_crops_total_dc.do
   0.5k   7/31/14 11:06  Cr_curr_misc_cash_crops_go.do
   4.0k   7/31/14 11:06  Cr_curr_misc_cash_crops_go_1.do
   1.3k   7/31/14 11:06  Cr_deer_goats_misc_dc_eu.do
   0.5k   7/31/14 11:06  Cr_depreciation_of_buildings.do
   0.5k   7/31/14 11:07  Cr_depreciation_of_land_imps.do
   0.8k   7/31/14 11:07  Cr_depreciation_of_machinery.do
   0.6k   8/18/14 13:16  Cr_d_conc_fed_cattle_eu.bak
   0.6k   8/18/14 13:28  Cr_d_conc_fed_cattle_eu.do
   0.6k   8/18/14 13:28  Cr_d_conc_fed_dairy_eu.do
   0.5k   7/31/14 11:06  Cr_d_conc_fed_sheep_eu.do
   0.7k   7/31/14 11:06  Cr_d_dairy_pasture_eu.do
   1.6k   7/31/14 11:06  Cr_d_dairy_prod_misc_dc_eu.do
   0.5k   7/31/14 11:06  Cr_d_deer_pasture_eu.do
   0.5k   7/31/14 11:06  Cr_d_horse_pasture_eu.do
   0.6k   7/31/14 11:06  Cr_d_inter_enterpise_trans_eu.do
   1.0k   7/31/14 11:06  Cr_d_livestock_misc_dc_eu.do
   0.6k   8/18/14 13:25  Cr_d_milk_and_milk_subs_no.bak
   0.5k   8/18/14 13:28  Cr_d_milk_and_milk_subs_no.do
   1.0k   7/31/14 11:06  Cr_d_pigs_total_dc_eu.do
   1.0k   7/31/14 11:06  Cr_d_poultry_total_dc_eu.do
   1.0k   7/31/14 11:06  Cr_d_roots_direct_costs_eu.do
   0.9k   7/31/14 11:06  Cr_d_sheep_misc_dc_eu.do
   0.6k   7/31/14 11:06  Cr_d_sheep_pasture_eu.do
   0.7k   7/31/14 11:06  Cr_d_total_pasture_eu.do
   0.2k   7/31/14 11:07  Cr_farm_boardingi_fod_dc_0.do
   0.5k   7/31/14 11:07  Cr_farm_boardingi_fod_dc_1.do
   0.7k   7/31/14 11:07  Cr_fed_cattle_tonnes_ha.do
   0.6k   7/31/14 11:07  Cr_fed_dairy_tonnes_ha.do
   0.5k   7/31/14 11:07  Cr_fed_deer_tonnes_ha.do
   0.5k   7/31/14 11:07  Cr_fed_goats_tonnes_ha.do
   0.6k   7/31/14 11:07  Cr_fed_horses_tonnes_ha.do
   0.5k   7/31/14 11:07  Cr_fed_sheep_tonnes_ha.do
   0.8k   7/31/14 11:07  Cr_FodderCrops_DC.do
  17.0k   7/31/14 11:07  Cr_FodderGO.do    
   8.7k   7/31/14 11:07  Cr_Fodder_Unit_Cost.do
   1.4k   7/31/14 11:07  Cr_GrazingDC.do   
   0.2k   7/31/14 11:07  Cr_hay_ha.do      
   1.4k   7/31/14 11:07  Cr_hay_silage_fed.do
   0.6k   7/31/14 11:07  Cr_hay_silage_ha.do
   1.3k   7/31/14 11:07  Cr_hay_sil_fed_unit_cost.do
   0.3k   7/31/14 11:07  Cr_hired_labour_casual_excl.do
   0.4k   7/31/14 11:07  Cr_horses_boarding_in_out_com.do
   0.7k   7/31/14 11:07  Cr_horses_misc_dc_eu.do
   0.7k   7/31/14 11:07  Cr_interest_payments.do
   3.6k   9/03/14 13:12  Cr_i_concentrates.do
   0.7k   7/31/14 11:07  Cr_machinery_op_expenses.do
   0.9k   7/31/14 11:07  Cr_merged_crop_tables.do
   0.4k   7/31/14 11:07  Cr_merged_crop_tables_0.do
   0.0k   7/31/14 11:07  Cr_merged_crop_tables_2-subtract.do
  64.7k   7/31/14 11:07  Cr_merged_crop_tables_2.do
   0.3k   7/31/14 11:07  Cr_merged_crop_tables_4.do
   0.8k   7/31/14 11:07  Cr_misc_overhead_costs.do
   5.8k   7/31/14 11:07  Cr_OP_INV_VAL_EU.do
   0.4k   7/31/14 11:07  Cr_other_cashcrops_ind_dc.do
   0.4k   7/31/14 11:07  Cr_oth_csh_crop_ind_dc.do
   0.5k   7/31/14 11:07  Cr_paid_labour.do 
   0.4k   7/31/14 11:07  Cr_pasture_ha.do  
   0.6k   7/31/14 11:07  Cr_pasture_hay_silage_ha.do
   0.6k   7/31/14 11:07  Cr_power_machinery_totals.do
   0.4k   7/31/14 11:07  Cr_select_crops_dc.do
   0.4k   7/31/14 11:07  Cr_setaside_dc.do 
   0.7k   7/31/14 11:07  Cr_sheep_boarding_in_out_com.do
   0.2k   7/31/14 11:07  Cr_silage_ha.do   
   0.6k   7/31/14 11:07  Cr_sum_grazing_total_dc_eu.do
   0.4k   7/31/14 11:07  Cr_sum_i_conc_fed_cattle.do
   0.4k   7/31/14 11:07  Cr_sum_i_conc_fed_dairy.do
   0.4k   7/31/14 11:07  Cr_sum_i_conc_fed_horses.do
   0.4k   7/31/14 11:07  Cr_sum_i_conc_fed_pigs.do
   0.4k   7/31/14 11:07  Cr_sum_i_conc_fed_poultry.do
   0.4k   7/31/14 11:07  Cr_sum_i_conc_fed_sheep.do
   3.1k   7/31/14 11:07  Cr_svy_cattle_0.do
   4.2k   8/28/14 12:03  Cr_svy_cattle_2.do
   0.1k   7/31/14 11:07  Cr_svy_crops_1.do 
   0.1k   7/31/14 11:07  Cr_svy_crops_casual_labour_1.do
   0.3k   7/31/14 11:07  Cr_svy_crops_fodder_dc.do
   0.3k   7/31/14 11:07  Cr_svy_crops_fodder_go.do
   0.1k   7/31/14 11:07  Cr_svy_crop_disposal_1.do
   0.1k   7/31/14 11:07  Cr_svy_crop_expenses_1.do
   0.9k   8/31/14 14:13  Cr_svy_crop_fertilizer_1.do
   1.4k   7/31/14 11:07  Cr_svy_crop_fertilizer_2.do
   1.6k   7/31/14 11:07  Cr_svy_dairy_produce_1.do
   1.2k   7/31/14 11:07  Cr_svy_deer_1.do  
   0.3k   7/31/14 11:07  Cr_svy_grazing_1.do
   0.3k   7/31/14 11:07  Cr_svy_grazing_2.do
   0.2k   7/31/14 11:07  Cr_svy_grazing_fodder_dc.do
   0.3k   7/31/14 11:07  Cr_svy_grazing_fodder_go.do
   1.2k   7/31/14 11:07  Cr_svy_hay_silage_0.do
  10.2k   7/31/14 11:07  Cr_svy_hay_silage_1.do
   0.2k   7/31/14 11:07  Cr_svy_hay_silage_fodder_dc.do
   0.2k   7/31/14 11:07  Cr_svy_hay_silage_fodder_go.do
   0.5k   7/31/14 11:07  Cr_svy_horses_other_0.do
   3.2k   9/03/14 16:37  Cr_svy_horses_other_1.do
   1.1k   7/31/14 11:07  Cr_svy_livestock_expenses_1.do
   0.4k   7/31/14 11:07  Cr_svy_misc_cash_crops_dc.do
   4.0k   7/31/14 11:07  Cr_svy_misc_cash_crops_go.do
   0.8k   7/31/14 11:07  Cr_svy_pigs_1.do  
   1.4k   7/31/14 11:07  Cr_svy_poultry_1.do
   1.4k   9/03/14 16:47  Cr_svy_sheep_0.do 
   2.3k   7/31/14 11:07  Cr_svy_sheep_2.do 
   4.9k   7/31/14 11:07  Cr_svy_subsidies_grants_1.do
   1.3k   7/31/14 11:07  Cr_wint_forg_fed_unit_cost.do
   2.7k   7/31/14 11:07  CSOprice.do       
  21.2k   7/31/14 11:07  DataDictionary.xlsx
   0.2k   7/31/14 11:07  GV_fertiliser.do  
  95.3k   9/02/14 16:20  main_pvadj3.do    
   2.2k   7/31/14 11:07  PC_Bulkyfeed.do   
   2.0k   7/31/14 11:07  PC_CropExpenses - Copy.do
   2.0k   7/31/14 11:07  PC_CropExpenses.do
   2.0k   7/31/14 11:07  PC_CropGO - Copy.do
   2.0k   7/31/14 11:07  PC_CropGO.do      
   1.9k   7/31/14 11:07  PC_Fertiliser - Copy.do
   1.9k   7/31/14 11:07  PC_Fertiliser.do  
   1.9k   7/31/14 11:07  PC_Milk - Copy.do 
   1.9k   7/31/14 11:07  PC_Milk.do        
   1.9k   7/31/14 11:07  PC_Priceonly - Copy.do
   1.9k   7/31/14 11:07  PC_Priceonly.do   
   1.9k   7/31/14 11:07  PC_Test - Copy.do 
   1.9k   7/31/14 11:07  PC_Test.do        
   1.8k   7/31/14 11:07  PriceCalculator.do
  21.4k   7/31/14 11:07  PriceSimulation.do
   2.2k   7/31/14 11:07  PriceSimulator.do 
   2.7k   7/31/14 11:07  pricevlist.do     
   6.5k   7/31/14 11:07  PS_Bulkyfeed.do   
   6.2k   7/31/14 11:07  PS_CropExpenses - Copy.do
   6.5k   7/31/14 11:07  PS_CropExpenses.do
   6.8k   7/31/14 11:07  PS_CropGO - Copy.do
   7.0k   7/31/14 11:07  PS_CropGO.do      
   5.2k   7/31/14 11:07  PS_fertiliser - Copy.do
   5.4k   7/31/14 11:07  PS_fertiliser.do  
   5.8k   7/31/14 11:07  PS_Milk - Copy.do 
   6.0k   7/31/14 11:07  PS_Milk.do        
   5.1k   7/31/14 11:07  PS_PriceOnly - Copy.do
   5.4k   7/31/14 11:07  PS_PriceOnly.do   
   5.8k   7/31/14 11:07  PS_Test - Copy.do 
   6.0k   7/31/14 11:07  PS_Test.do        
   3.1k   7/31/14 11:07  ScenarioPrice.do  

. cd ../../
D:\Data\data_NFSPanelAnalysis\Do_Files

. dir
  <dir>   9/03/14 13:04  .                 
  <dir>   9/03/14 13:04  ..                
  <dir>   5/12/14 11:19  Carroll_et_al     
  <dir>   1/22/14 11:46  data_productivity 
  <dir>   4/13/14 14:42  EnergyCrops       
  <dir>   9/16/14 17:47  FarmPriceVolMSM_PRG
  <dir>   3/22/14 21:39  NFS_Practical     
  <dir>   1/22/14 11:46  ProductivityAnalysis
  <dir>   8/17/14 19:30  Quota             
  <dir>   9/15/14 11:17  RAW_79_83         
1285.9k   6/25/14 18:20  RAW_79_83(old).zip
1949.2k   7/07/14 13:03  RAW_79_83.zip     
  <dir>   3/22/14 21:37  REDP_Book         
  <dir>   4/13/14 14:26  TFPmatthews       
  <dir>   9/03/14 13:04  _Colleagues_Projects
  <dir>   4/13/14 14:34  _Project_Archive  

. cd RAW_79_83/
D:\Data\data_NFSPanelAnalysis\Do_Files\RAW_79_83

. dir
  <dir>   9/15/14 11:17  .                 
  <dir>   9/15/14 11:17  ..                
  22.5k   8/29/14 15:13  CathalDataCreate4.do
  <dir>   8/21/14 11:24  old_code          
  10.2k   6/26/14 21:32  raw2Stata11_2014_06_25.do
  12.1k   8/31/14 10:31  raw2Stata11_2014_08_29.do
  11.3k   9/15/14 11:17  raw2StataLennon_2014_08_31.do
  13.4k   6/25/14 13:36  raw2Stata_2014_06_25.do
   8.6k   7/07/14 13:02  README.txt        
  <dir>   9/16/14 17:39  sub_do            

. cd sub_do
D:\Data\data_NFSPanelAnalysis\Do_Files\RAW_79_83\sub_do

. dir
  <dir>   9/16/14 17:39  .                 
  <dir>   9/16/14 17:39  ..                
   0.6k   7/07/14 11:29  comparevars.do    
   9.1k   8/27/14 16:49  createWeights.do  
   1.3k   7/07/14 11:52  create_renameIB2SAS_code.do
   1.2k   7/07/14 11:52  create_renameSheet_code.do
   3.7k   8/31/14 11:56  create_renameSheet_lennon_code.do
  12.8k   8/28/14 14:30  create_svy_tables.do
   1.6k   8/28/14 14:30  create_svy_tables2.do
   2.4k   7/07/14 11:41  cropcodekey.do    
   0.9k   7/07/14 11:46  cropcodelist.do   
   6.9k   8/22/14 14:22  Cr_d_sample_cell.do
   0.6k   7/31/14 11:07  Cr_fed_dairy_tonnes_ha.do
  <dir>   6/24/14 19:29  dcD_CATTLE_TOTAL_DIRECT_COSTS_EU
  <dir>   6/29/14 17:24  dcD_CROP_LIVESTOCK_DIRECT_COSTS_EU
  <dir>   6/29/14 17:24  dcD_DAIRY_TOTAL_DIRECT_COSTS_EU
  <dir>   6/29/14 17:24  dcD_DAIRY_TOTAL_FEED_EU
  <dir>   6/29/14 17:24  dcD_FARM_DIRECT_COSTS
  <dir>   6/24/14 19:29  dcD_HORSES_DIRECT_COSTS_EU
  <dir>   6/24/14 19:29  dcD_OTHER_DIRECT_COSTS_EU
  <dir>   6/24/14 19:29  dcD_PIGS_TOTAL_DIRECT_COSTS_EU
  <dir>   6/24/14 19:29  dcD_POULTRY_DIRECT_COSTS_EU
  <dir>   6/24/14 19:29  dcD_TOTAL_CROPS_DIRECT_COSTS_EU
  <dir>   6/24/14 19:29  dcD_TOTAL_DIRECT_COSTS_EU
  <dir>   6/29/14 17:24  dcD_TOTAL_LIVESTOCK_DIRECT_COSTS
   1.0k   6/29/14 19:47  derive_all_vars.do
  60.0k   5/12/14 17:51  doFarmDerivedVars.do
   0.6k   7/07/14 11:33  do_collapse.do    
  <dir>   9/16/14 17:40  D_ALLOWANCES_OP_TONNES_HA
  <dir>   8/25/14 14:13  D_ALL_BULLS_AVG_NO
  <dir>   9/16/14 17:39  D_ARABLE_AID      
  <dir>   9/16/14 17:39  D_AREA_AID_LINSEED_TOT_PAY_RECD
  <dir>   9/16/14 17:39  D_AREA_AID_MAIZE_TOTAL_PAY_RECD
  <dir>   9/16/14 17:39  D_AREA_AID_PEAS_BNS_TOT_PAY_RECD
  <dir>   8/18/14 18:26  D_BOARS_PIGSGT20KG_SGMS_AVGNO
  <dir>   8/01/14 14:15  D_BUTTER_FAT_MILK_KGS
  <dir>   8/25/14 12:31  D_CALVES_6_12MTHS_AVG_NO
  <dir>   8/25/14 12:36  D_CALVES_LT6MTHS_AVG_NO
  <dir>   9/16/14 17:39  D_CASH_CROPS_FED_EU
  <dir>   8/01/14 14:15  D_CATTLE_LIVESTOCK_UNITS
  <dir>   8/01/14 14:15  D_CATTLE_LU_BOARDING_IN
  <dir>   8/01/14 14:15  D_CATTLE_LU_BOARDING_OUT
  <dir>   9/16/14 17:39  D_CEREAL_AID_TOTAL_PAYMENT_RECD
  <dir>   8/07/14 10:34  D_CHICKS_PULLETS_AVG_NO
  <dir>   9/16/14 17:40  D_CLOSING_INVENTORY_HORSES_EU
  <dir>   9/16/14 17:40  D_CLOSING_INVENTORY_POULTRY_EU
  <dir>   8/01/14 14:15  D_CLOS_INV_DAIRY_HERD_EU
  <dir>   8/01/14 14:13  D_CONCENTRATES_FED_DAIRY_EU
  <dir>   8/07/14 11:23  D_COWS_AVG_NO     
  <dir>   8/01/14 14:13  D_CROP_LIVESTOCK_GROSS_OUTPUT_EU
  <dir>   9/16/14 17:40  D_DAIRY_GROSS_OUTPUT_EU
  <dir>   9/16/14 17:40  D_DAIRY_HERD_REPLACE_COST_EU
  <dir>   9/16/14 17:40  D_DAIRY_HERD_VALUE_CHANGE_EU
  <dir>   8/01/14 14:15  D_DAIRY_LU_BOARDING_IN
  <dir>   8/01/14 14:15  D_DAIRY_LU_BOARDING_NET
  <dir>   8/01/14 14:15  D_DAIRY_LU_BOARDING_OUT
  <dir>   8/01/14 14:15  D_DAIRY_LVSTCK_UNITS_INCL_BULLS
  <dir>   8/01/14 14:13  D_DAIRY_PASTURE_EU
  <dir>   6/29/14 19:39  D_DAIRY_PRODUCE_MISC_DC_EU
  <dir>   9/16/14 17:40  D_DAIRY_VALUE_DROPPED_CALVES_EU
  <dir>   8/01/14 14:15  D_DAIRY_WINTER_FORAGE_EU
  <dir>   8/01/14 14:15  D_DEER_LIVESTOCK_UNITS
  <dir>   9/16/14 17:40  D_DEER_SALES_EU   
  <dir>   8/07/14 10:34  D_EWES_AVG_NO     
  <dir>   8/01/14 14:13  D_EXPENDITURE_ON_LIME_EU
  <dir>   8/01/14 14:15  D_FARM_ADJUSTED_PASTURE
  <dir>   9/16/14 17:40  D_FARM_GROSS_OUTPUT
  <dir>   8/01/14 14:15  D_FARM_TOTAL_LU_BOARDING_IN
  <dir>   8/01/14 14:15  D_FARM_TOTAL_LU_BOARDING_NET
  <dir>   8/01/14 14:15  D_FARM_TOTAL_LU_BOARDING_OUT
  <dir>   8/01/14 14:15  D_FARM_TOTAL_LU_ON_COMMAGE_NO
  <dir>   8/07/14 10:34  D_FATTENERS_AVG_NO
  <dir>   8/07/14 10:34  D_FATTENING_SOWS_AVG_NO
  <dir>   8/01/14 14:15  D_FEED_AREA_EQUIV_HA
  <dir>   8/20/14 20:31  D_FEMALEGT2YRS_FOR_SGMS_AVGNO
  <dir>   8/20/14 20:30  D_FEMALE_CATTLE_1_2YRS_AVG_NO
  <dir>   8/20/14 20:31  D_FEMALE_CATTLE_GT2YRS_AVG_NO
  <dir>   8/18/14 18:25  D_FEMALE_PIGS_FOR_SGMS_AVGNO
  <dir>   6/29/14 17:58  D_FERTILISER_COST 
  <dir>   8/01/14 14:15  D_FORAGE_AREA_HA  
  <dir>   8/01/14 14:13  D_FUEL_LUBS_EU    
  <dir>   8/07/14 10:34  D_GILTS_IN_PIG_AVG_NO
  <dir>   8/01/14 14:13  D_GRAZING_TOTAL_DIRECT_COSTS_EU
  <dir>   9/16/14 17:40  D_GROSS_OUTPUT_CATTLE_EU
  <dir>   9/16/14 17:39  D_GROSS_OUTPUT_EU 
  <dir>   9/16/14 17:39  D_GROSS_OUTPUT_FDR_CROPS_SOLD_EU
  <dir>   9/16/14 17:40  D_GROSS_OUTPUT_HORSES_EU
  <dir>   9/16/14 17:40  D_GROSS_OUTPUT_PIGS_EU
  <dir>   9/16/14 17:40  D_GROSS_OUTPUT_SHEEP_AND_WOOL_EU
  <dir>   8/01/14 14:15  D_HAY_ADJUSTED_HA 
  <dir>   8/01/14 14:14  D_HAY_FERTILISER_COST_EU
  <dir>   6/29/14 17:24  D_HAY_SALES_CU_EU 
   0.0k   9/16/14 17:39  D_HAY_SALES_CU_EU.log
  <dir>   9/16/14 17:39  D_HAY_SALES_OP_EU 
  <dir>   8/01/14 14:14  D_HAY_TOTAL_DIRECT_COST_EU
  <dir>   8/07/14 10:34  D_HEIFER_IN_CALF_AVG_NO
  <dir>   8/25/14 14:13  D_HERD_SIZE_AVG_NO
  <dir>   8/01/14 14:13  D_HIRED_LABOUR_CASUAL_EXCL_EU
  <dir>   8/07/14 10:41  D_HORSES_AVG_NO   
  <dir>   9/16/14 17:40  D_HORSES_CLOS_INV_BREED_STOCK_EU
  <dir>   9/16/14 17:40  D_HORSES_CLOS_INV_TRADE_STOCK_EU
  <dir>   8/07/14 10:43  D_HORSES_FOR_SGMS_AVGNO
  <dir>   8/01/14 14:15  D_HORSES_LIVESTOCK_UNITS
  <dir>   8/01/14 14:15  D_HORSES_LU_BOARDING_IN
  <dir>   8/01/14 14:15  D_HORSES_LU_BOARDING_OUT
  <dir>   9/16/14 17:40  D_HORSES_OP_INV_BREED_STOCK_EU
  <dir>   9/16/14 17:40  D_HORSES_OP_INV_TRADE_STOCK_EU
  <dir>   9/16/14 17:40  D_HORSE_SALES_EU  
  <dir>   8/01/14 14:13  D_INSURANCE_EU    
  <dir>   9/16/14 17:39  D_INTER_ENTERPRISE_TRANSFERS_EU
  <dir>   8/01/14 14:13  D_INT_PAY_INCL_HP_INT_EU
  <dir>   8/01/14 14:13  D_INVESTMENT_IN_BUILDINGS
  <dir>   8/01/14 14:13  D_INVESTMENT_IN_MACHINERY
  <dir>   8/01/14 14:13  D_INV_IN_LIMPROVEMENTS
  <dir>   6/29/14 17:24  D_LABOUR_UNITS_PAID
  <dir>   8/01/14 14:16  D_LABOUR_UNITS_TOTAL
  <dir>   6/29/14 17:24  D_LABOUR_UNITS_UNPAID
  <dir>   8/07/14 10:35  D_LAMBS_PRE_WEANING_AVG_NO
  <dir>   8/07/14 11:34  D_LAYING_BIRDS_AVG_NO
  <dir>   9/16/14 17:40  D_LS_GROSS_OUTPUT_OP_INV_EU
  <dir>   8/25/14 12:21  D_LT1YR_FOR_SO_AVGNO
  <dir>   8/01/14 14:13  D_MACHINERY_OPERATING_EXP_EU
  <dir>   8/01/14 14:13  D_MACHINERY_RATES_EU
  <dir>   8/20/14 21:53  D_MALEGT2YRS_FOR_SGMS_AVGNO
  <dir>   8/20/14 20:26  D_MALE_CATTLE_1_2YRS_AVG_NO
  <dir>   8/20/14 20:29  D_MALE_CATTLE_GT2YRS_AVG_NO
  <dir>   9/16/14 17:40  D_MB_GROSS_OUTPUT_OP_INV_EU
  <dir>   9/16/14 17:40  D_MILK_ALLOWANCES_EU
  <dir>   9/16/14 17:40  D_MILK_FED_TO_LIVESTOCK_EU
  <dir>   9/16/14 17:40  D_MILK_SOLD_EU    
  <dir>   8/01/14 14:13  D_MISC_OVERHEAD_COSTS_EU
  <dir>   9/16/14 17:40  D_OPENING_INVENTORY_HORSES_EU
  <dir>   9/16/14 17:40  D_OPENING_INVENTORY_POULTRY_EU
  <dir>   9/16/14 17:40  D_OS_GROSS_OUTPUT_OP_INV_EU
  <dir>   9/16/14 17:40  D_OTHER_CASH_GO_OP_INV_EU
  <dir>   8/07/14 10:35  D_OTHER_FOWL_AVG_NO
  <dir>   9/16/14 17:40  D_OTHER_GROSS_OUTPUT_EU
  <dir>   8/07/14 10:35  D_OTHER_LAMBS_LT1YR_AVG_NO
  <dir>   9/16/14 17:40  D_OUTPUT_CURRENT_MISC_CASH_CROP
  <dir>   9/16/14 17:40  D_OUTPUT_INV_MISC_CASH_CROP_EU
  <dir>   8/01/14 14:15  D_PASTURE_ADJUSTED_HAY_SILAGE_HA
  <dir>   9/16/14 17:40  D_PB_GROSS_OUTPUT_OP_INV_EU
  <dir>   9/16/14 17:40  D_PIG_PURCHASES   
  <dir>   9/16/14 17:40  D_PIG_SALES_EU    
  <dir>   8/07/14 10:35  D_PONIES_AVG_NO   
  <dir>   8/07/14 11:24  D_POULTRY1_FOR_SGMS_AVGNO
  <dir>   8/07/14 11:37  D_POULTRY2_FOR_SGMS_AVGNO
  <dir>   8/07/14 10:35  D_POULTRY3_FOR_SGMS_AVGNO
  <dir>   9/16/14 17:40  D_POULTRY_GROSS_OUTPUT_EU
  <dir>   9/16/14 17:40  D_PO_GROSS_OUTPUT_OP_INV_EU
  <dir>   8/01/14 14:15  D_PROTEIN_MILK_KGS
  <dir>   9/16/14 17:40  D_PURCHASES_SHEEP_ONLY_EU
  <dir>   8/01/14 14:15  D_PURCH_FEED_BULK_ALLOC_DAIRY_HA
  <dir>   8/07/14 10:35  D_RAMS_AVG_NO     
  <dir>   9/16/14 17:40  D_SALES_INCL_HSE_CONSUMPTION_EU
  <dir>   9/16/14 17:40  D_SALES_LVSTCK_PRODUCTS_EGGS_EU
  <dir>   9/16/14 17:40  D_SALES_SHEEP_ONLY_INCL_HOUSE_EU
  <dir>   9/16/14 17:40  D_SBEET_GROSS_OUTPUT_OP_INV_EU
  <dir>   9/16/14 17:40  D_SB_GROSS_OUTPUT_OP_INV_EU
  <dir>   9/16/14 17:39  D_SETASIDE_TOTAL_PAY_RECD
  <dir>   8/07/14 10:35  D_SHEEP_1_2YRS_AVG_NO
  <dir>   9/16/14 17:40  D_SHEEP_BREEDING_STOCK_SOLD_EU
  <dir>   8/07/14 10:35  D_SHEEP_FOR_SGMS_AVGNO
  <dir>   8/07/14 10:35  D_SHEEP_GT2YRS_AVG_NO
  <dir>   8/01/14 14:15  D_SHEEP_LIVESTOCK_UNITS
  <dir>   8/01/14 14:15  D_SHEEP_LU_BOARDING_IN_NO
  <dir>   8/01/14 14:15  D_SHEEP_LU_BOARDING_OUT_NO
  <dir>   9/16/14 17:40  D_SHEEP_SALES_EU  
  <dir>   8/01/14 14:15  D_SIL_ADJUSTED_HA 
  <dir>   8/01/14 14:15  D_SIL_FERTILISER_COST_EU
  <dir>   9/16/14 17:39  D_SIL_SALES_CU_EU 
  <dir>   9/16/14 17:39  D_SIL_SALES_OP_EU 
  <dir>   8/01/14 14:15  D_SIL_TOTAL_DIRECT_COST_EU
  <dir>   6/29/14 19:43  D_SIZE_OF_FARM_ADJUSTED_HA
  <dir>   8/07/14 10:35  D_SOWS_AVG_NO     
  <dir>   9/16/14 17:40  D_SO_GROSS_OUTPUT_OP_INV_EU
  <dir>   8/01/14 14:13  D_STANDARD_MAN_DAYS
  <dir>   8/07/14 10:35  D_STOCK_BOARS_AVG_NO
  <dir>   9/16/14 17:40  D_SUBSIDIES_EU    
  <dir>   9/16/14 17:40  D_SW_GROSS_OUTPUT_OP_INV_EU
  <dir>   8/07/14 10:35  D_TABLE_FOWL_AVG_NO
  <dir>   8/07/14 12:10  D_TOTALGT2YRS_FOR_SGMS_AVGNO
  <dir>   8/01/14 14:13  D_TOTAL_CASUAL_LABOUR_EU
  <dir>   8/07/14 12:11  D_TOTAL_CATTLE_1_2YRS_AVG_NO
  <dir>   9/16/14 17:40  D_TOTAL_CROPS_GROSS_OUTPUT_EU
  <dir>   9/16/14 17:39  D_TOTAL_DIRECT_COST_EU
  <dir>   8/01/14 14:15  D_TOTAL_HA_EQUIV_COMMONAGE_HA
  <dir>   9/16/14 17:40  D_TOTAL_LIVESTOCK_GROSS_OUTPUT
  <dir>   8/01/14 14:15  D_TOTAL_LIVESTOCK_UNITS
  <dir>   9/16/14 17:40  D_TOTAL_MILK_PRODUCTION_EU
  <dir>   8/01/14 14:13  D_TOTAL_MILK_PRODUCTION_LT
  <dir>   8/01/14 14:15  D_TOTAL_PASTURE_HA
  <dir>   8/07/14 10:35  D_TOTAL_SHEEP_AVG_NO
  <dir>   9/16/14 17:40  D_TRANSFER_FROM_DAIRY_HERD_EU
  <dir>   6/29/14 17:24  D_VALUE_OF_FAMILY_LABOUR_EU
  <dir>   9/16/14 17:40  D_VAL_CHANGE_IN_NUMBERS_PIGS_EU
  <dir>   9/16/14 17:40  D_VAL_CHANGE_IN_NUMBERS_SHP_EU
  <dir>   9/16/14 17:40  D_VAL_CHANGE_OF_NUMBERS_CTTL_EUR
  <dir>   9/16/14 17:40  D_WB_GROSS_OUTPUT_OP_INV_EU
  <dir>   8/18/14 18:25  D_WEANERS_AVG_NO  
  <dir>   9/16/14 17:40  D_WO_GROSS_OUTPUT_OP_INV_EU
  <dir>   9/16/14 17:40  D_WW_GROSS_OUTPUT_OP_INV_EU
  <dir>   8/01/14 14:15  D_YIELD_ADJUSTED_HAY_HA
  <dir>   8/01/14 14:15  D_YIELD_ADJUSTED_SILAGE_HA
   1.1k   7/07/14 11:59  findEmptyColumns.do
  <dir>   6/24/14 19:29  I_ARABLE_SILAGE_FED_UNIT_COST
  <dir>   6/24/14 19:29  I_CATTLE_LU_HOME_GRAZING
  <dir>   6/24/14 19:29  I_CONCENTRATES_FED_DAIRY
  <dir>   6/24/14 19:29  I_DAIRY_LU_HOME_GRAZING
  <dir>   6/24/14 19:29  I_FODDER_BEET_FED_UNIT_COST
  <dir>   6/24/14 19:29  I_HAY_FED_UNIT_COST
  <dir>   6/24/14 19:29  I_HAY_OP_VAL_EU   
  <dir>   6/24/14 19:29  I_HAY_SALES_OP_QTY
  <dir>   6/24/14 19:29  I_HORSES_LU_HOME_GRAZING
  <dir>   6/24/14 19:29  I_KALE_FED_UNIT_COST
  <dir>   6/24/14 19:29  I_LU_OF_DEER      
  <dir>   6/24/14 19:29  I_LU_OF_EWE       
  <dir>   6/24/14 19:29  I_LU_OF_LAMBS_AFTER
  <dir>   6/24/14 19:29  I_LU_OF_RAM       
  <dir>   6/24/14 19:29  I_LU_OF_SHEEP_GT1YR
  <dir>   6/24/14 19:29  I_MAIZE_SILAGE_FED_UNIT_COST
  <dir>   6/24/14 19:29  I_MANGOLDS_FED_UNIT_COST
  <dir>   6/24/14 19:29  I_OAT_IN_SHEAF_FED_UNIT_COST
  <dir>   6/24/14 19:29  I_OP_INV_VAL_EU   
  <dir>   6/24/14 19:29  I_RAPE_SEED_FED_UNIT_COST
  <dir>   6/24/14 19:29  I_SHEEP_LU_HOME_GRAZING
  <dir>   6/24/14 19:29  I_SILAGE_FED_UNIT_COST
  <dir>   6/24/14 19:29  I_SIL_OP_VAL_EU   
  <dir>   6/24/14 19:29  I_STRAW_FED_UNIT_COST
  <dir>   6/24/14 19:29  I_SUGAR_BEET_FED_UNIT_COST
  <dir>   6/24/14 19:29  I_SUGAR_FED_UNIT_COST
  <dir>   6/24/14 19:29  I_TOTAL_HOME_GROWN_SEED_EU
  <dir>   6/24/14 19:29  I_TOTAL_LU_HOME_GRAZING
   4.8k   7/07/14 12:03  notes.do          
  16.7k   6/22/14 14:42  renameIB2SAS.do   
  16.7k   6/24/14 17:25  renameSAS2IB.do   
   6.0k   9/15/14 10:54  Sheet2Tables.do   
   1.3k   9/14/14 17:45  specialcases.do   
   0.7k   9/14/14 18:47  specialcasesLennon.do
  <dir>   6/24/14 19:29  UAA_SIZE          
   0.9k   9/02/14 11:25  wide2long.do      
  <dir>   6/25/14 18:08  _convertSheet     
  <dir>   8/27/14 16:49  _createWeights    
  <dir>   9/15/14 11:35  _renameSheet      
  <dir>   8/07/14 10:35  _TEMPLATES        
  <dir>   8/25/14 14:12  _value_labels     

. dir ../../../OutData/
  <dir>   8/21/14 13:50  .                 
  <dir>   8/21/14 13:50  ..                
   6.3k  12/07/12 17:03   graphtest        
 202.9M   8/24/12 15:49  .dta              
   0.0k   7/26/13 16:02  .Rhistory         
  12.0k   8/20/12 17:59  2007wt.dta        
  11.5k   8/20/12 18:01  2008wt.dta        
  10.8k   8/20/12 18:01  2009wt.dta        
  49.7M   7/12/11 16:05  8409v0.dta        
3065.3k   7/30/12  9:53  9609v2.csv        
   0.1k  12/07/12 16:53  draft_nidy.txt    
  85.0k   7/04/13 17:31  farm20436NFS.csv  
  <dir>   9/02/14 16:20  FarmPriceVolMSM   
   6.1k  12/07/12 17:14  graphtest         
   6.1k  12/14/12 12:31  graphtest.png     
  <dir>   9/16/14 17:47  MakeWeights       
  32.7k   8/12/08 16:36  marginanalysis.log
 229.2M   8/20/12 17:57  nfs_209der.dta    
 222.5M   6/21/14 11:43  nfs_7983.dta      
 373.6k   6/21/14 11:43  nfs_7983varlist.csv
 217.9M   8/20/12 17:54  nfs_9510.dta      
 202.9M   8/23/12 20:24  nfs_d210.dta      
 163.8M   8/20/12 17:58  nfs_data.dta      
  19.3M  12/06/12 13:09  nfs_data.R        
   0.0k  12/14/12 11:48  nfs_fadn.Rlog     
  <dir>   1/22/14 11:46  ProductivityAnalysis
  <dir>   8/14/14 16:56  Quota             
  <dir>   9/16/14 17:48  RAW_79_83         
  <dir>   3/22/14 21:39  REDP_Book         
 225.4M   8/11/14 11:55  tempSGM.dta       
   0.5k  12/07/12 13:48  test              
   6.0k  12/07/12 17:14  testlog.txt       
  <dir>   8/17/14 20:13  _Colleagues_Projects
  <dir>   4/14/14 11:10  _Projects_Archive 

. dir ../../../OutData/FarmPriceVolMSM/
  <dir>   9/02/14 16:20  .                 
  <dir>   9/02/14 16:20  ..                
  <dir>   8/27/14 12:40  1                 
  <dir>   8/17/14 20:47  3                 
2379.6k   8/18/14 13:41  bulkfeed_fed_livestock_eu_1.dta
3355.6k   8/18/14 13:41  bulkfeed_fed_livestock_eu_2.dta
8293.0k   8/18/14 13:41  bulkfeed_fed_livestock_eu_3.dta
1443.5k   8/18/14 13:45  car_electricity_telephone.dta
4709.0k   8/18/14 13:40  cattle_dairy_boarding_com.dta
  25.9M   8/18/14 13:36  crops_go_and_expnses_vars_count.dta
 289.6k   8/18/14 13:47  crops_total_dc.dta
 939.7k   8/18/14 13:57  curr_misc_cash_crops_go.dta
4470.3k   8/18/14 13:56  deer_goats_misc_dc_eu.dta
 339.4k   8/18/14 13:45  depreciation_of_buildings.dta
 339.4k   8/18/14 13:45  depreciation_of_land_imps.dta
 452.4k   8/18/14 13:45  depreciation_of_machinery.dta
  21.3M   8/18/14 13:51  d_cattle_total_direct_costs.dta
  17.4M   8/18/14 13:51  d_cattle_winter_forage_eu.dta
 723.0k   8/18/14 13:50  d_conc_fed_cattle_eu.dta
 723.0k   8/18/14 13:49  d_conc_fed_dairy_eu.dta
 723.0k   8/18/14 13:52  d_conc_fed_sheep_eu.dta
1946.5k   8/18/14 13:58  d_dairy_gross_output.dta
1675.0k   8/18/14 13:49  d_dairy_pasture_eu.dta
3533.2k   8/18/14 13:50  d_dairy_prod_misc_dc_eu.dta
  22.8M   8/18/14 13:50  d_dairy_total_direct_costs.dta
  17.2M   8/18/14 13:50  d_dairy_winter_forage_eu.dta
  18.7M   8/18/14 13:56  d_deer_goats_winter_forage_eu.dta
 794.1k   8/18/14 13:55  d_deer_pasture_eu.dta
1658.2k   8/18/14 13:58  d_gross_output_cattle.dta
1067.3k   8/18/14 13:58  d_gross_output_horses.dta
  10.8M   8/18/14 13:58  d_gross_output_pigs_eu.dta
2515.7k   8/18/14 13:58  d_gross_output_sheep_and_wool_eu.dta
  19.6M   8/18/14 13:56  d_horses_direct_costs.dta
1092.7k   8/18/14 13:54  d_horse_pasture_eu.dta
  16.9M   8/18/14 13:56  d_horse_winter_forage_eu.dta
 939.9k   8/18/14 13:56  d_inter_enterpise_trans_eu.dta
1730.9k   8/18/14 13:51  d_livestock_misc_dc_eu.dta
 793.8k   8/18/14 13:51  d_milk_and_milk_subs_no.dta
  23.7M   8/18/14 13:56  d_other_direct_costs.dta
2787.6k   8/18/14 13:58  d_other_gross_output.dta
2167.4k   8/18/14 13:53  d_pigs_total_dc_eu.dta
2485.8k   8/18/14 13:58  d_poultry_gross_output_eu.dta
1878.5k   8/18/14 13:54  d_poultry_total_dc_eu.dta
1301.3k   8/18/14 13:52  d_roots_direct_costs_eu.dta
1730.9k   8/18/14 13:53  d_sheep_misc_dc_eu.dta
1092.7k   8/18/14 13:52  d_sheep_pasture_eu.dta
  21.2M   8/18/14 13:53  d_sheep_total_direct_costs.dta
  16.7M   8/18/14 13:53  d_sheep_winter_forage_eu.dta
1384.3k   8/18/14 13:56  d_total_livestock_direct_costs.dta
1383.3k   8/18/14 13:58  d_total_livestock_gross_output.dta
1092.7k   8/18/14 13:50  d_total_pasture_eu.dta
 150.5M   8/18/14 13:46  farm_boardingi_fod_dc_0.dta
 937.3k   8/18/14 13:46  farm_boardingi_fod_dc_1.dta
2457.6k   8/18/14 13:51  fed_cattle_tonnes_ha.dta
2168.6k   8/18/14 13:50  fed_dairy_tonnes_ha.dta
1879.5k   8/18/14 13:55  fed_deer_tonnes_ha.dta
1879.5k   8/18/14 13:56  fed_goats_tonnes_ha.dta
1879.5k   8/18/14 13:54  fed_horses_tonnes_ha.dta
1735.0k   8/18/14 13:53  fed_sheep_tonnes_ha.dta
2695.3k   8/18/14 13:46  FodderCrops_DC.dta
2112.6k   8/18/14 13:46  FodderCrops_DC_1.dta
3276.6k   8/18/14 13:58  FodderCrops_GO.dta
 432.4k   9/02/14 16:20  hay_ha.dta        
 432.4k   9/02/14 16:20  hay_silage_ha.dta 
1735.0k   8/18/14 13:36  hay_sil_fed_unit_cost.dta
  53.8M   8/18/14 13:45  hired_labour_casual_excl.dta
1897.9k   8/18/14 13:37  horses_boarding_in_out_com.dta
1586.6k   8/18/14 13:54  horses_misc_dc_eu.dta
 332.6k   8/18/14 13:45  interest_payments.dta
  <dir>   8/18/14 13:44  Logs              
2886.2k   8/18/14 13:45  machinery_op_expenses.dta
 123.8M   8/18/14 13:28  merged_crop_tables.dta
 122.1M   8/18/14 13:28  merged_crop_tables_0.dta
 174.0M   8/18/14 13:31  merged_crop_tables_1.dta
 254.3M   8/18/14 13:32  merged_crop_tables_2.dta
 540.6M   8/18/14 13:36  merged_crop_tables_3.dta
2454.6k   8/18/14 13:45  misc_overhead_costs.dta
 289.6k   8/18/14 13:58  origsubset.dta    
 289.6k   8/18/14 13:47  other_cashcrops_ind_dc.dta
 289.6k   8/18/14 13:49  oth_csh_crop_ind_dc.dta
  46.5k   8/18/14 13:45  paid_labour.dta   
 434.1k   9/02/14 16:20  pasture_ha.dta    
1296.8k   9/02/14 16:20  pasture_hay_silage_ha.dta
2161.1k   9/02/14 16:20  pasture_hay_silage_ha_0.dta
1051.6k   8/18/14 13:45  power_machinery_totals.dta
  <dir>   8/17/14 20:22  sc_simulation     
 289.6k   8/18/14 13:48  select_crops_dc.dta
 289.6k   8/18/14 13:48  setaside_dc.dta   
3584.4k   8/18/14 13:38  sheep_boarding_in_out_com.dta
 432.4k   9/02/14 16:20  silage_ha.dta     
 289.6k   8/18/14 13:41  sum_grazing_total_dc_eu.dta
 289.6k   8/18/14 13:50  sum_i_conc_fed_cattle.dta
 289.6k   8/18/14 13:49  sum_i_conc_fed_dairy.dta
 289.6k   8/18/14 13:54  sum_i_conc_fed_horses.dta
 289.6k   8/18/14 13:53  sum_i_conc_fed_pigs.dta
 289.6k   8/18/14 13:54  sum_i_conc_fed_poultry.dta
 289.6k   8/18/14 13:52  sum_i_conc_fed_sheep.dta
  59.1M   8/18/14 13:38  svy_cattle_0.dta  
  90.5M   8/18/14 13:40  svy_cattle_1.dta  
  96.8M   8/18/14 13:40  svy_cattle_2.dta  
 107.2M   8/18/14 13:28  svy_crops_1.dta   
  21.4M   9/02/14 16:20  svy_crops_casual_labour_1.dta
 867.7k   8/18/14 13:46  svy_crops_fodder_dc.dta
 434.1k   8/18/14 13:57  svy_crops_fodder_go.dta
  43.2M   8/18/14 13:28  svy_crop_disposal_1.dta
  20.3M   9/02/14 16:20  svy_crop_expenses_1.dta
3980.0k   9/02/14 16:20  svy_crop_fertilizer_1.dta
6475.1k   9/02/14 16:20  svy_crop_fertilizer_2.dta
  29.8M   8/18/14 13:44  svy_dairy_produce_1.dta
  33.3M   8/18/14 13:45  svy_dairy_produce_2.dta
  15.5M   8/18/14 13:40  svy_deer_1.dta    
  22.3M   8/18/14 13:40  svy_grazing_1.dta 
  22.5M   8/18/14 13:41  svy_grazing_2.dta 
 510.2k   8/18/14 13:46  svy_grazing_fodder_dc.dta
1965.8k   8/18/14 13:57  svy_grazing_fodder_go.dta
  27.9M   8/18/14 13:36  svy_hay_silage_0.dta
  34.4M   8/18/14 13:36  svy_hay_silage_1.dta
 364.6k   8/18/14 13:46  svy_hay_silage_fodder_dc.dta
 723.2k   8/18/14 13:57  svy_hay_silage_fodder_go.dta
  19.6M   8/18/14 13:37  svy_horses_other_0.dta
  22.7M   8/18/14 13:37  svy_horses_other_1.dta
  23.5M   8/18/14 13:41  svy_livestock_expenses_1.dta
  67.2M   8/18/14 13:44  svy_livestock_expenses_2.dta
 289.6k   8/18/14 13:47  svy_misc_cash_crops_dc.dta
5782.0k   8/18/14 13:58  svy_misc_cash_crops_go.dta
  10.7M   8/18/14 13:45  svy_pigs_1.dta    
  19.0M   8/18/14 13:45  svy_poultry_1.dta 
  33.4M   8/18/14 13:37  svy_sheep_0.dta   
  39.0M   8/18/14 13:37  svy_sheep_0pc.dta 
  49.1M   8/18/14 13:38  svy_sheep_1.dta   
  53.7M   8/18/14 13:38  svy_sheep_2.dta   
  36.9M   8/18/14 13:45  svy_subsidies_grants_1.dta
1384.3k   8/18/14 13:49  total_crops_direct_costs.dta
9831.6k   8/18/14 13:58  total_crops_gross_output.dta
1089.9k   8/18/14 13:40  total_lu_home_grazing.dta
1590.4k   8/18/14 13:41  wint_forg_fed_unit_cost.dta

. use ../../../OrigData/FarmPriceVolMSM/
no; data in memory would be lost
r(4);

. dir ../../../OrigData/FarmPriceVolMSM/
  <dir>   8/18/14 17:29  .                 
  <dir>   8/18/14 17:29  ..                
5946.6k   6/12/14 10:33  crops_go_and_expnses_vars_count.dta
5946.6k   6/12/14 10:33  d_concuse.dta     
 434.0k   6/12/14 10:33  enter_exit_nfs.dta
   1.1k   8/18/14 17:29  FarmPriceVolMSM - Shortcut.lnk
1897.9k   6/13/14 15:27  horses_boarding_in_out_com.dta
5016.5k   5/18/11 17:13  RecBook2011_Final_NewSub.xls
  19.3M   8/25/11 10:13  subsidies and grants_all_text.csv
 434.0k   6/12/14 10:33  subsidies_and_grants_all_brian.dta
  97.7M   6/12/14 10:33  svy_asset.dta     
 821.4k   6/12/14 10:33  svy_buildings_totals.dta
3290.2k   6/12/14 10:33  svy_car_expenses.dta
  58.9M   6/12/14 10:33  svy_cattle.dta    
  21.1M   6/12/14 10:33  svy_crops.dta     
  21.1M   6/12/14 10:35  svy_crops_1.dta   
 108.2k   6/12/14 10:33  svy_crops_casual_labour.dta
 108.2k   6/12/14 10:35  svy_crops_casual_labour_1.dta
  34.7M   6/12/14 10:33  svy_crop_derived.dta
8229.9k   6/12/14 10:33  svy_crop_disposal.dta
8229.9k   6/12/14 10:34  svy_crop_disposal_1.dta
  12.3M   6/12/14 10:33  svy_crop_expenses.dta
  12.3M   6/12/14 10:34  svy_crop_expenses_1.dta
  12.1M   6/12/14 10:33  svy_crop_fertilizer.dta
3980.0k   6/29/14 15:41  svy_crop_fertilizer_1.dta
  29.2M   6/12/14 10:33  svy_dairy_produce.dta
  27.1M   6/12/14 10:33  svy_dairy_produce_REPORTING.dta
2513.3k   6/12/14 10:33  svy_dairy_produce_XTRA.dta
  15.0M   6/12/14 10:33  svy_deer.dta      
  53.4M   6/12/14 10:33  svy_farm.dta      
6761.8k   6/12/14 10:33  svy_fertilizer_lime_other.dta
  20.8M   6/12/14 10:33  svy_grazing.dta   
5619.9k   6/12/14 10:33  svy_grazing_REPORTING.dta
  25.1M   6/12/14 10:33  svy_hay_silage.dta
  19.5M   6/12/14 10:33  svy_horses_other.dta
5392.8k   6/12/14 10:33  svy_horses_other_REPORTING.dta
 298.8k   6/12/14 10:33  svy_land_improvements_totals.dta
  23.5M   6/12/14 10:33  svy_livestock_expenses.dta
  46.8M   6/12/14 10:33  svy_livestock_expenses_1.dta
 433.2k   6/12/14 10:33  svy_livestock_expenses_count.dta
  46.8M   6/12/14 10:33  svy_livestock_expenses_TEST.dta
  20.9M   6/12/14 10:33  svy_loans.dta     
9074.3k   6/12/14 10:33  svy_milk_rw.dta   
  10.3M   6/12/14 10:33  svy_misc_receipts_expenses.dta
1051.3k   6/12/14 10:33  svy_other_machinery_totals.dta
 610.7k   6/12/14 10:33  svy_other_machinery_totals_REPORTING.dta
 702.3k   6/12/14 10:33  svy_paid_casual_labour.dta
 482.6k   6/12/14 10:33  svy_paid_labour.dta
  10.4M   6/12/14 10:33  svy_pigs.dta      
   9.8M   6/12/14 10:33  svy_pigs_REPORTING.dta
 790.1k   6/12/14 10:33  svy_pigs_XTRA.dta 
  18.5M   6/12/14 10:33  svy_poultry.dta   
4401.7k   6/12/14 10:33  svy_poultry_REPORTING.dta
 783.6k   6/12/14 10:33  svy_power_machinery_totals.dta
 455.2k   6/12/14 10:33  svy_power_machinery_totals_REPORTING.dta
5387.0k   6/12/14 10:33  svy_purchased_bulkyfeed.dta
  32.7M   6/12/14 10:33  svy_sheep.dta     
8259.4k   6/12/14 10:34  svy_std_man_days.dta
  36.2M   6/12/14 10:34  svy_subsidies_grants.dta
  35.8M   6/12/14 10:34  svy_subsidies_grants_REPORTING.dta
 590.7k   6/12/14 10:34  svy_subsidies_grants_XTRA.dta
5857.2k   6/12/14 10:34  svy_unpaid_labour.dta
 583.3k   6/12/14 10:34  svy_weights.dta   
 744.0k   6/12/14 10:34  svy_weights_reg.dta

. dir ../../../OrigData/FarmPriceVolMSM/svy_weights, clear
option clear not allowed
r(198);

. use ../../../OrigData/FarmPriceVolMSM/svy_weights, clear-
option clear- not allowed
r(198);

. use ../../../OrigData/FarmPriceVolMSM/svy_weights, clear

. describe

Contains data from ../../../OrigData/FarmPriceVolMSM/svy_weights.dta
  obs:        20,548                          
 vars:             6                          12 Jun 2014 10:33
 size:       595,892                          
--------------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage  display     value
variable name   type   format      label      variable label
--------------------------------------------------------------------------------------------------------------------------------------------------------------------
YE_AR           int    %10.0g                 
FARM_CODE       int    %10.0g                 
REGION_CODE     byte   %10.0g                 
ESU_WEIGHT      double %10.0g                 
UAA_WEIGHT      double %10.0g                 
tso_weight      double %10.0g                 
--------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by:  FARM_CODE  YE_AR

. describe, detail

Contains data from ../../../OrigData/FarmPriceVolMSM/svy_weights.dta
  obs:        20,548                          
 vars:             6                          12 Jun 2014 10:33
width:            29                          
 size:       595,892                          
--------------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage  display     value
variable name   type   format      label      variable label
--------------------------------------------------------------------------------------------------------------------------------------------------------------------
YE_AR           int    %10.0g                 
FARM_CODE       int    %10.0g                 
REGION_CODE     byte   %10.0g                 
ESU_WEIGHT      double %10.0g                 
UAA_WEIGHT      double %10.0g                 
tso_weight      double %10.0g                 
--------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by:  FARM_CODE  YE_AR

. br

. tab UAA_WEIGHT, by(YE_AR)
option by() not allowed
r(198);

. tab UAA_WEIGHT

 UAA_WEIGHT |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         43        0.21        0.21
      6.625 |          8        0.04        0.25
    17.2857 |         21        0.10        0.35
    22.6977 |         43        0.21        0.56
    23.0769 |         13        0.06        0.62
       23.1 |         20        0.10        0.72
    23.4167 |         12        0.06        0.78
    23.4828 |         29        0.14        0.92
    24.0938 |         32        0.16        1.08
       24.6 |         20        0.10        1.17
    24.9487 |         39        0.19        1.36
       25.5 |         12        0.06        1.42
      25.88 |         25        0.12        1.54
    26.3235 |         34        0.17        1.71
    26.6154 |         26        0.13        1.83
    26.7895 |         19        0.09        1.93
    27.3409 |         44        0.21        2.14
       27.5 |          4        0.02        2.16
         28 |          3        0.01        2.18
    28.1429 |         28        0.14        2.31
       28.4 |         35        0.17        2.48
    28.4375 |         32        0.16        2.64
    28.7059 |         17        0.08        2.72
         29 |          2        0.01        2.73
    29.2143 |         14        0.07        2.80
    29.9412 |         17        0.08        2.88
    30.2121 |         33        0.16        3.04
      30.75 |         16        0.08        3.12
    30.7778 |          9        0.04        3.16
    30.8955 |        134        0.65        3.82
     30.913 |         23        0.11        3.93
     31.375 |         16        0.08        4.01
     31.434 |         53        0.26        4.26
    31.7667 |         30        0.15        4.41
    32.3571 |         14        0.07        4.48
    32.4403 |        134        0.65        5.13
    32.4783 |         23        0.11        5.24
       32.6 |         15        0.07        5.31
    32.6667 |         15        0.07        5.39
    32.7188 |         32        0.16        5.54
    32.9565 |         23        0.11        5.66
         33 |         31        0.15        5.81
    33.2727 |         22        0.11        5.91
    34.1855 |        124        0.60        6.52
      34.25 |         28        0.14        6.65
    34.6822 |        129        0.63        7.28
      35.38 |         50        0.24        7.52
       35.5 |         18        0.09        7.61
    35.6741 |        135        0.66        8.27
    35.7037 |         27        0.13        8.40
       35.8 |         25        0.12        8.52
       36.9 |         20        0.10        8.62
    36.9231 |         13        0.06        8.68
      37.28 |         25        0.12        8.80
       37.5 |         30        0.15        8.95
    37.5462 |        130        0.63        9.58
    37.6105 |         95        0.46       10.04
      37.74 |         50        0.24       10.29
    37.8696 |         23        0.11       10.40
     37.871 |         31        0.15       10.55
    38.1176 |         34        0.17       10.72
    38.1364 |         22        0.11       10.82
    38.5391 |        128        0.62       11.45
    38.7339 |        124        0.60       12.05
    38.9583 |         24        0.12       12.17
    39.2273 |         22        0.11       12.27
    39.4545 |         44        0.21       12.49
    39.9545 |         22        0.11       12.59
         40 |         12        0.06       12.65
    40.0833 |         24        0.12       12.77
    40.2692 |         26        0.13       12.90
     40.575 |         40        0.19       13.09
    40.6522 |         23        0.11       13.20
    40.6829 |         41        0.20       13.40
    40.8083 |        120        0.58       13.99
       41.3 |         20        0.10       14.08
    41.7143 |         28        0.14       14.22
    41.7391 |         46        0.22       14.44
    41.8261 |         23        0.11       14.56
    41.8889 |         27        0.13       14.69
    41.9474 |         19        0.09       14.78
    41.9545 |         22        0.11       14.89
    42.5714 |          7        0.03       14.92
       42.6 |         20        0.10       15.02
      42.75 |          4        0.02       15.04
    43.6875 |         16        0.08       15.12
     43.885 |        112        0.55       15.66
       43.9 |         50        0.24       15.90
    44.5455 |         11        0.05       15.96
    44.6596 |         47        0.23       16.19
      44.75 |         20        0.10       16.28
    45.1875 |         48        0.23       16.52
    45.5532 |         94        0.46       16.97
    45.6087 |         23        0.11       17.09
    45.8077 |         78        0.38       17.47
    45.8229 |         96        0.47       17.93
    46.3169 |        142        0.69       18.62
    46.4444 |         36        0.18       18.80
    47.1842 |         38        0.18       18.98
       47.3 |         20        0.10       19.08
    47.6389 |         36        0.18       19.26
    48.1124 |         89        0.43       19.69
    48.2857 |         21        0.10       19.79
    48.3379 |        145        0.71       20.50
      48.45 |         20        0.10       20.60
      48.75 |          4        0.02       20.62
    49.2381 |          1        0.00       20.62
    49.3684 |         19        0.09       20.71
       49.4 |         20        0.10       20.81
    49.4725 |         91        0.44       21.25
    49.9886 |         88        0.43       21.68
    50.0486 |        144        0.70       22.38
    50.0667 |         30        0.15       22.53
    50.3333 |          6        0.03       22.56
    50.5789 |         19        0.09       22.65
    50.5897 |         39        0.19       22.84
    50.6148 |        135        0.66       23.50
    50.6667 |          6        0.03       23.53
    50.8851 |         87        0.42       23.95
    51.1069 |        131        0.64       24.59
    51.1413 |         92        0.45       25.03
    51.1563 |         32        0.16       25.19
    51.4762 |         42        0.20       25.39
       51.7 |         20        0.10       25.49
    51.8333 |         18        0.09       25.58
    52.2703 |         74        0.36       25.94
     52.595 |        121        0.59       26.53
    53.0682 |         44        0.21       26.74
    53.1111 |         90        0.44       27.18
    53.3226 |         31        0.15       27.33
    53.8222 |         44        0.21       27.55
    54.1111 |         18        0.09       27.63
    54.2692 |         26        0.13       27.76
    54.2941 |         17        0.08       27.84
    54.3158 |         19        0.09       27.93
    54.3409 |          1        0.00       27.94
    54.4478 |         67        0.33       28.27
    54.5714 |          1        0.00       28.27
    54.6752 |        117        0.57       28.84
    54.7213 |        121        0.59       29.43
    54.9178 |         73        0.36       29.78
    55.6047 |         43        0.21       29.99
     56.037 |         27        0.13       30.12
     56.058 |         69        0.34       30.46
    56.1765 |         34        0.17       30.63
    56.2222 |         18        0.09       30.71
       56.5 |          2        0.01       30.72
    56.6765 |         68        0.33       31.05
    56.7619 |         21        0.10       31.16
    56.8784 |         74        0.36       31.52
         57 |          3        0.01       31.53
    57.0526 |         38        0.18       31.72
    57.1333 |         15        0.07       31.79
    57.4576 |        118        0.57       32.36
     57.463 |         54        0.26       32.63
    57.6667 |          1        0.00       32.63
    57.7073 |         41        0.20       32.83
      57.92 |         75        0.36       33.20
    59.2941 |         17        0.08       33.28
    59.7037 |         27        0.13       33.41
    59.7963 |        108        0.53       33.94
    60.1429 |         28        0.14       34.07
    60.1731 |         52        0.25       34.32
    60.1818 |         11        0.05       34.38
    60.5789 |         38        0.18       34.56
      60.75 |         32        0.16       34.72
    61.0109 |         92        0.45       35.17
    61.0625 |         48        0.23       35.40
    61.0763 |        118        0.57       35.97
    61.1739 |         23        0.11       36.09
    61.6286 |         70        0.34       36.43
     61.925 |         40        0.19       36.62
         62 |         21        0.10       36.72
    62.1905 |         63        0.31       37.03
    62.3333 |         24        0.12       37.15
    62.8416 |        101        0.49       37.64
    63.1163 |         86        0.42       38.06
     63.125 |         40        0.19       38.25
    63.3556 |         90        0.44       38.69
     63.525 |         40        0.19       38.88
    63.5385 |         13        0.06       38.95
    64.1364 |         22        0.11       39.05
    64.6944 |         72        0.35       39.41
    64.8461 |         13        0.06       39.47
     64.871 |         62        0.30       39.77
    64.9783 |         46        0.22       39.99
         65 |          3        0.01       40.01
    65.0145 |         69        0.34       40.34
    65.0541 |         37        0.18       40.52
    65.5185 |         27        0.13       40.66
    65.7826 |         23        0.11       40.77
    65.8072 |         83        0.40       41.17
     66.125 |         16        0.08       41.25
    66.2143 |         70        0.34       41.59
      66.25 |         24        0.12       41.71
    66.4222 |         45        0.22       41.93
     66.625 |         24        0.12       42.04
    66.9286 |         14        0.07       42.11
    67.0943 |         53        0.26       42.37
    67.1351 |        222        1.08       43.45
    67.6571 |         35        0.17       43.62
    67.7083 |         48        0.23       43.85
     67.875 |          8        0.04       43.89
    67.8919 |         37        0.18       44.07
      68.08 |         25        0.12       44.19
    68.1852 |         54        0.26       44.46
    68.2083 |         24        0.12       44.57
    68.4627 |         67        0.33       44.90
    68.6438 |         73        0.36       45.26
    69.1304 |         23        0.11       45.37
    69.3958 |         48        0.23       45.60
    69.4625 |         80        0.39       45.99
    69.5972 |         72        0.35       46.34
    69.7778 |         45        0.22       46.56
     70.125 |         64        0.31       46.87
      70.25 |         12        0.06       46.93
      70.35 |         20        0.10       47.03
    71.2381 |         21        0.10       47.13
      71.44 |          2        0.01       47.14
    71.7619 |         42        0.20       47.34
    71.9762 |         42        0.20       47.55
     72.225 |         40        0.19       47.74
       72.3 |         30        0.15       47.89
    72.5122 |         80        0.39       48.28
      72.56 |         75        0.36       48.64
         73 |         27        0.13       48.77
    73.0455 |         22        0.11       48.88
    73.1129 |         62        0.30       49.18
    73.8095 |         21        0.10       49.28
    74.0964 |         83        0.40       49.69
    74.1111 |          9        0.04       49.73
    74.1892 |         37        0.18       49.91
    74.4091 |         22        0.11       50.02
    74.4167 |         48        0.23       50.25
    74.4348 |         23        0.11       50.36
    74.4382 |        177        0.86       51.23
    74.5333 |         30        0.15       51.37
       74.8 |         60        0.29       51.66
    75.2195 |          1        0.00       51.67
    75.2745 |        102        0.50       52.17
    75.3048 |        105        0.51       52.68
    75.3333 |         48        0.23       52.91
    75.5094 |         53        0.26       53.17
    76.1482 |         81        0.39       53.56
    76.3333 |         12        0.06       53.62
    76.9362 |         47        0.23       53.85
    76.9714 |         35        0.17       54.02
      77.25 |         60        0.29       54.31
    77.4545 |         33        0.16       54.47
    77.4643 |         28        0.14       54.61
    77.6191 |         84        0.41       55.02
    77.8485 |         33        0.16       55.18
    77.8919 |         37        0.18       55.36
    77.8941 |         84        0.41       55.77
    78.0811 |         37        0.18       55.95
    78.3125 |         16        0.08       56.02
    78.6445 |         45        0.22       56.24
    78.6667 |         27        0.13       56.38
         79 |          2        0.01       56.39
    79.1304 |         46        0.22       56.61
    79.3269 |         52        0.25       56.86
    79.8571 |         14        0.07       56.93
    79.9565 |         23        0.11       57.04
    80.3529 |         34        0.17       57.21
    80.5556 |         63        0.31       57.51
    81.1143 |         35        0.17       57.68
    81.2857 |         84        0.41       58.09
    81.3374 |         83        0.40       58.50
    81.4667 |         15        0.07       58.57
    81.8281 |         64        0.31       58.88
    82.4868 |         76        0.37       59.25
    82.6111 |         18        0.09       59.34
     82.625 |         48        0.23       59.57
    82.6842 |         19        0.09       59.67
    82.6944 |         36        0.18       59.84
    82.7297 |         74        0.36       60.20
    82.8286 |         35        0.17       60.37
    83.2703 |         37        0.18       60.55
      83.75 |          4        0.02       60.57
       83.8 |         10        0.05       60.62
    84.0556 |         18        0.09       60.71
    84.1364 |         22        0.11       60.81
    84.9677 |         31        0.15       60.96
    85.9706 |          1        0.00       60.97
     85.987 |          1        0.00       60.97
    86.1014 |         69        0.34       61.31
    86.3562 |          3        0.01       61.32
    86.9518 |         83        0.40       61.73
      87.15 |         20        0.10       61.83
      87.45 |         20        0.10       61.92
     87.875 |          8        0.04       61.96
    87.9041 |         73        0.36       62.32
    87.9524 |         21        0.10       62.42
    88.0769 |         13        0.06       62.48
    88.3333 |         21        0.10       62.59
    88.5758 |         33        0.16       62.75
     88.579 |         19        0.09       62.84
       88.7 |         40        0.19       63.03
         89 |         18        0.09       63.12
       89.4 |         25        0.12       63.24
    89.4026 |         77        0.37       63.62
    89.4722 |         36        0.18       63.79
    89.5476 |         42        0.20       64.00
       89.6 |         30        0.15       64.14
    90.5395 |         76        0.37       64.51
     90.875 |         32        0.16       64.67
    91.3623 |         69        0.34       65.00
    92.7059 |         68        0.33       65.33
    93.0182 |         55        0.27       65.60
    93.3333 |         39        0.19       65.79
    94.4091 |         22        0.11       65.90
    94.4839 |         31        0.15       66.05
       94.5 |          8        0.04       66.09
     96.475 |         40        0.19       66.28
         98 |          1        0.00       66.29
    98.6429 |         28        0.14       66.42
    99.1607 |        167        0.81       67.24
    100.125 |         16        0.08       67.32
   100.5179 |         56        0.27       67.59
     101.15 |         60        0.29       67.88
   101.3036 |         56        0.27       68.15
    101.439 |         41        0.20       68.35
   101.6111 |         18        0.09       68.44
   102.4324 |         74        0.36       68.80
   102.5172 |          2        0.01       68.81
   102.7183 |         71        0.35       69.16
   102.7679 |         56        0.27       69.43
   103.0339 |         59        0.29       69.71
   103.8333 |          6        0.03       69.74
      103.9 |         50        0.24       69.99
   104.3256 |         43        0.21       70.20
   104.5686 |         51        0.25       70.44
   104.7595 |         79        0.38       70.83
      105.1 |         80        0.39       71.22
   105.1176 |         51        0.25       71.47
      105.2 |         10        0.05       71.52
   106.0244 |         41        0.20       71.72
    106.375 |          8        0.04       71.75
     106.38 |         50        0.24       72.00
   106.5741 |         54        0.26       72.26
     106.66 |         50        0.24       72.50
   107.1929 |        140        0.68       73.18
     108.25 |         52        0.25       73.44
   108.2647 |         68        0.33       73.77
   108.2857 |          7        0.03       73.80
   109.1818 |         66        0.32       74.12
   109.5926 |         27        0.13       74.26
   110.2286 |         35        0.17       74.43
      110.8 |         10        0.05       74.47
    111.098 |         51        0.25       74.72
   111.1892 |         37        0.18       74.90
        112 |          9        0.04       74.95
   112.7778 |          9        0.04       74.99
   113.0526 |         38        0.18       75.18
   113.1515 |         33        0.16       75.34
      114.5 |          8        0.04       75.37
      115.8 |          5        0.02       75.40
   116.7115 |         52        0.25       75.65
   116.8518 |         27        0.13       75.78
   119.1731 |         51        0.25       76.03
   119.1833 |         60        0.29       76.32
   119.8261 |         23        0.11       76.44
   120.1667 |          6        0.03       76.46
    120.375 |          8        0.04       76.50
   121.3043 |         46        0.22       76.73
   121.3864 |         44        0.21       76.94
      122.3 |         30        0.15       77.09
   123.3871 |         31        0.15       77.24
        124 |         10        0.05       77.29
   124.8333 |          6        0.03       77.32
   125.2703 |         37        0.18       77.50
      125.6 |          5        0.02       77.52
   125.8571 |          7        0.03       77.55
   126.2222 |          9        0.04       77.60
   127.4444 |          9        0.04       77.64
        128 |         49        0.24       77.88
      128.5 |          2        0.01       77.89
   128.8571 |         21        0.10       77.99
        129 |          2        0.01       78.00
      129.9 |         20        0.10       78.10
     130.25 |         36        0.18       78.28
   130.4091 |         22        0.11       78.38
   130.6296 |         27        0.13       78.51
   133.8125 |         16        0.08       78.59
      134.5 |          2        0.01       78.60
   134.5319 |         47        0.23       78.83
        136 |          2        0.01       78.84
    136.625 |          8        0.04       78.88
   137.1739 |         23        0.11       78.99
   137.5349 |         43        0.21       79.20
   138.3846 |         13        0.06       79.26
      138.5 |          8        0.04       79.30
   139.6667 |          6        0.03       79.33
   139.9706 |         34        0.17       79.50
   141.3889 |         36        0.18       79.67
      141.4 |          5        0.02       79.70
   141.6837 |         98        0.48       80.17
   141.7037 |         27        0.13       80.30
   141.8095 |         21        0.10       80.41
   142.1429 |         14        0.07       80.47
   143.8889 |          9        0.04       80.52
        144 |          1        0.00       80.52
   144.1765 |         17        0.08       80.61
     144.75 |          4        0.02       80.63
        145 |          1        0.00       80.63
   145.8333 |         36        0.18       80.81
   148.1429 |          7        0.03       80.84
   148.2143 |         14        0.07       80.91
   150.4118 |         51        0.25       81.16
   150.5882 |         17        0.08       81.24
   151.4783 |         23        0.11       81.35
      151.5 |         72        0.35       81.70
      152.3 |         10        0.05       81.75
   152.5278 |         36        0.18       81.93
   152.8235 |         17        0.08       82.01
   153.1667 |         36        0.18       82.18
        154 |          1        0.00       82.19
   155.1429 |          7        0.03       82.22
   155.4286 |          7        0.03       82.26
   156.1429 |          7        0.03       82.29
      156.2 |         25        0.12       82.41
   156.7674 |         43        0.21       82.62
   158.9111 |         45        0.22       82.84
   159.1111 |         54        0.26       83.10
    159.175 |         40        0.19       83.30
     160.15 |         20        0.10       83.39
   160.9167 |         36        0.18       83.57
     161.75 |         16        0.08       83.65
   162.7049 |         61        0.30       83.94
        164 |          1        0.00       83.95
   164.1818 |         22        0.11       84.06
    164.375 |          8        0.04       84.10
   165.0952 |         21        0.10       84.20
   165.3125 |         16        0.08       84.28
   165.7143 |          7        0.03       84.31
   165.8333 |         54        0.26       84.57
   166.0192 |         51        0.25       84.82
      166.5 |          6        0.03       84.85
   166.5789 |         19        0.09       84.94
   166.6563 |         64        0.31       85.25
   167.8947 |         57        0.28       85.53
   168.0909 |         11        0.05       85.58
    168.525 |         40        0.19       85.78
   169.0889 |         90        0.44       86.22
   170.8421 |         38        0.18       86.40
   172.3333 |          3        0.01       86.42
   172.7143 |          7        0.03       86.45
   174.4286 |          7        0.03       86.49
    174.697 |         33        0.16       86.65
   175.6957 |         23        0.11       86.76
   176.4333 |         60        0.29       87.05
   177.3958 |         48        0.23       87.28
   178.1224 |         49        0.24       87.52
      178.2 |         45        0.22       87.74
   179.1429 |          7        0.03       87.77
      179.2 |         10        0.05       87.82
   179.3636 |         11        0.05       87.88
     180.45 |         40        0.19       88.07
     180.75 |          4        0.02       88.09
   181.7778 |         18        0.09       88.18
        182 |         32        0.16       88.33
   182.4211 |         19        0.09       88.43
   183.2292 |         48        0.23       88.66
   183.9483 |         58        0.28       88.94
        184 |         20        0.10       89.04
      184.8 |         45        0.22       89.26
   185.9524 |         21        0.10       89.36
   186.9412 |         17        0.08       89.44
   188.8333 |          6        0.03       89.47
   189.4444 |         18        0.09       89.56
      190.5 |          4        0.02       89.58
        191 |          2        0.01       89.59
      193.8 |          5        0.02       89.61
      195.5 |          2        0.01       89.62
     197.75 |          4        0.02       89.64
   200.0714 |         42        0.20       89.85
   200.4935 |         77        0.37       90.22
    201.625 |         56        0.27       90.50
   201.6545 |         55        0.27       90.76
   202.0526 |         19        0.09       90.86
   204.7727 |          1        0.00       90.86
   205.3513 |         37        0.18       91.04
   206.2222 |         36        0.18       91.22
      206.5 |          1        0.00       91.22
   207.1176 |         17        0.08       91.30
      207.8 |          5        0.02       91.33
   209.2603 |         73        0.36       91.68
   209.3333 |          3        0.01       91.70
   209.4583 |         24        0.12       91.81
   209.5349 |         43        0.21       92.02
   209.6035 |         58        0.28       92.31
     211.25 |         24        0.12       92.42
   211.3333 |          6        0.03       92.45
   212.8333 |          6        0.03       92.48
   213.2885 |         52        0.25       92.73
   213.6897 |          1        0.00       92.74
    214.381 |         21        0.10       92.84
   216.3182 |         22        0.11       92.95
   216.4706 |         17        0.08       93.03
   217.7347 |         49        0.24       93.27
        218 |          2        0.01       93.28
   220.4348 |         23        0.11       93.39
   220.5789 |         19        0.09       93.48
   221.2326 |         43        0.21       93.69
   221.5714 |          1        0.00       93.70
        222 |          2        0.01       93.71
   223.4706 |         34        0.17       93.87
   223.7369 |         19        0.09       93.97
        224 |          1        0.00       93.97
   226.4286 |          7        0.03       94.00
      226.5 |          2        0.01       94.01
   226.5833 |         12        0.06       94.07
    227.375 |          8        0.04       94.11
   227.4118 |         17        0.08       94.19
      231.4 |          1        0.00       94.20
   231.5217 |         23        0.11       94.31
   234.2174 |         23        0.11       94.42
     235.55 |         20        0.10       94.52
   237.3428 |         35        0.17       94.69
   239.4839 |         31        0.15       94.84
     239.75 |          4        0.02       94.86
   240.6905 |         42        0.20       95.07
        241 |          2        0.01       95.07
      241.4 |          5        0.02       95.10
        245 |          2        0.01       95.11
   248.5909 |         22        0.11       95.22
     251.35 |         20        0.10       95.31
      254.4 |          5        0.02       95.34
   255.1282 |         39        0.19       95.53
      255.4 |          5        0.02       95.55
   257.9047 |         21        0.10       95.65
        259 |          3        0.01       95.67
   260.9286 |         14        0.07       95.74
   264.1739 |         23        0.11       95.85
   264.3889 |         18        0.09       95.94
   266.3333 |          3        0.01       95.95
   267.1639 |         61        0.30       96.25
   269.4375 |         16        0.08       96.33
   271.3333 |         15        0.07       96.40
      271.5 |          4        0.02       96.42
      271.9 |         10        0.05       96.47
        282 |         11        0.05       96.52
    283.875 |         16        0.08       96.60
   284.0732 |         41        0.20       96.80
   288.7333 |         15        0.07       96.87
     289.25 |          4        0.02       96.89
      289.8 |          5        0.02       96.91
   295.1864 |         59        0.29       97.20
   296.5122 |         41        0.20       97.40
   299.6667 |          3        0.01       97.42
      300.5 |          2        0.01       97.43
   301.8571 |          7        0.03       97.46
   302.3333 |          3        0.01       97.47
   304.2758 |         29        0.14       97.62
   304.2778 |         17        0.08       97.70
   305.7222 |         18        0.09       97.79
   307.6667 |          3        0.01       97.80
      311.4 |          5        0.02       97.82
   311.4615 |         26        0.13       97.95
     312.75 |         16        0.08       98.03
   320.3333 |          3        0.01       98.04
      320.8 |          5        0.02       98.07
   325.3333 |          3        0.01       98.08
      325.8 |          5        0.02       98.11
     327.75 |          4        0.02       98.13
   334.8571 |         14        0.07       98.19
        341 |          2        0.01       98.20
        345 |          1        0.00       98.21
        353 |          3        0.01       98.22
   355.1538 |         13        0.06       98.29
   356.1429 |         13        0.06       98.35
   360.1429 |         14        0.07       98.42
        362 |          3        0.01       98.43
      362.5 |          2        0.01       98.44
   364.0833 |         12        0.06       98.50
      365.3 |         10        0.05       98.55
        368 |          6        0.03       98.58
   375.7097 |         31        0.15       98.73
   379.3333 |          3        0.01       98.74
      394.5 |          4        0.02       98.76
        402 |          4        0.02       98.78
        421 |         11        0.05       98.84
      422.6 |          5        0.02       98.86
      427.9 |         10        0.05       98.91
        436 |          1        0.00       98.91
   440.1765 |         17        0.08       99.00
   443.4286 |          7        0.03       99.03
      454.9 |         10        0.05       99.08
     458.25 |          4        0.02       99.10
      458.5 |          6        0.03       99.13
        462 |          1        0.00       99.13
   463.6667 |          3        0.01       99.15
   469.1429 |         14        0.07       99.22
   469.3077 |         13        0.06       99.28
      474.1 |         10        0.05       99.33
      499.2 |          5        0.02       99.35
        506 |          2        0.01       99.36
      517.5 |          2        0.01       99.37
        520 |          1        0.00       99.38
   523.1667 |          5        0.02       99.40
        529 |          2        0.01       99.41
        535 |          4        0.02       99.43
        544 |          1        0.00       99.44
   545.7143 |          7        0.03       99.47
    575.125 |          8        0.04       99.51
        577 |          2        0.01       99.52
        598 |          1        0.00       99.52
     606.75 |          4        0.02       99.54
      610.1 |         10        0.05       99.59
     628.25 |          4        0.02       99.61
   633.1111 |          9        0.04       99.65
     633.75 |          4        0.02       99.67
        665 |          1        0.00       99.68
      668.2 |          5        0.02       99.70
        684 |          1        0.00       99.71
    684.625 |          1        0.00       99.71
     687.75 |          4        0.02       99.73
     712.25 |          8        0.04       99.77
        714 |          1        0.00       99.78
   736.6667 |          3        0.01       99.79
        753 |          1        0.00       99.80
        786 |          1        0.00       99.80
        830 |          1        0.00       99.81
        894 |          4        0.02       99.82
      952.5 |         14        0.07       99.89
        976 |          1        0.00       99.90
        981 |          1        0.00       99.90
       1005 |          1        0.00       99.91
     1126.5 |          2        0.01       99.92
    1148.75 |          4        0.02       99.94
     1256.5 |          2        0.01       99.95
   1265.667 |          3        0.01       99.96
     1354.5 |          2        0.01       99.97
   1371.333 |          3        0.01       99.99
       1385 |          2        0.01      100.00
       2945 |          1        0.00      100.00
------------+-----------------------------------
      Total |     20,548      100.00

. tab UAA_WEIGHT YE_AR

           |                                                                YE_AR
UAA_WEIGHT |      1995       1996       1997       1998       1999       2000       2001       2002       2003       2004       2005       2006 |     Total
-----------+------------------------------------------------------------------------------------------------------------------------------------+----------
         0 |         0          0          0          0          0          0          0          0          0         41          2          0 |        43 
     6.625 |         8          0          0          0          0          0          0          0          0          0          0          0 |         8 
   17.2857 |         0          0          0          0          0          0          0          0          0          0          0          0 |        21 
   22.6977 |         0          0          0          0          0          0          0          0         43          0          0          0 |        43 
   23.0769 |         0          0          0          0          0          0          0          0          0          0          0          0 |        13 
      23.1 |         0          0          0          0          0          0          0          0          0          0          0          0 |        20 
   23.4167 |         0          0          0          0          0          0          0          0          0          0          0         12 |        12 
   23.4828 |         0          0          0          0          0          0          0          0          0          0          0          0 |        29 
   24.0938 |         0          0          0          0          0          0          0          0          0          0          0         32 |        32 
      24.6 |         0          0          0          0          0          0          0          0          0          0          0         20 |        20 
   24.9487 |         0          0          0          0          0          0          0         39          0          0          0          0 |        39 
      25.5 |         0          0          0          0          0          0          0          0          0          0          0          0 |        12 
     25.88 |         0          0          0          0          0          0          0          0          0          0          0          0 |        25 
   26.3235 |         0          0          0          0          0         34          0          0          0          0          0          0 |        34 
   26.6154 |         0          0          0          0          0          0          0          0          0          0          0          0 |        26 
   26.7895 |        19          0          0          0          0          0          0          0          0          0          0          0 |        19 
   27.3409 |         0          0          0          0          0          0          0          0          0          0          0          0 |        44 
      27.5 |         0          0          0          0          0          0          0          0          0          0          0          0 |         4 
        28 |         0          2          0          0          0          0          0          0          0          0          0          0 |         3 
   28.1429 |        28          0          0          0          0          0          0          0          0          0          0          0 |        28 
      28.4 |         0          0          0          0          0          0          0          0          0         35          0          0 |        35 
   28.4375 |         0          0          0          0          0          0          0          0          0         32          0          0 |        32 
   28.7059 |         0          0          0          0          0          0          0          0          0          0          0          0 |        17 
        29 |         0          0          0          0          0          0          0          0          0          0          0          0 |         2 
   29.2143 |        14          0          0          0          0          0          0          0          0          0          0          0 |        14 
   29.9412 |         0          0          0          0          0          0         17          0          0          0          0          0 |        17 
   30.2121 |         0          0          0          0          0          0         33          0          0          0          0          0 |        33 
     30.75 |         0          0          0          0          0          0          0         16          0          0          0          0 |        16 
   30.7778 |         0          0          0          0          0          0          0          0          0          0          9          0 |         9 
   30.8955 |         0          0          0          0          0          0          0          0        134          0          0          0 |       134 
    30.913 |         0          0          0          0          0          0          0          0          0          0          0          0 |        23 
    31.375 |         0          0          0          0          0          0          0          0          0         16          0          0 |        16 
    31.434 |         0          0          0          0          0          0          0          0          0          0          0          0 |        53 
   31.7667 |         0          0          0          0          0          0          0          0         30          0          0          0 |        30 
   32.3571 |         0         14          0          0          0          0          0          0          0          0          0          0 |        14 
   32.4403 |         0          0          0          0          0          0        134          0          0          0          0          0 |       134 
   32.4783 |         0          0          0          0          0          0          0          0          0          0          0          0 |        23 
      32.6 |         0          0          0          0          0          0          0          0         15          0          0          0 |        15 
   32.6667 |         0          0         15          0          0          0          0          0          0          0          0          0 |        15 
   32.7188 |         0          0         32          0          0          0          0          0          0          0          0          0 |        32 
   32.9565 |        23          0          0          0          0          0          0          0          0          0          0          0 |        23 
        33 |         0          0          0          0          0          0          0          0          0          0         31          0 |        31 
   33.2727 |         0          0          0          0          0          0          0          0          0          0          0          0 |        22 
   34.1855 |         0          0          0          0          0          0          0        124          0          0          0          0 |       124 
     34.25 |         0          0          0          0          0          0          0         28          0          0          0          0 |        28 
   34.6822 |         0          0          0          0          0          0          0          0          0        129          0          0 |       129 
     35.38 |         0          0          0          0          0          0          0          0          0          0          0          0 |        50 
      35.5 |         0          0          0          0          0          0          0          0          0          0         18          0 |        18 
   35.6741 |         0          0          0          0          0          0          0          0          0          0          0          0 |       135 
   35.7037 |         0          0          0          0          0          0         27          0          0          0          0          0 |        27 
      35.8 |         0          0          0          0         25          0          0          0          0          0          0          0 |        25 
      36.9 |         0          0          0          0          0          0          0          0          0          0          0          0 |        20 
   36.9231 |         0          0          0          0          0         13          0          0          0          0          0          0 |        13 
     37.28 |        25          0          0          0          0          0          0          0          0          0          0          0 |        25 
      37.5 |         0          0          0          0          0          0          0          0          0          0          0          0 |        30 
   37.5462 |         0          0          0          0          0          0          0          0          0          0          0          0 |       130 
   37.6105 |         0          0          0          0          0         95          0          0          0          0          0          0 |        95 
     37.74 |         0          0          0          0          0          0          0          0          0          0          0          0 |        50 
   37.8696 |         0          0          0          0          0          0          0          0          0          0          0          0 |        23 
    37.871 |         0          0          0          0          0          0          0          0          0          0          0          0 |        31 
   38.1176 |         0          0          0          0          0          0          0          0          0          0          0          0 |        34 
   38.1364 |         0          0          0          0          0          0          0          0          0          0          0          0 |        22 
   38.5391 |         0          0          0          0          0          0          0          0          0          0          0        128 |       128 
   38.7339 |         0          0          0          0          0          0          0          0          0          0          0          0 |       124 
   38.9583 |         0          0          0          0          0         24          0          0          0          0          0          0 |        24 
   39.2273 |         0         22          0          0          0          0          0          0          0          0          0          0 |        22 
   39.4545 |         0          0          0          0          0          0          0          0          0          0          0          0 |        44 
   39.9545 |         0         22          0          0          0          0          0          0          0          0          0          0 |        22 
        40 |         0          0          0          0         12          0          0          0          0          0          0          0 |        12 
   40.0833 |         0          0         24          0          0          0          0          0          0          0          0          0 |        24 
   40.2692 |         0          0          0         26          0          0          0          0          0          0          0          0 |        26 
    40.575 |         0          0          0          0          0          0          0          0          0          0          0          0 |        40 
   40.6522 |         0          0          0          0         23          0          0          0          0          0          0          0 |        23 
   40.6829 |         0          0          0          0          0          0          0          0          0          0          0          0 |        41 
   40.8083 |         0          0          0          0          0          0          0          0          0          0        120          0 |       120 
      41.3 |         0          0         20          0          0          0          0          0          0          0          0          0 |        20 
   41.7143 |         0          0          0          0          0          0          0          0          0          0          0          0 |        28 
   41.7391 |         0          0          0          0          0          0          0          0          0          0          0          0 |        46 
   41.8261 |         0          0          0         23          0          0          0          0          0          0          0          0 |        23 
   41.8889 |         0          0          0          0          0          0          0          0          0          0          0          0 |        27 
   41.9474 |         0          0          0          0          0          0          0          0          0          0          0         19 |        19 
   41.9545 |         0          0          0          0          0          0          0          0          0          0          0          0 |        22 
   42.5714 |         0          0          0          0          0          0          0          0          0          7          0          0 |         7 
      42.6 |         0          0          0          0          0          0          0          0          0          0          0          0 |        20 
     42.75 |         0          0          0          0          0          4          0          0          0          0          0          0 |         4 
   43.6875 |         0          0          0          0          0          0          0          0          0          0          0          0 |        16 
    43.885 |         0          0          0          0          0          0          0          0          0          0          0          0 |       112 
      43.9 |        50          0          0          0          0          0          0          0          0          0          0          0 |        50 
   44.5455 |         0          0          0         11          0          0          0          0          0          0          0          0 |        11 
   44.6596 |         0          0          0          0          0          0          0          0          0          0          0          0 |        47 
     44.75 |         0          0          0          0          0          0          0          0          0          0          0          0 |        20 
   45.1875 |        48          0          0          0          0          0          0          0          0          0          0          0 |        48 
   45.5532 |         0          0          0          0         94          0          0          0          0          0          0          0 |        94 
   45.6087 |         0          0          0          0          0          0          0          0          0          0          0          0 |        23 
   45.8077 |         0          0          0          0         78          0          0          0          0          0          0          0 |        78 
   45.8229 |         0          0         96          0          0          0          0          0          0          0          0          0 |        96 
   46.3169 |         0          0          0          0          0          0          0          0        142          0          0          0 |       142 
   46.4444 |         0          0          0          0          0          0          0          0         36          0          0          0 |        36 
   47.1842 |         0          0          0          0          0          0          0          0          0         38          0          0 |        38 
      47.3 |         0          0          0          0          0          0          0          0          0          0          0          0 |        20 
   47.6389 |         0          0          0          0          0          0          0         36          0          0          0          0 |        36 
   48.1124 |         0          0          0          0          0         89          0          0          0          0          0          0 |        89 
   48.2857 |         0         21          0          0          0          0          0          0          0          0          0          0 |        21 
   48.3379 |         0          0          0          0          0          0        145          0          0          0          0          0 |       145 
     48.45 |         0          0          0          0          0          0         20          0          0          0          0          0 |        20 
     48.75 |         0          0          4          0          0          0          0          0          0          0          0          0 |         4 
   49.2381 |         0          0          0          0          0          0          0          0          0          0          1          0 |         1 
   49.3684 |         0          0          0          0          0          0          0          0          0          0          0          0 |        19 
      49.4 |         0          0          0          0          0          0          0          0          0         20          0          0 |        20 
   49.4725 |         0          0          0          0          0          0         91          0          0          0          0          0 |        91 
   49.9886 |         0          0          0         88          0          0          0          0          0          0          0          0 |        88 
   50.0486 |         0          0          0          0          0        144          0          0          0          0          0          0 |       144 
   50.0667 |        30          0          0          0          0          0          0          0          0          0          0          0 |        30 
   50.3333 |         0          0          0          0          0          0          0          0          6          0          0          0 |         6 
   50.5789 |         0          0          0          0          0          0          0          0          0          0          0          0 |        19 
   50.5897 |         0          0          0          0          0          0          0          0          0          0          0          0 |        39 
   50.6148 |         0          0          0          0          0          0          0        135          0          0          0          0 |       135 
   50.6667 |         0          0          0          0          0          0          0          6          0          0          0          0 |         6 
   50.8851 |         0          0          0          0          0          0          0         87          0          0          0          0 |        87 
   51.1069 |         0          0          0          0          0          0          0          0          0        131          0          0 |       131 
   51.1413 |         0          0          0          0          0          0          0          0          0          0          0          0 |        92 
   51.1563 |         0          0         32          0          0          0          0          0          0          0          0          0 |        32 
   51.4762 |         0          0          0          0          0          0          0          0          0          0          0          0 |        42 
      51.7 |         0          0          0          0          0          0          0          0          0          0         20          0 |        20 
   51.8333 |         0          0          0          0          0          0          0          0          0          0          0          0 |        18 
   52.2703 |         0          0          0         74          0          0          0          0          0          0          0          0 |        74 
    52.595 |         0          0          0          0          0          0          0          0          0          0          0          0 |       121 
   53.0682 |         0          0          0          0          0          0          0          0          0          0          0          0 |        44 
   53.1111 |         0          0          0          0          0          0          0          0          0          0          0          0 |        90 
   53.3226 |         0         31          0          0          0          0          0          0          0          0          0          0 |        31 
   53.8222 |         0          0          0          0          0          0          0          0          0          0          0          0 |        44 
   54.1111 |         0          0          0          0          0          0          0          0          0          0          0          0 |        18 
   54.2692 |         0          0          0          0          0         26          0          0          0          0          0          0 |        26 
   54.2941 |         0          0          0          0          0          0          0          0          0          0          0          0 |        17 
   54.3158 |         0          0          0          0          0          0          0          0          0          0          0          0 |        19 
   54.3409 |         0          0          0          0          0          0          0          0          0          0          1          0 |         1 
   54.4478 |         0          0          0          0          0          0          0          0          0          0         67          0 |        67 
   54.5714 |         0          0          0          0          0          0          0          0          0          0          1          0 |         1 
   54.6752 |         0          0          0          0          0          0          0          0          0          0          0          0 |       117 
   54.7213 |         0          0          0          0          0          0          0          0          0          0          0          0 |       121 
   54.9178 |         0          0          0          0          0          0          0          0          0         73          0          0 |        73 
   55.6047 |         0          0          0          0          0          0          0          0          0          0         43          0 |        43 
    56.037 |         0          0          0         27          0          0          0          0          0          0          0          0 |        27 
    56.058 |         0          0         69          0          0          0          0          0          0          0          0          0 |        69 
   56.1765 |         0          0          0          0          0          0          0          0          0          0         34          0 |        34 
   56.2222 |         0          0          0          0          0          0          0          0         18          0          0          0 |        18 
      56.5 |         0          0          0          0          0          0          0          0          0          0          2          0 |         2 
   56.6765 |         0          0          0          0          0          0          0          0          0          0          0          0 |        68 
   56.7619 |         0          0          0          0          0          0          0          0          0          0          0          0 |        21 
   56.8784 |        74          0          0          0          0          0          0          0          0          0          0          0 |        74 
        57 |         0          0          0          0          3          0          0          0          0          0          0          0 |         3 
   57.0526 |         0          0          0          0          0          0          0          0          0          0          0         38 |        38 
   57.1333 |         0          0          0          0          0          0          0          0          0          0          0          0 |        15 
   57.4576 |         0          0          0          0          0          0          0          0          0          0        118          0 |       118 
    57.463 |         0          0          0          0          0          0          0          0          0          0          0         54 |        54 
   57.6667 |         0          0          0          0          0          0          0          0          0          0          0          0 |         1 
   57.7073 |         0         41          0          0          0          0          0          0          0          0          0          0 |        41 
     57.92 |         0          0          0          0          0          0          0          0         75          0          0          0 |        75 
   59.2941 |         0          0          0          0          0          0          0         17          0          0          0          0 |        17 
   59.7037 |         0          0          0          0          0          0          0          0          0          0          0          0 |        27 
   59.7963 |         0          0          0          0          0          0          0          0          0          0          0        108 |       108 
   60.1429 |         0          0          0          0          0          0          0          0          0         28          0          0 |        28 
   60.1731 |         0         52          0          0          0          0          0          0          0          0          0          0 |        52 
   60.1818 |         0          0          0          0          0          0          0          0          0          0          0         11 |        11 
   60.5789 |         0          0          0          0          0          0          0          0          0          0          0          0 |        38 
     60.75 |         0          0          0          0          0          0          0          0          0          0          0          0 |        32 
   61.0109 |         0          0          0          0          0          0          0          0          0          0          0          0 |        92 
   61.0625 |         0          0          0          0          0          0          0          0         48          0          0          0 |        48 
   61.0763 |         0          0          0          0        118          0          0          0          0          0          0          0 |       118 
   61.1739 |         0          0         23          0          0          0          0          0          0          0          0          0 |        23 
   61.6286 |         0          0         35         35          0          0          0          0          0          0          0          0 |        70 
    61.925 |         0          0          0          0          0          0          0          0          0          0          0          0 |        40 
        62 |         0          0          0          0          0          0          0          0          0          0         21          0 |        21 
   62.1905 |         0         63          0          0          0          0          0          0          0          0          0          0 |        63 
   62.3333 |         0          0          0          0          0         24          0          0          0          0          0          0 |        24 
   62.8416 |         0          0          0          0          0          0          0          0          0          0          0          0 |       101 
   63.1163 |         0          0          0          0          0          0          0          0          0          0          0          0 |        86 
    63.125 |         0          0          0          0          0          0          0          0          0          0          0         40 |        40 
   63.3556 |         0          0          0          0          0          0          0          0          0          0          0          0 |        90 
    63.525 |         0          0          0          0          0          0          0          0          0         40          0          0 |        40 
   63.5385 |         0          0          0         13          0          0          0          0          0          0          0          0 |        13 
   64.1364 |         0          0          0          0         22          0          0          0          0          0          0          0 |        22 
   64.6944 |         0          0          0          0          0          0          0          0          0          0          0          0 |        72 
   64.8461 |         0          0          0          0          0         13          0          0          0          0          0          0 |        13 
    64.871 |         0          0          0          0          0          0          0          0          0          0          0         62 |        62 
   64.9783 |         0          0          0          0         46          0          0          0          0          0          0          0 |        46 
        65 |         0          0          0          3          0          0          0          0          0          0          0          0 |         3 
   65.0145 |         0          0          0          0         69          0          0          0          0          0          0          0 |        69 
   65.0541 |         0          0          0          0          0          0          0          0          0          0          0         37 |        37 
   65.5185 |         0          0          0          0          0          0         27          0          0          0          0          0 |        27 
   65.7826 |         0          0         23          0          0          0          0          0          0          0          0          0 |        23 
   65.8072 |         0          0          0          0          0          0          0          0          0          0          0          0 |        83 
    66.125 |         0         16          0          0          0          0          0          0          0          0          0          0 |        16 
   66.2143 |         0          0          0          0          0         70          0          0          0          0          0          0 |        70 
     66.25 |         0          0          0          0          0          0          0          0          0          0         24          0 |        24 
   66.4222 |         0          0          0          0          0         45          0          0          0          0          0          0 |        45 
    66.625 |         0          0          0          0          0          0          0          0         24          0          0          0 |        24 
   66.9286 |         0          0          0          0          0          0          0          0          0          0          0         14 |        14 
   67.0943 |         0         53          0          0          0          0          0          0          0          0          0          0 |        53 
   67.1351 |         0          0        111        111          0          0          0          0          0          0          0          0 |       222 
   67.6571 |         0          0          0          0          0          0          0          0          0          0          0          0 |        35 
   67.7083 |        48          0          0          0          0          0          0          0          0          0          0          0 |        48 
    67.875 |         0          8          0          0          0          0          0          0          0          0          0          0 |         8 
   67.8919 |         0          0          0          0          0          0          0          0         37          0          0          0 |        37 
     68.08 |         0          0          0          0          0          0          0         25          0          0          0          0 |        25 
   68.1852 |        54          0          0          0          0          0          0          0          0          0          0          0 |        54 
   68.2083 |         0          0          0         24          0          0          0          0          0          0          0          0 |        24 
   68.4627 |         0          0          0          0          0          0          0          0          0          0          0          0 |        67 
   68.6438 |         0          0          0         73          0          0          0          0          0          0          0          0 |        73 
   69.1304 |         0          0          0          0          0          0          0          0          0          0          0          0 |        23 
   69.3958 |         0          0          0          0          0          0          0          0          0         48          0          0 |        48 
   69.4625 |         0          0          0          0          0          0          0          0          0          0          0          0 |        80 
   69.5972 |         0          0         72          0          0          0          0          0          0          0          0          0 |        72 
   69.7778 |         0          0          0          0          0          0         45          0          0          0          0          0 |        45 
    70.125 |         0          0         64          0          0          0          0          0          0          0          0          0 |        64 
     70.25 |         0          0          0          0         12          0          0          0          0          0          0          0 |        12 
     70.35 |         0          0          0         20          0          0          0          0          0          0          0          0 |        20 
   71.2381 |         0          0          0          0         21          0          0          0          0          0          0          0 |        21 
     71.44 |         0          0          0          0          0          0          0          0          0          0          2          0 |         2 
   71.7619 |         0          0          0          0          0          0          0         42          0          0          0          0 |        42 
   71.9762 |         0          0          0          0          0          0          0          0          0          0          0          0 |        42 
    72.225 |         0          0         40          0          0          0          0          0          0          0          0          0 |        40 
      72.3 |         0          0          0          0          0         30          0          0          0          0          0          0 |        30 
   72.5122 |         0          0          0          0          0          0          0          0          0          0          0          0 |        80 
     72.56 |         0         75          0          0          0          0          0          0          0          0          0          0 |        75 
        73 |         0          0          0          0          0          0          0          0          0          0          0          0 |        27 
   73.0455 |         0          0          0          0          0          0          0          0          0          0          0         22 |        22 
   73.1129 |         0         62          0          0          0          0          0          0          0          0          0          0 |        62 
   73.8095 |         0          0          0          0          0          0          0          0          0          0          0          0 |        21 
   74.0964 |         0          0          0          0          0          0          0          0          0          0          0         83 |        83 
   74.1111 |         0          9          0          0          0          0          0          0          0          0          0          0 |         9 
   74.1892 |         0          0          0          0          0          0          0          0          0          0          0         37 |        37 
   74.4091 |        22          0          0          0          0          0          0          0          0          0          0          0 |        22 
   74.4167 |         0          0          0          0          0          0          0          0          0          0         48          0 |        48 
   74.4348 |         0          0          0          0          0          0          0          0          0          0          0          0 |        23 
   74.4382 |         0          0          0          0          0          0          0          0          0          0          0          0 |       177 
   74.5333 |         0          0          0          0          0          0          0          0          0          0          0          0 |        30 
      74.8 |         0          0          0         60          0          0          0          0          0          0          0          0 |        60 
   75.2195 |         0          0          0          0          0          0          0          0          0          0          1          0 |         1 
   75.2745 |         0          0          0          0          0          0          0          0          0          0          0          0 |       102 
   75.3048 |         0          0          0          0          0          0          0          0          0          0          0          0 |       105 
   75.3333 |         0          0         48          0          0          0          0          0          0          0          0          0 |        48 
   75.5094 |         0          0          0          0          0          0          0         53          0          0          0          0 |        53 
   76.1482 |         0          0          0          0          0          0          0          0          0          0         81          0 |        81 
   76.3333 |         0          0          0         12          0          0          0          0          0          0          0          0 |        12 
   76.9362 |         0          0          0         47          0          0          0          0          0          0          0          0 |        47 
   76.9714 |         0          0          0          0          0          0          0          0          0          0          0          0 |        35 
     77.25 |         0          0          0          0         60          0          0          0          0          0          0          0 |        60 
   77.4545 |         0          0          0          0          0          0          0         33          0          0          0          0 |        33 
   77.4643 |         0          0          0          0         28          0          0          0          0          0          0          0 |        28 
   77.6191 |         0          0          0          0          0          0          0         84          0          0          0          0 |        84 
   77.8485 |         0          0          0          0          0          0          0          0          0          0         33          0 |        33 
   77.8919 |        37          0          0          0          0          0          0          0          0          0          0          0 |        37 
   77.8941 |         0          0          0          0          0          0          0          0          0          0          0          0 |        84 
   78.0811 |         0          0          0         37          0          0          0          0          0          0          0          0 |        37 
   78.3125 |         0         16          0          0          0          0          0          0          0          0          0          0 |        16 
   78.6445 |         0          0          0          0          0          0          0          0         45          0          0          0 |        45 
   78.6667 |         0          0          0          0          0          0          0          0          0          0          0         27 |        27 
        79 |         0          0          0          0          0          0          0          0          0          0          2          0 |         2 
   79.1304 |         0          0          0          0         46          0          0          0          0          0          0          0 |        46 
   79.3269 |         0          0          0          0          0          0         52          0          0          0          0          0 |        52 
   79.8571 |         0          0          0          0          0          0          0          0          0          0          0          0 |        14 
   79.9565 |         0          0          0          0          0          0          0          0          0          0          0          0 |        23 
   80.3529 |         0          0          0          0          0          0          0          0          0          0          0          0 |        34 
   80.5556 |         0          0          0          0          0          0          0          0         63          0          0          0 |        63 
   81.1143 |         0          0          0          0          0          0          0          0         35          0          0          0 |        35 
   81.2857 |         0          0          0          0          0          0          0          0          0          0          0         84 |        84 
   81.3374 |        83          0          0          0          0          0          0          0          0          0          0          0 |        83 
   81.4667 |        15          0          0          0          0          0          0          0          0          0          0          0 |        15 
   81.8281 |        64          0          0          0          0          0          0          0          0          0          0          0 |        64 
   82.4868 |         0          0          0          0          0          0          0          0          0         76          0          0 |        76 
   82.6111 |         0          0          0          0          0          0          0          0          0          0          0          0 |        18 
    82.625 |         0          0          0          0          0          0          0          0         48          0          0          0 |        48 
   82.6842 |         0          0          0          0          0          0          0          0          0          0          0          0 |        19 
   82.6944 |         0          0          0          0          0          0          0          0          0          0          0          0 |        36 
   82.7297 |         0         74          0          0          0          0          0          0          0          0          0          0 |        74 
   82.8286 |         0          0          0          0          0          0          0          0          0         35          0          0 |        35 
   83.2703 |         0          0          0          0          0          0          0          0          0          0         37          0 |        37 
     83.75 |         0          0          0          0          0          0          4          0          0          0          0          0 |         4 
      83.8 |         0          0          0          0         10          0          0          0          0          0          0          0 |        10 
   84.0556 |         0          0          0          0          0          0          0          0          0          0          0          0 |        18 
   84.1364 |         0          0          0          0          0          0          0          0          0          0          0          0 |        22 
   84.9677 |         0          0          0          0          0          0         31          0          0          0          0          0 |        31 
   85.9706 |         0          0          0          0          0          0          0          0          0          0          1          0 |         1 
    85.987 |         0          0          0          0          0          0          0          0          0          0          0          0 |         1 
   86.1014 |        69          0          0          0          0          0          0          0          0          0          0          0 |        69 
   86.3562 |         0          0          0          0          0          0          0          0          0          0          3          0 |         3 
   86.9518 |         0         83          0          0          0          0          0          0          0          0          0          0 |        83 
     87.15 |         0         20          0          0          0          0          0          0          0          0          0          0 |        20 
     87.45 |         0          0          0          0          0          0         20          0          0          0          0          0 |        20 
    87.875 |         0          0          0          0          0          0          0          8          0          0          0          0 |         8 
   87.9041 |         0          0          0          0          0          0          0          0          0         73          0          0 |        73 
   87.9524 |         0          0          0          0          0          0          0          0          0          0          0          0 |        21 
   88.0769 |        13          0          0          0          0          0          0          0          0          0          0          0 |        13 
   88.3333 |         0          0          0          0          0          0          0          0          0          0          0          0 |        21 
   88.5758 |         0          0          0          0          0          0          0          0          0          0         33          0 |        33 
    88.579 |         0          0          0          0          0          0          0          0          0          0          0          0 |        19 
      88.7 |         0          0          0          0          0          0          0          0          0         40          0          0 |        40 
        89 |         0          0          0          0          0         18          0          0          0          0          0          0 |        18 
      89.4 |         0         25          0          0          0          0          0          0          0          0          0          0 |        25 
   89.4026 |         0          0          0          0          0          0         77          0          0          0          0          0 |        77 
   89.4722 |         0          0          0          0          0          0          0          0          0         36          0          0 |        36 
   89.5476 |         0          0          0          0          0          0         42          0          0          0          0          0 |        42 
      89.6 |         0          0          0          0          0          0          0          0          0          0          0          0 |        30 
   90.5395 |         0         76          0          0          0          0          0          0          0          0          0          0 |        76 
    90.875 |         0          0          0          0          0          0          0         32          0          0          0          0 |        32 
   91.3623 |         0          0          0          0          0          0          0          0          0          0         69          0 |        69 
   92.7059 |         0          0          0          0          0          0          0          0         68          0          0          0 |        68 
   93.0182 |         0          0          0          0          0          0          0          0          0          0          0          0 |        55 
   93.3333 |         0          0          0          0          0         39          0          0          0          0          0          0 |        39 
   94.4091 |         0          0          0          0          0          0          0          0          0          0          0          0 |        22 
   94.4839 |         0          0          0          0          0          0          0          0          0          0          0          0 |        31 
      94.5 |         0          0          0          0          0          0          0          0          0          0          0          0 |         8 
    96.475 |         0          0          0          0          0          0         40          0          0          0          0          0 |        40 
        98 |         0          0          0          0          0          0          0          0          0          0          0          0 |         1 
   98.6429 |         0          0          0          0          0          0          0          0          0          0          0          0 |        28 
   99.1607 |         0          0          0          0          0          0          0          0          0          0          0          0 |       167 
   100.125 |         0          0          0          0         16          0          0          0          0          0          0          0 |        16 
  100.5179 |         0          0         56          0          0          0          0          0          0          0          0          0 |        56 
    101.15 |         0          0         60          0          0          0          0          0          0          0          0          0 |        60 
  101.3036 |         0          0          0          0          0          0          0          0          0         56          0          0 |        56 
   101.439 |         0          0          0          0          0          0          0          0         41          0          0          0 |        41 
  101.6111 |         0          0          0          0          0          0          0          0          0          0          0         18 |        18 
  102.4324 |        74          0          0          0          0          0          0          0          0          0          0          0 |        74 
  102.5172 |         0          0          0          0          0          0          0          0          0          0          0          0 |         2 
  102.7183 |         0          0          0          0          0          0          0         71          0          0          0          0 |        71 
  102.7679 |         0          0          0          0          0         56          0          0          0          0          0          0 |        56 
  103.0339 |         0          0          0          0          0          0          0          0          0          0         59          0 |        59 
  103.8333 |         6          0          0          0          0          0          0          0          0          0          0          0 |         6 
     103.9 |         0          0          0          0          0          0          0          0          0          0          0          0 |        50 
  104.3256 |         0          0          0          0          0         43          0          0          0          0          0          0 |        43 
  104.5686 |         0          0          0          0         51          0          0          0          0          0          0          0 |        51 
  104.7595 |         0          0          0          0          0          0          0          0          0          0          0          0 |        79 
     105.1 |         0          0          0          0          0          0          0          0          0          0          0          0 |        80 
  105.1176 |         0          0          0          0          0          0          0         51          0          0          0          0 |        51 
     105.2 |         0          0          0          0          0          0          0         10          0          0          0          0 |        10 
  106.0244 |         0          0          0          0          0          0          0         41          0          0          0          0 |        41 
   106.375 |         0          0          0          0          0          0          0          0          0          0          8          0 |         8 
    106.38 |         0          0          0          0          0          0          0          0          0         50          0          0 |        50 
  106.5741 |         0          0          0          0         54          0          0          0          0          0          0          0 |        54 
    106.66 |         0          0          0          0          0         50          0          0          0          0          0          0 |        50 
  107.1929 |         0          0          0          0          0          0          0          0          0          0          0          0 |       140 
    108.25 |         0          0          0         52          0          0          0          0          0          0          0          0 |        52 
  108.2647 |         0         34          0          0          0          0          0         34          0          0          0          0 |        68 
  108.2857 |         0          0          0          0          0          0          0          0          0          0          0          0 |         7 
  109.1818 |         0          0          0          0          0          0          0          0         66          0          0          0 |        66 
  109.5926 |         0          0          0          0          0          0          0          0          0          0          0          0 |        27 
  110.2286 |         0          0          0          0          0          0          0          0          0          0          0          0 |        35 
     110.8 |         0          0         10          0          0          0          0          0          0          0          0          0 |        10 
   111.098 |         0          0          0          0          0          0          0          0          0          0         51          0 |        51 
  111.1892 |         0          0          0          0          0          0          0          0          0         37          0          0 |        37 
       112 |         0          0          0          0          0          0          0          0          0          0          0          0 |         9 
  112.7778 |         0          0          0          0          0          0          0          0          9          0          0          0 |         9 
  113.0526 |         0          0          0          0          0          0          0          0          0          0         38          0 |        38 
  113.1515 |        33          0          0          0          0          0          0          0          0          0          0          0 |        33 
     114.5 |         0          0          8          0          0          0          0          0          0          0          0          0 |         8 
     115.8 |         0          0          5          0          0          0          0          0          0          0          0          0 |         5 
  116.7115 |         0          0          0         52          0          0          0          0          0          0          0          0 |        52 
  116.8518 |         0          0          0         27          0          0          0          0          0          0          0          0 |        27 
  119.1731 |         0          0          0          0          0          0          0          0          0          0          0          0 |        51 
  119.1833 |         0          0          0          0         60          0          0          0          0          0          0          0 |        60 
  119.8261 |         0          0          0          0          0          0         23          0          0          0          0          0 |        23 
  120.1667 |         0          0          0          0          0          0          0          0          0          6          0          0 |         6 
   120.375 |         0          0          0          0          0          0          0          0          0          8          0          0 |         8 
  121.3043 |         0          0          0          0          0          0         46          0          0          0          0          0 |        46 
  121.3864 |         0          0          0          0          0          0          0          0         44          0          0          0 |        44 
     122.3 |        30          0          0          0          0          0          0          0          0          0          0          0 |        30 
  123.3871 |         0          0          0          0          0          0          0          0          0          0          0          0 |        31 
       124 |         0          0          0          0          0          0          0          0          0          0          0          0 |        10 
  124.8333 |         0          0          0          0          0          0          6          0          0          0          0          0 |         6 
  125.2703 |         0          0          0          0          0          0          0          0          0          0          0          0 |        37 
     125.6 |         0          0          0          0          5          0          0          0          0          0          0          0 |         5 
  125.8571 |         0          0          0          0          0          0          0          0          0          0          7          0 |         7 
  126.2222 |         0          0          0          0          0          0          0          0          0          0          0          0 |         9 
  127.4444 |         0          0          0          0          0          0          0          0          0          0          0          9 |         9 
       128 |         0          0          0          0          0          0          0          0          0          0          0         49 |        49 
     128.5 |         0          0          0          0          0          0          0          0          0          0          0          0 |         2 
  128.8571 |         0          0          0          0          0          0         21          0          0          0          0          0 |        21 
       129 |         0          0          0          0          0          0          0          0          0          0          0          0 |         2 
     129.9 |         0          0          0          0         20          0          0          0          0          0          0          0 |        20 
    130.25 |         0          0          0          0          0          0          0          0          0          0          0         36 |        36 
  130.4091 |         0          0          0          0          0          0          0          0          0          0          0          0 |        22 
  130.6296 |         0          0          0          0          0          0          0          0         27          0          0          0 |        27 
  133.8125 |         0          0          0          0          0          0          0          0          0          0         16          0 |        16 
     134.5 |         0          0          0          0          0          0          0          0          0          0          0          0 |         2 
  134.5319 |         0          0          0          0          0          0          0          0          0          0          0          0 |        47 
       136 |         0          0          0          0          0          0          0          0          0          0          0          0 |         2 
   136.625 |         0          0          0          0          0          0          0          0          0          0          0          0 |         8 
  137.1739 |         0          0         23          0          0          0          0          0          0          0          0          0 |        23 
  137.5349 |         0          0          0          0          0          0          0          0          0          0          0          0 |        43 
  138.3846 |         0          0          0          0          0          0          0          0          0          0          0          0 |        13 
     138.5 |         0          0          0          8          0          0          0          0          0          0          0          0 |         8 
  139.6667 |         0          0          0          0          0          6          0          0          0          0          0          0 |         6 
  139.9706 |         0          0         34          0          0          0          0          0          0          0          0          0 |        34 
  141.3889 |         0         36          0          0          0          0          0          0          0          0          0          0 |        36 
     141.4 |         0          0          0          0          0          0          0          0          5          0          0          0 |         5 
  141.6837 |         0          0          0          0          0          0          0          0          0          0          0          0 |        98 
  141.7037 |         0         27          0          0          0          0          0          0          0          0          0          0 |        27 
  141.8095 |         0          0          0          0          0          0          0          0          0          0          0          0 |        21 
  142.1429 |         0          0          0          0          7          7          0          0          0          0          0          0 |        14 
  143.8889 |         0          0          0          0          0          0          0          0          0          0          0          0 |         9 
       144 |         0          0          0          0          0          0          0          0          0          0          0          0 |         1 
  144.1765 |         0          0          0          0          0          0          0          0          0         17          0          0 |        17 
    144.75 |         0          0          0          4          0          0          0          0          0          0          0          0 |         4 
       145 |         0          0          0          0          0          0          0          0          0          0          0          0 |         1 
  145.8333 |        36          0          0          0          0          0          0          0          0          0          0          0 |        36 
  148.1429 |         0          0          0          0          0          0          0          0          0          0          0          0 |         7 
  148.2143 |         0          0          0          0          0          0          0          0          0          0          0          0 |        14 
  150.4118 |         0          0          0          0          0          0         51          0          0          0          0          0 |        51 
  150.5882 |         0          0          0          0          0          0          0          0         17          0          0          0 |        17 
  151.4783 |         0         23          0          0          0          0          0          0          0          0          0          0 |        23 
     151.5 |         0          0          0          0          0          0          0          0          0          0          0          0 |        72 
     152.3 |         0          0          0          0          0          0          0          0          0         10          0          0 |        10 
  152.5278 |         0         36          0          0          0          0          0          0          0          0          0          0 |        36 
  152.8235 |         0          0          0          0          0         17          0          0          0          0          0          0 |        17 
  153.1667 |         0          0          0          0          0          0          0         36          0          0          0          0 |        36 
       154 |         0          0          0          0          0          0          0          0          0          0          0          0 |         1 
  155.1429 |         0          0          0          0          0          0          0          0          0          0          0          7 |         7 
  155.4286 |         0          0          0          0          0          0          7          0          0          0          0          0 |         7 
  156.1429 |         0          0          0          0          0          0          0          0          0          0          0          0 |         7 
     156.2 |         0          0          0          0         25          0          0          0          0          0          0          0 |        25 
  156.7674 |         0          0         43          0          0          0          0          0          0          0          0          0 |        43 
  158.9111 |         0          0          0          0          0         45          0          0          0          0          0          0 |        45 
  159.1111 |         0          0          0          0          0          0          0          0          0          0          0          0 |        54 
   159.175 |         0          0          0          0          0          0          0          0          0          0          0         40 |        40 
    160.15 |         0          0          0          0          0          0         20          0          0          0          0          0 |        20 
  160.9167 |         0          0          0          0          0          0         36          0          0          0          0          0 |        36 
    161.75 |         0          0          0          0          0          0          0         16          0          0          0          0 |        16 
  162.7049 |         0          0          0          0          0          0          0          0          0         61          0          0 |        61 
       164 |         0          0          0          0          0          0          0          0          0          0          0          0 |         1 
  164.1818 |         0          0          0          0          0          0          0         22          0          0          0          0 |        22 
   164.375 |         0          0          0          0          0          0          0          0          0          0          0          0 |         8 
  165.0952 |         0          0          0          0          0          0          0          0          0          0          0          0 |        21 
  165.3125 |         0          0          0          0          0          0          0          0          0          0          0          0 |        16 
  165.7143 |         0          0          0          0          0          0          0          0          0          0          0          7 |         7 
  165.8333 |         0          0          0          0          0          0          0          0          0          0         54          0 |        54 
  166.0192 |         0          0          0          0          0          0          0          0          0          0          0          0 |        51 
     166.5 |         0          0          0          0          0          0          0          0          0          0          0          0 |         6 
  166.5789 |         0          0          0          0          0          0          0          0          0         19          0          0 |        19 
  166.6563 |         0          0          0          0          0          0          0         64          0          0          0          0 |        64 
  167.8947 |         0         57          0          0          0          0          0          0          0          0          0          0 |        57 
  168.0909 |         0          0          0          0          0          0          0         11          0          0          0          0 |        11 
   168.525 |         0          0          0         40          0          0          0          0          0          0          0          0 |        40 
  169.0889 |         0          0          0          0          0          0          0          0          0          0          0          0 |        90 
  170.8421 |        38          0          0          0          0          0          0          0          0          0          0          0 |        38 
  172.3333 |         0          0          0          0          0          0          0          0          0          0          3          0 |         3 
  172.7143 |         0          0          0          0          0          0          0          0          0          7          0          0 |         7 
  174.4286 |         0          0          0          0          0          0          0          0          0          0          0          0 |         7 
   174.697 |        33          0          0          0          0          0          0          0          0          0          0          0 |        33 
  175.6957 |        23          0          0          0          0          0          0          0          0          0          0          0 |        23 
  176.4333 |         0          0          0          0          0          0          0          0         60          0          0          0 |        60 
  177.3958 |         0          0          0          0          0          0          0          0          0          0          0         48 |        48 
  178.1224 |         0          0          0          0          0          0          0          0          0          0          0          0 |        49 
     178.2 |         0          0          0          0          0          0          0          0         45          0          0          0 |        45 
  179.1429 |         0          0          0          0          0          0          0          0          0          0          7          0 |         7 
     179.2 |        10          0          0          0          0          0          0          0          0          0          0          0 |        10 
  179.3636 |         0          0          0          0          0          0         11          0          0          0          0          0 |        11 
    180.45 |         0          0          0          0         20         20          0          0          0          0          0          0 |        40 
    180.75 |         0          0          0          0          0          0          0          4          0          0          0          0 |         4 
  181.7778 |         0         18          0          0          0          0          0          0          0          0          0          0 |        18 
       182 |         0          0          0          0          0          0          0          0          0          0          0          0 |        32 
  182.4211 |         0          0          0          0          0          0          0          0          0          0          0          0 |        19 
  183.2292 |         0          0          0          0          0          0          0          0          0          0          0         48 |        48 
  183.9483 |         0          0         58          0          0          0          0          0          0          0          0          0 |        58 
       184 |         0          0         20          0          0          0          0          0          0          0          0          0 |        20 
     184.8 |         0          0          0          0          0          0          0          0          0          0          0          0 |        45 
  185.9524 |         0          0          0          0          0         21          0          0          0          0          0          0 |        21 
  186.9412 |         0          0          0          0          0          0          0          0          0          0         17          0 |        17 
  188.8333 |         0          0          0          0          0          0          0          0          0          0          0          0 |         6 
  189.4444 |         0          0          0          0          0          0          0          0          0          0          0          0 |        18 
     190.5 |         0          0          0          0          0          0          0          0          0          0          0          0 |         4 
       191 |         0          0          0          0          0          0          0          0          0          0          0          0 |         2 
     193.8 |         0          0          0          0          0          0          0          0          0          0          0          0 |         5 
     195.5 |         0          0          0          0          0          0          0          0          0          0          0          0 |         2 
    197.75 |         0          0          0          0          0          0          4          0          0          0          0          0 |         4 
  200.0714 |         0          0          0          0          0          0          0          0          0         42          0          0 |        42 
  200.4935 |         0         77          0          0          0          0          0          0          0          0          0          0 |        77 
   201.625 |         0          0          0          0          0          0         56          0          0          0          0          0 |        56 
  201.6545 |         0          0          0          0          0         55          0          0          0          0          0          0 |        55 
  202.0526 |         0          0          0          0          0          0          0          0          0          0          0          0 |        19 
  204.7727 |         0          0          0          0          0          0          0          0          0          0          1          0 |         1 
  205.3513 |         0          0          0          0          0         37          0          0          0          0          0          0 |        37 
  206.2222 |         0          0          0         36          0          0          0          0          0          0          0          0 |        36 
     206.5 |         0          0          0          0          0          0          0          0          0          0          0          0 |         1 
  207.1176 |         0          0          0          0          0          0          0          0          0          0          0          0 |        17 
     207.8 |         0          0          0          0          0          0          0          0          0          0          0          0 |         5 
  209.2603 |         0          0          0          0          0          0          0          0          0          0          0          0 |        73 
  209.3333 |         0          0          0          0          0          3          0          0          0          0          0          0 |         3 
  209.4583 |         0          0         24          0          0          0          0          0          0          0          0          0 |        24 
  209.5349 |         0          0          0          0          0          0          0          0          0          0         43          0 |        43 
  209.6035 |         0          0         58          0          0          0          0          0          0          0          0          0 |        58 
    211.25 |         0          0          0          0          0         24          0          0          0          0          0          0 |        24 
  211.3333 |         0          0          0          0          0          0          0          0          0          0          0          0 |         6 
  212.8333 |         0          0          6          0          0          0          0          0          0          0          0          0 |         6 
  213.2885 |         0          0          0          0         52          0          0          0          0          0          0          0 |        52 
  213.6897 |         0          0          0          0          0          0          0          0          0          0          0          0 |         1 
   214.381 |         0          0          0          0          0          0          0          0          0         21          0          0 |        21 
  216.3182 |         0          0          0         22          0          0          0          0          0          0          0          0 |        22 
  216.4706 |         0          0          0         17          0          0          0          0          0          0          0          0 |        17 
  217.7347 |         0          0          0         49          0          0          0          0          0          0          0          0 |        49 
       218 |         0          0          2          0          0          0          0          0          0          0          0          0 |         2 
  220.4348 |         0          0          0          0         23          0          0          0          0          0          0          0 |        23 
  220.5789 |         0          0          0          0          0          0         19          0          0          0          0          0 |        19 
  221.2326 |        43          0          0          0          0          0          0          0          0          0          0          0 |        43 
  221.5714 |         0          0          0          0          0          0          0          0          0          0          1          0 |         1 
       222 |         0          0          0          0          0          0          0          0          0          0          0          0 |         2 
  223.4706 |         0          0          0          0         34          0          0          0          0          0          0          0 |        34 
  223.7369 |         0          0          0          0          0          0          0          0          0          0         19          0 |        19 
       224 |         0          0          0          0          0          0          0          0          0          0          0          0 |         1 
  226.4286 |         0          7          0          0          0          0          0          0          0          0          0          0 |         7 
     226.5 |         0          0          0          0          0          0          0          0          0          0          0          0 |         2 
  226.5833 |         0          0         12          0          0          0          0          0          0          0          0          0 |        12 
   227.375 |         0          0          0          0          0          0          0          0          8          0          0          0 |         8 
  227.4118 |         0          0          0          0          0          0          0          0          0          0          0         17 |        17 
     231.4 |         0          0          0          0          0          0          0          0          0          0          1          0 |         1 
  231.5217 |         0         23          0          0          0          0          0          0          0          0          0          0 |        23 
  234.2174 |         0          0          0          0          0          0          0          0          0          0          0          0 |        23 
    235.55 |         0          0          0          0          0          0          0          0         20          0          0          0 |        20 
  237.3428 |         0          0          0          0          0          0          0         35          0          0          0          0 |        35 
  239.4839 |         0          0         31          0          0          0          0          0          0          0          0          0 |        31 
    239.75 |         0          0          0          0          0          0          0          0          0          0          0          0 |         4 
  240.6905 |         0          0          0          0          0          0          0          0          0          0          0          0 |        42 
       241 |         0          0          0          0          0          0          0          0          0          0          0          0 |         2 
     241.4 |         0          0          0          0          0          0          0          0          5          0          0          0 |         5 
       245 |         0          0          0          0          0          0          0          0          0          0          0          2 |         2 
  248.5909 |         0          0          0          0          0          0          0          0          0          0          0          0 |        22 
    251.35 |         0          0          0         20          0          0          0          0          0          0          0          0 |        20 
     254.4 |         0          0          0          0          0          0          0          5          0          0          0          0 |         5 
  255.1282 |         0          0          0          0          0          0          0          0          0          0          0          0 |        39 
     255.4 |         0          0          0          5          0          0          0          0          0          0          0          0 |         5 
  257.9047 |         0          0          0          0          0          0          0          0          0          0          0         21 |        21 
       259 |         0          0          0          0          0          0          0          0          3          0          0          0 |         3 
  260.9286 |         0          0          0          0         14          0          0          0          0          0          0          0 |        14 
  264.1739 |         0          0          0          0          0          0          0          0          0          0          0          0 |        23 
  264.3889 |         0          0          0          0          0          0          0         18          0          0          0          0 |        18 
  266.3333 |         0          0          0          0          0          0          0          0          0          0          0          0 |         3 
  267.1639 |         0          0          0          0          0          0          0          0          0          0          0          0 |        61 
  269.4375 |         0          0          0          0          0          0          0         16          0          0          0          0 |        16 
  271.3333 |         0          0          0          0          0          0          0          0          0         15          0          0 |        15 
     271.5 |         0          0          0          0          0          4          0          0          0          0          0          0 |         4 
     271.9 |         0          0          0         10          0          0          0          0          0          0          0          0 |        10 
       282 |         0          0          0          0          0          0          0          0          0          0         11          0 |        11 
   283.875 |         0          0          0          0          0          0          0          0         16          0          0          0 |        16 
  284.0732 |         0          0          0          0         41          0          0          0          0          0          0          0 |        41 
  288.7333 |        15          0          0          0          0          0          0          0          0          0          0          0 |        15 
    289.25 |         0          0          0          0          0          0          0          0          0          0          4          0 |         4 
     289.8 |         0          0          0          0          0          0          0          0          0          5          0          0 |         5 
  295.1864 |        59          0          0          0          0          0          0          0          0          0          0          0 |        59 
  296.5122 |         0          0          0         41          0          0          0          0          0          0          0          0 |        41 
  299.6667 |         0          0          0          0          0          0          0          0          0          0          0          0 |         3 
     300.5 |         0          0          0          0          0          0          0          0          0          0          2          0 |         2 
  301.8571 |         0          0          0          0          7          0          0          0          0          0          0          0 |         7 
  302.3333 |         0          0          0          0          0          0          0          0          0          0          0          0 |         3 
  304.2758 |         0          0          0          0          0          0         29          0          0          0          0          0 |        29 
  304.2778 |         0          0          0          0          0          0          0          0          0          0          0          0 |        17 
  305.7222 |         0          0          0          0          0          0          0          0          0          0          0          0 |        18 
  307.6667 |         0          0          0          0          0          0          0          0          0          0          0          0 |         3 
     311.4 |         0          0          0          0          0          0          0          0          5          0          0          0 |         5 
  311.4615 |         0          0         13         13          0          0          0          0          0          0          0          0 |        26 
    312.75 |         0          0          0          0          0          0          0          0          0          0          0          0 |        16 
  320.3333 |         0          0          0          0          0          0          0          0          0          0          0          0 |         3 
     320.8 |         0          0          0          0          0          0          0          0          0          0          0          0 |         5 
  325.3333 |         0          0          0          0          3          0          0          0          0          0          0          0 |         3 
     325.8 |         0          0          0          0          0          0          0          0          0          0          0          0 |         5 
    327.75 |         0          0          0          0          0          0          4          0          0          0          0          0 |         4 
  334.8571 |         0          0          0          0          0          0          0          0          0          0          0          0 |        14 
       341 |         0          0          0          0          0          0          0          0          0          0          0          0 |         2 
       345 |         0          0          0          0          1          0          0          0          0          0          0          0 |         1 
       353 |         0          0          0          0          0          0          0          0          0          0          3          0 |         3 
  355.1538 |         0          0          0          0          0          0          0          0          0          0          0          0 |        13 
  356.1429 |         0          0          0          0          0          0          0          0          0          0          0          0 |        13 
  360.1429 |         0          0          0          0          0          0          0          0          0          0          0         14 |        14 
       362 |         0          0          0          0          3          0          0          0          0          0          0          0 |         3 
     362.5 |         0          0          0          0          0          0          0          0          0          2          0          0 |         2 
  364.0833 |         0          0          0          0          0          0          0          0          0         12          0          0 |        12 
     365.3 |         0          0          0          0          0         10          0          0          0          0          0          0 |        10 
       368 |         0          6          0          0          0          0          0          0          0          0          0          0 |         6 
  375.7097 |         0          0          0          0          0         31          0          0          0          0          0          0 |        31 
  379.3333 |         0          0          0          0          0          0          0          0          0          0          0          0 |         3 
     394.5 |         0          0          0          0          0          0          0          4          0          0          0          0 |         4 
       402 |         0          0          0          0          0          0          0          0          0          0          0          0 |         4 
       421 |         0          0          0          0          0          0         11          0          0          0          0          0 |        11 
     422.6 |         0          0          0          0          0          5          0          0          0          0          0          0 |         5 
     427.9 |         0          0          0          0          0          0          0         10          0          0          0          0 |        10 
       436 |         0          0          0          1          0          0          0          0          0          0          0          0 |         1 
  440.1765 |         0         17          0          0          0          0          0          0          0          0          0          0 |        17 
  443.4286 |         0          0          0          0          0          0          0          0          0          0          0          7 |         7 
     454.9 |         0          0          0          0          0          0          0          0         10          0          0          0 |        10 
    458.25 |         0          0          0          0          0          0          4          0          0          0          0          0 |         4 
     458.5 |         0          0          0          6          0          0          0          0          0          0          0          0 |         6 
       462 |         0          0          0          0          0          0          0          0          0          0          0          0 |         1 
  463.6667 |         0          3          0          0          0          0          0          0          0          0          0          0 |         3 
  469.1429 |        14          0          0          0          0          0          0          0          0          0          0          0 |        14 
  469.3077 |         0          0         13          0          0          0          0          0          0          0          0          0 |        13 
     474.1 |         0          0          0          0          0          0          0          0          0          0         10          0 |        10 
     499.2 |         0          0          0          0          0          0          0          0          0          0          0          0 |         5 
       506 |         0          0          0          0          0          0          0          0          0          0          0          0 |         2 
     517.5 |         2          0          0          0          0          0          0          0          0          0          0          0 |         2 
       520 |         0          0          0          0          0          0          0          0          0          0          0          0 |         1 
  523.1667 |         0          0          0          0          0          0          0          0          0          0          0          0 |         5 
       529 |         0          0          0          0          0          0          0          0          0          0          0          2 |         2 
       535 |         0          0          2          2          0          0          0          0          0          0          0          0 |         4 
       544 |         0          0          0          0          0          0          0          0          0          0          0          0 |         1 
  545.7143 |         0          0          0          0          0          0          0          0          0          0          0          0 |         7 
   575.125 |         8          0          0          0          0          0          0          0          0          0          0          0 |         8 
       577 |         0          0          0          0          0          0          0          0          0          0          0          0 |         2 
       598 |         0          1          0          0          0          0          0          0          0          0          0          0 |         1 
    606.75 |         0          0          0          0          0          0          0          0          0          0          4          0 |         4 
     610.1 |         0          0          0         10          0          0          0          0          0          0          0          0 |        10 
    628.25 |         0          0          0          0          4          0          0          0          0          0          0          0 |         4 
  633.1111 |         0          0          0          0          9          0          0          0          0          0          0          0 |         9 
    633.75 |         0          0          0          0          0          0          0          0          0          0          0          0 |         4 
       665 |         0          0          0          0          0          0          0          0          0          0          0          1 |         1 
     668.2 |         0          5          0          0          0          0          0          0          0          0          0          0 |         5 
       684 |         0          0          0          0          0          0          0          0          0          1          0          0 |         1 
   684.625 |         0          0          0          0          0          0          0          0          0          0          0          0 |         1 
    687.75 |         0          0          4          0          0          0          0          0          0          0          0          0 |         4 
    712.25 |         0          0          0          0          0          8          0          0          0          0          0          0 |         8 
       714 |         0          0          0          0          0          0          0          0          0          1          0          0 |         1 
  736.6667 |         0          0          0          0          0          0          0          0          0          0          0          0 |         3 
       753 |         0          0          0          0          0          0          1          0          0          0          0          0 |         1 
       786 |         0          0          0          0          0          0          1          0          0          0          0          0 |         1 
       830 |         0          0          0          0          0          0          0          0          0          0          1          0 |         1 
       894 |         0          0          0          0          0          0          0          0          0          0          0          4 |         4 
     952.5 |        14          0          0          0          0          0          0          0          0          0          0          0 |        14 
       976 |         0          0          0          0          0          1          0          0          0          0          0          0 |         1 
       981 |         0          0          0          0          0          0          0          0          0          0          0          1 |         1 
      1005 |         0          0          0          0          0          0          0          0          0          0          0          0 |         1 
    1126.5 |         0          0          0          0          0          0          2          0          0          0          0          0 |         2 
   1148.75 |         0          0          0          0          0          0          4          0          0          0          0          0 |         4 
    1256.5 |         0          0          0          0          0          2          0          0          0          0          0          0 |         2 
  1265.667 |         0          0          0          0          0          0          0          0          0          0          0          0 |         3 
    1354.5 |         0          0          0          0          0          0          0          0          0          2          0          0 |         2 
  1371.333 |         3          0          0          0          0          0          0          0          0          0          0          0 |         3 
      1385 |         0          0          0          0          0          0          0          2          0          0          0          0 |         2 
      2945 |         0          0          0          0          0          0          0          0          1          0          0          0 |         1 
-----------+------------------------------------------------------------------------------------------------------------------------------------+----------
     Total |     1,165      1,155      1,190      1,099      1,116      1,113      1,161      1,215      1,249      1,270      1,182      1,159 |    20,548 


           |                               YE_AR
UAA_WEIGHT |      2007       2008       2009       2010       2011       2012 |     Total
-----------+------------------------------------------------------------------+----------
         0 |         0          0          0          0          0          0 |        43 
     6.625 |         0          0          0          0          0          0 |         8 
   17.2857 |         0          0          0          0          0         21 |        21 
   22.6977 |         0          0          0          0          0          0 |        43 
   23.0769 |         0          0         13          0          0          0 |        13 
      23.1 |         0          0          0          0         20          0 |        20 
   23.4167 |         0          0          0          0          0          0 |        12 
   23.4828 |         0          0         29          0          0          0 |        29 
   24.0938 |         0          0          0          0          0          0 |        32 
      24.6 |         0          0          0          0          0          0 |        20 
   24.9487 |         0          0          0          0          0          0 |        39 
      25.5 |         0         12          0          0          0          0 |        12 
     25.88 |        25          0          0          0          0          0 |        25 
   26.3235 |         0          0          0          0          0          0 |        34 
   26.6154 |         0         26          0          0          0          0 |        26 
   26.7895 |         0          0          0          0          0          0 |        19 
   27.3409 |         0          0          0          0          0         44 |        44 
      27.5 |         0          0          0          0          2          2 |         4 
        28 |         0          0          0          1          0          0 |         3 
   28.1429 |         0          0          0          0          0          0 |        28 
      28.4 |         0          0          0          0          0          0 |        35 
   28.4375 |         0          0          0          0          0          0 |        32 
   28.7059 |         0          0          0         17          0          0 |        17 
        29 |         0          2          0          0          0          0 |         2 
   29.2143 |         0          0          0          0          0          0 |        14 
   29.9412 |         0          0          0          0          0          0 |        17 
   30.2121 |         0          0          0          0          0          0 |        33 
     30.75 |         0          0          0          0          0          0 |        16 
   30.7778 |         0          0          0          0          0          0 |         9 
   30.8955 |         0          0          0          0          0          0 |       134 
    30.913 |         0         23          0          0          0          0 |        23 
    31.375 |         0          0          0          0          0          0 |        16 
    31.434 |         0          0          0         53          0          0 |        53 
   31.7667 |         0          0          0          0          0          0 |        30 
   32.3571 |         0          0          0          0          0          0 |        14 
   32.4403 |         0          0          0          0          0          0 |       134 
   32.4783 |         0         23          0          0          0          0 |        23 
      32.6 |         0          0          0          0          0          0 |        15 
   32.6667 |         0          0          0          0          0          0 |        15 
   32.7188 |         0          0          0          0          0          0 |        32 
   32.9565 |         0          0          0          0          0          0 |        23 
        33 |         0          0          0          0          0          0 |        31 
   33.2727 |         0          0          0         22          0          0 |        22 
   34.1855 |         0          0          0          0          0          0 |       124 
     34.25 |         0          0          0          0          0          0 |        28 
   34.6822 |         0          0          0          0          0          0 |       129 
     35.38 |         0         50          0          0          0          0 |        50 
      35.5 |         0          0          0          0          0          0 |        18 
   35.6741 |       135          0          0          0          0          0 |       135 
   35.7037 |         0          0          0          0          0          0 |        27 
      35.8 |         0          0          0          0          0          0 |        25 
      36.9 |         0          0         20          0          0          0 |        20 
   36.9231 |         0          0          0          0          0          0 |        13 
     37.28 |         0          0          0          0          0          0 |        25 
      37.5 |         0          0          0          0         30          0 |        30 
   37.5462 |         0        130          0          0          0          0 |       130 
   37.6105 |         0          0          0          0          0          0 |        95 
     37.74 |         0          0         50          0          0          0 |        50 
   37.8696 |        23          0          0          0          0          0 |        23 
    37.871 |         0          0          0          0         31          0 |        31 
   38.1176 |         0          0          0         34          0          0 |        34 
   38.1364 |         0          0          0          0          0         22 |        22 
   38.5391 |         0          0          0          0          0          0 |       128 
   38.7339 |         0          0        124          0          0          0 |       124 
   38.9583 |         0          0          0          0          0          0 |        24 
   39.2273 |         0          0          0          0          0          0 |        22 
   39.4545 |         0          0         44          0          0          0 |        44 
   39.9545 |         0          0          0          0          0          0 |        22 
        40 |         0          0          0          0          0          0 |        12 
   40.0833 |         0          0          0          0          0          0 |        24 
   40.2692 |         0          0          0          0          0          0 |        26 
    40.575 |         0          0          0          0         40          0 |        40 
   40.6522 |         0          0          0          0          0          0 |        23 
   40.6829 |         0          0          0         41          0          0 |        41 
   40.8083 |         0          0          0          0          0          0 |       120 
      41.3 |         0          0          0          0          0          0 |        20 
   41.7143 |         0          0          0          0          0         28 |        28 
   41.7391 |         0         46          0          0          0          0 |        46 
   41.8261 |         0          0          0          0          0          0 |        23 
   41.8889 |         0          0          0          0          0         27 |        27 
   41.9474 |         0          0          0          0          0          0 |        19 
   41.9545 |         0          0         22          0          0          0 |        22 
   42.5714 |         0          0          0          0          0          0 |         7 
      42.6 |         0          0          0         20          0          0 |        20 
     42.75 |         0          0          0          0          0          0 |         4 
   43.6875 |         0          0         16          0          0          0 |        16 
    43.885 |         0          0          0        112          0          0 |       112 
      43.9 |         0          0          0          0          0          0 |        50 
   44.5455 |         0          0          0          0          0          0 |        11 
   44.6596 |         0          0          0          0         47          0 |        47 
     44.75 |        20          0          0          0          0          0 |        20 
   45.1875 |         0          0          0          0          0          0 |        48 
   45.5532 |         0          0          0          0          0          0 |        94 
   45.6087 |         0          0          0          0         23          0 |        23 
   45.8077 |         0          0          0          0          0          0 |        78 
   45.8229 |         0          0          0          0          0          0 |        96 
   46.3169 |         0          0          0          0          0          0 |       142 
   46.4444 |         0          0          0          0          0          0 |        36 
   47.1842 |         0          0          0          0          0          0 |        38 
      47.3 |         0          0         20          0          0          0 |        20 
   47.6389 |         0          0          0          0          0          0 |        36 
   48.1124 |         0          0          0          0          0          0 |        89 
   48.2857 |         0          0          0          0          0          0 |        21 
   48.3379 |         0          0          0          0          0          0 |       145 
     48.45 |         0          0          0          0          0          0 |        20 
     48.75 |         0          0          0          0          0          0 |         4 
   49.2381 |         0          0          0          0          0          0 |         1 
   49.3684 |         0         19          0          0          0          0 |        19 
      49.4 |         0          0          0          0          0          0 |        20 
   49.4725 |         0          0          0          0          0          0 |        91 
   49.9886 |         0          0          0          0          0          0 |        88 
   50.0486 |         0          0          0          0          0          0 |       144 
   50.0667 |         0          0          0          0          0          0 |        30 
   50.3333 |         0          0          0          0          0          0 |         6 
   50.5789 |         0         19          0          0          0          0 |        19 
   50.5897 |         0          0          0          0          0         39 |        39 
   50.6148 |         0          0          0          0          0          0 |       135 
   50.6667 |         0          0          0          0          0          0 |         6 
   50.8851 |         0          0          0          0          0          0 |        87 
   51.1069 |         0          0          0          0          0          0 |       131 
   51.1413 |         0          0         92          0          0          0 |        92 
   51.1563 |         0          0          0          0          0          0 |        32 
   51.4762 |        42          0          0          0          0          0 |        42 
      51.7 |         0          0          0          0          0          0 |        20 
   51.8333 |         0          0          0         18          0          0 |        18 
   52.2703 |         0          0          0          0          0          0 |        74 
    52.595 |         0          0          0          0        121          0 |       121 
   53.0682 |         0         44          0          0          0          0 |        44 
   53.1111 |         0         90          0          0          0          0 |        90 
   53.3226 |         0          0          0          0          0          0 |        31 
   53.8222 |        44          0          0          0          0          0 |        44 
   54.1111 |        18          0          0          0          0          0 |        18 
   54.2692 |         0          0          0          0          0          0 |        26 
   54.2941 |         0          0          0          0          0         17 |        17 
   54.3158 |         0          0          0          0          0         19 |        19 
   54.3409 |         0          0          0          0          0          0 |         1 
   54.4478 |         0          0          0          0          0          0 |        67 
   54.5714 |         0          0          0          0          0          0 |         1 
   54.6752 |         0          0          0          0          0        117 |       117 
   54.7213 |         0          0          0        121          0          0 |       121 
   54.9178 |         0          0          0          0          0          0 |        73 
   55.6047 |         0          0          0          0          0          0 |        43 
    56.037 |         0          0          0          0          0          0 |        27 
    56.058 |         0          0          0          0          0          0 |        69 
   56.1765 |         0          0          0          0          0          0 |        34 
   56.2222 |         0          0          0          0          0          0 |        18 
      56.5 |         0          0          0          0          0          0 |         2 
   56.6765 |        68          0          0          0          0          0 |        68 
   56.7619 |         0          0          0         21          0          0 |        21 
   56.8784 |         0          0          0          0          0          0 |        74 
        57 |         0          0          0          0          0          0 |         3 
   57.0526 |         0          0          0          0          0          0 |        38 
   57.1333 |         0          0          0          0         15          0 |        15 
   57.4576 |         0          0          0          0          0          0 |       118 
    57.463 |         0          0          0          0          0          0 |        54 
   57.6667 |         1          0          0          0          0          0 |         1 
   57.7073 |         0          0          0          0          0          0 |        41 
     57.92 |         0          0          0          0          0          0 |        75 
   59.2941 |         0          0          0          0          0          0 |        17 
   59.7037 |        27          0          0          0          0          0 |        27 
   59.7963 |         0          0          0          0          0          0 |       108 
   60.1429 |         0          0          0          0          0          0 |        28 
   60.1731 |         0          0          0          0          0          0 |        52 
   60.1818 |         0          0          0          0          0          0 |        11 
   60.5789 |         0          0         38          0          0          0 |        38 
     60.75 |         0          0         32          0          0          0 |        32 
   61.0109 |         0          0         92          0          0          0 |        92 
   61.0625 |         0          0          0          0          0          0 |        48 
   61.0763 |         0          0          0          0          0          0 |       118 
   61.1739 |         0          0          0          0          0          0 |        23 
   61.6286 |         0          0          0          0          0          0 |        70 
    61.925 |         0          0          0          0         40          0 |        40 
        62 |         0          0          0          0          0          0 |        21 
   62.1905 |         0          0          0          0          0          0 |        63 
   62.3333 |         0          0          0          0          0          0 |        24 
   62.8416 |       101          0          0          0          0          0 |       101 
   63.1163 |         0          0          0          0         86          0 |        86 
    63.125 |         0          0          0          0          0          0 |        40 
   63.3556 |         0         90          0          0          0          0 |        90 
    63.525 |         0          0          0          0          0          0 |        40 
   63.5385 |         0          0          0          0          0          0 |        13 
   64.1364 |         0          0          0          0          0          0 |        22 
   64.6944 |         0         72          0          0          0          0 |        72 
   64.8461 |         0          0          0          0          0          0 |        13 
    64.871 |         0          0          0          0          0          0 |        62 
   64.9783 |         0          0          0          0          0          0 |        46 
        65 |         0          0          0          0          0          0 |         3 
   65.0145 |         0          0          0          0          0          0 |        69 
   65.0541 |         0          0          0          0          0          0 |        37 
   65.5185 |         0          0          0          0          0          0 |        27 
   65.7826 |         0          0          0          0          0          0 |        23 
   65.8072 |         0          0          0          0          0         83 |        83 
    66.125 |         0          0          0          0          0          0 |        16 
   66.2143 |         0          0          0          0          0          0 |        70 
     66.25 |         0          0          0          0          0          0 |        24 
   66.4222 |         0          0          0          0          0          0 |        45 
    66.625 |         0          0          0          0          0          0 |        24 
   66.9286 |         0          0          0          0          0          0 |        14 
   67.0943 |         0          0          0          0          0          0 |        53 
   67.1351 |         0          0          0          0          0          0 |       222 
   67.6571 |        35          0          0          0          0          0 |        35 
   67.7083 |         0          0          0          0          0          0 |        48 
    67.875 |         0          0          0          0          0          0 |         8 
   67.8919 |         0          0          0          0          0          0 |        37 
     68.08 |         0          0          0          0          0          0 |        25 
   68.1852 |         0          0          0          0          0          0 |        54 
   68.2083 |         0          0          0          0          0          0 |        24 
   68.4627 |         0          0         67          0          0          0 |        67 
   68.6438 |         0          0          0          0          0          0 |        73 
   69.1304 |         0         23          0          0          0          0 |        23 
   69.3958 |         0          0          0          0          0          0 |        48 
   69.4625 |         0          0          0         80          0          0 |        80 
   69.5972 |         0          0          0          0          0          0 |        72 
   69.7778 |         0          0          0          0          0          0 |        45 
    70.125 |         0          0          0          0          0          0 |        64 
     70.25 |         0          0          0          0          0          0 |        12 
     70.35 |         0          0          0          0          0          0 |        20 
   71.2381 |         0          0          0          0          0          0 |        21 
     71.44 |         0          0          0          0          0          0 |         2 
   71.7619 |         0          0          0          0          0          0 |        42 
   71.9762 |        42          0          0          0          0          0 |        42 
    72.225 |         0          0          0          0          0          0 |        40 
      72.3 |         0          0          0          0          0          0 |        30 
   72.5122 |        80          0          0          0          0          0 |        80 
     72.56 |         0          0          0          0          0          0 |        75 
        73 |         0         27          0          0          0          0 |        27 
   73.0455 |         0          0          0          0          0          0 |        22 
   73.1129 |         0          0          0          0          0          0 |        62 
   73.8095 |         0          0          0          0         21          0 |        21 
   74.0964 |         0          0          0          0          0          0 |        83 
   74.1111 |         0          0          0          0          0          0 |         9 
   74.1892 |         0          0          0          0          0          0 |        37 
   74.4091 |         0          0          0          0          0          0 |        22 
   74.4167 |         0          0          0          0          0          0 |        48 
   74.4348 |         0         23          0          0          0          0 |        23 
   74.4382 |         0          0          0        177          0          0 |       177 
   74.5333 |         0          0          0         30          0          0 |        30 
      74.8 |         0          0          0          0          0          0 |        60 
   75.2195 |         0          0          0          0          0          0 |         1 
   75.2745 |         0          0          0          0          0        102 |       102 
   75.3048 |         0          0          0          0        105          0 |       105 
   75.3333 |         0          0          0          0          0          0 |        48 
   75.5094 |         0          0          0          0          0          0 |        53 
   76.1482 |         0          0          0          0          0          0 |        81 
   76.3333 |         0          0          0          0          0          0 |        12 
   76.9362 |         0          0          0          0          0          0 |        47 
   76.9714 |         0          0          0          0          0         35 |        35 
     77.25 |         0          0          0          0          0          0 |        60 
   77.4545 |         0          0          0          0          0          0 |        33 
   77.4643 |         0          0          0          0          0          0 |        28 
   77.6191 |         0          0          0          0          0          0 |        84 
   77.8485 |         0          0          0          0          0          0 |        33 
   77.8919 |         0          0          0          0          0          0 |        37 
   77.8941 |        84          0          0          0          0          0 |        84 
   78.0811 |         0          0          0          0          0          0 |        37 
   78.3125 |         0          0          0          0          0          0 |        16 
   78.6445 |         0          0          0          0          0          0 |        45 
   78.6667 |         0          0          0          0          0          0 |        27 
        79 |         0          0          0          0          0          0 |         2 
   79.1304 |         0          0          0          0          0          0 |        46 
   79.3269 |         0          0          0          0          0          0 |        52 
   79.8571 |        14          0          0          0          0          0 |        14 
   79.9565 |         0          0          0          0         23          0 |        23 
   80.3529 |         0         34          0          0          0          0 |        34 
   80.5556 |         0          0          0          0          0          0 |        63 
   81.1143 |         0          0          0          0          0          0 |        35 
   81.2857 |         0          0          0          0          0          0 |        84 
   81.3374 |         0          0          0          0          0          0 |        83 
   81.4667 |         0          0          0          0          0          0 |        15 
   81.8281 |         0          0          0          0          0          0 |        64 
   82.4868 |         0          0          0          0          0          0 |        76 
   82.6111 |         0          0          0         18          0          0 |        18 
    82.625 |         0          0          0          0          0          0 |        48 
   82.6842 |         0          0         19          0          0          0 |        19 
   82.6944 |         0         36          0          0          0          0 |        36 
   82.7297 |         0          0          0          0          0          0 |        74 
   82.8286 |         0          0          0          0          0          0 |        35 
   83.2703 |         0          0          0          0          0          0 |        37 
     83.75 |         0          0          0          0          0          0 |         4 
      83.8 |         0          0          0          0          0          0 |        10 
   84.0556 |        18          0          0          0          0          0 |        18 
   84.1364 |         0          0          0          0          0         22 |        22 
   84.9677 |         0          0          0          0          0          0 |        31 
   85.9706 |         0          0          0          0          0          0 |         1 
    85.987 |         1          0          0          0          0          0 |         1 
   86.1014 |         0          0          0          0          0          0 |        69 
   86.3562 |         0          0          0          0          0          0 |         3 
   86.9518 |         0          0          0          0          0          0 |        83 
     87.15 |         0          0          0          0          0          0 |        20 
     87.45 |         0          0          0          0          0          0 |        20 
    87.875 |         0          0          0          0          0          0 |         8 
   87.9041 |         0          0          0          0          0          0 |        73 
   87.9524 |         0          0          0          0          0         21 |        21 
   88.0769 |         0          0          0          0          0          0 |        13 
   88.3333 |         0          0          0          0         21          0 |        21 
   88.5758 |         0          0          0          0          0          0 |        33 
    88.579 |         0          0         19          0          0          0 |        19 
      88.7 |         0          0          0          0          0          0 |        40 
        89 |         0          0          0          0          0          0 |        18 
      89.4 |         0          0          0          0          0          0 |        25 
   89.4026 |         0          0          0          0          0          0 |        77 
   89.4722 |         0          0          0          0          0          0 |        36 
   89.5476 |         0          0          0          0          0          0 |        42 
      89.6 |         0          0         30          0          0          0 |        30 
   90.5395 |         0          0          0          0          0          0 |        76 
    90.875 |         0          0          0          0          0          0 |        32 
   91.3623 |         0          0          0          0          0          0 |        69 
   92.7059 |         0          0          0          0          0          0 |        68 
   93.0182 |         0          0         55          0          0          0 |        55 
   93.3333 |         0          0          0          0          0          0 |        39 
   94.4091 |        22          0          0          0          0          0 |        22 
   94.4839 |         0          0         31          0          0          0 |        31 
      94.5 |         0          0          0          0          8          0 |         8 
    96.475 |         0          0          0          0          0          0 |        40 
        98 |         0          0          0          0          0          1 |         1 
   98.6429 |        28          0          0          0          0          0 |        28 
   99.1607 |         0          0          0          0        167          0 |       167 
   100.125 |         0          0          0          0          0          0 |        16 
  100.5179 |         0          0          0          0          0          0 |        56 
    101.15 |         0          0          0          0          0          0 |        60 
  101.3036 |         0          0          0          0          0          0 |        56 
   101.439 |         0          0          0          0          0          0 |        41 
  101.6111 |         0          0          0          0          0          0 |        18 
  102.4324 |         0          0          0          0          0          0 |        74 
  102.5172 |         2          0          0          0          0          0 |         2 
  102.7183 |         0          0          0          0          0          0 |        71 
  102.7679 |         0          0          0          0          0          0 |        56 
  103.0339 |         0          0          0          0          0          0 |        59 
  103.8333 |         0          0          0          0          0          0 |         6 
     103.9 |         0         50          0          0          0          0 |        50 
  104.3256 |         0          0          0          0          0          0 |        43 
  104.5686 |         0          0          0          0          0          0 |        51 
  104.7595 |         0          0         79          0          0          0 |        79 
     105.1 |         0         80          0          0          0          0 |        80 
  105.1176 |         0          0          0          0          0          0 |        51 
     105.2 |         0          0          0          0          0          0 |        10 
  106.0244 |         0          0          0          0          0          0 |        41 
   106.375 |         0          0          0          0          0          0 |         8 
    106.38 |         0          0          0          0          0          0 |        50 
  106.5741 |         0          0          0          0          0          0 |        54 
    106.66 |         0          0          0          0          0          0 |        50 
  107.1929 |         0          0          0          0          0        140 |       140 
    108.25 |         0          0          0          0          0          0 |        52 
  108.2647 |         0          0          0          0          0          0 |        68 
  108.2857 |         0          0          0          0          0          7 |         7 
  109.1818 |         0          0          0          0          0          0 |        66 
  109.5926 |         0          0          0         27          0          0 |        27 
  110.2286 |         0          0          0          0          0         35 |        35 
     110.8 |         0          0          0          0          0          0 |        10 
   111.098 |         0          0          0          0          0          0 |        51 
  111.1892 |         0          0          0          0          0          0 |        37 
       112 |         0          9          0          0          0          0 |         9 
  112.7778 |         0          0          0          0          0          0 |         9 
  113.0526 |         0          0          0          0          0          0 |        38 
  113.1515 |         0          0          0          0          0          0 |        33 
     114.5 |         0          0          0          0          0          0 |         8 
     115.8 |         0          0          0          0          0          0 |         5 
  116.7115 |         0          0          0          0          0          0 |        52 
  116.8518 |         0          0          0          0          0          0 |        27 
  119.1731 |        51          0          0          0          0          0 |        51 
  119.1833 |         0          0          0          0          0          0 |        60 
  119.8261 |         0          0          0          0          0          0 |        23 
  120.1667 |         0          0          0          0          0          0 |         6 
   120.375 |         0          0          0          0          0          0 |         8 
  121.3043 |         0          0          0          0          0          0 |        46 
  121.3864 |         0          0          0          0          0          0 |        44 
     122.3 |         0          0          0          0          0          0 |        30 
  123.3871 |         0          0          0          0         31          0 |        31 
       124 |         0         10          0          0          0          0 |        10 
  124.8333 |         0          0          0          0          0          0 |         6 
  125.2703 |        37          0          0          0          0          0 |        37 
     125.6 |         0          0          0          0          0          0 |         5 
  125.8571 |         0          0          0          0          0          0 |         7 
  126.2222 |         9          0          0          0          0          0 |         9 
  127.4444 |         0          0          0          0          0          0 |         9 
       128 |         0          0          0          0          0          0 |        49 
     128.5 |         0          0          0          0          0          2 |         2 
  128.8571 |         0          0          0          0          0          0 |        21 
       129 |         0          0          0          2          0          0 |         2 
     129.9 |         0          0          0          0          0          0 |        20 
    130.25 |         0          0          0          0          0          0 |        36 
  130.4091 |         0          0          0         22          0          0 |        22 
  130.6296 |         0          0          0          0          0          0 |        27 
  133.8125 |         0          0          0          0          0          0 |        16 
     134.5 |         0          0          2          0          0          0 |         2 
  134.5319 |        47          0          0          0          0          0 |        47 
       136 |         0          2          0          0          0          0 |         2 
   136.625 |         8          0          0          0          0          0 |         8 
  137.1739 |         0          0          0          0          0          0 |        23 
  137.5349 |         0         43          0          0          0          0 |        43 
  138.3846 |        13          0          0          0          0          0 |        13 
     138.5 |         0          0          0          0          0          0 |         8 
  139.6667 |         0          0          0          0          0          0 |         6 
  139.9706 |         0          0          0          0          0          0 |        34 
  141.3889 |         0          0          0          0          0          0 |        36 
     141.4 |         0          0          0          0          0          0 |         5 
  141.6837 |         0          0          0         98          0          0 |        98 
  141.7037 |         0          0          0          0          0          0 |        27 
  141.8095 |         0          0          0          0         21          0 |        21 
  142.1429 |         0          0          0          0          0          0 |        14 
  143.8889 |         0          0          9          0          0          0 |         9 
       144 |         0          0          0          0          0          1 |         1 
  144.1765 |         0          0          0          0          0          0 |        17 
    144.75 |         0          0          0          0          0          0 |         4 
       145 |         0          0          0          0          1          0 |         1 
  145.8333 |         0          0          0          0          0          0 |        36 
  148.1429 |         0          0          0          0          0          7 |         7 
  148.2143 |         0          0          0          0          0         14 |        14 
  150.4118 |         0          0          0          0          0          0 |        51 
  150.5882 |         0          0          0          0          0          0 |        17 
  151.4783 |         0          0          0          0          0          0 |        23 
     151.5 |         0          0          0          0          0         72 |        72 
     152.3 |         0          0          0          0          0          0 |        10 
  152.5278 |         0          0          0          0          0          0 |        36 
  152.8235 |         0          0          0          0          0          0 |        17 
  153.1667 |         0          0          0          0          0          0 |        36 
       154 |         0          0          0          1          0          0 |         1 
  155.1429 |         0          0          0          0          0          0 |         7 
  155.4286 |         0          0          0          0          0          0 |         7 
  156.1429 |         0          0          0          0          7          0 |         7 
     156.2 |         0          0          0          0          0          0 |        25 
  156.7674 |         0          0          0          0          0          0 |        43 
  158.9111 |         0          0          0          0          0          0 |        45 
  159.1111 |         0          0         54          0          0          0 |        54 
   159.175 |         0          0          0          0          0          0 |        40 
    160.15 |         0          0          0          0          0          0 |        20 
  160.9167 |         0          0          0          0          0          0 |        36 
    161.75 |         0          0          0          0          0          0 |        16 
  162.7049 |         0          0          0          0          0          0 |        61 
       164 |         1          0          0          0          0          0 |         1 
  164.1818 |         0          0          0          0          0          0 |        22 
   164.375 |         0          8          0          0          0          0 |         8 
  165.0952 |         0          0          0          0         21          0 |        21 
  165.3125 |         0          0          0          0          0         16 |        16 
  165.7143 |         0          0          0          0          0          0 |         7 
  165.8333 |         0          0          0          0          0          0 |        54 
  166.0192 |        51          0          0          0          0          0 |        51 
     166.5 |         0          0          6          0          0          0 |         6 
  166.5789 |         0          0          0          0          0          0 |        19 
  166.6563 |         0          0          0          0          0          0 |        64 
  167.8947 |         0          0          0          0          0          0 |        57 
  168.0909 |         0          0          0          0          0          0 |        11 
   168.525 |         0          0          0          0          0          0 |        40 
  169.0889 |         0          0          0          0         90          0 |        90 
  170.8421 |         0          0          0          0          0          0 |        38 
  172.3333 |         0          0          0          0          0          0 |         3 
  172.7143 |         0          0          0          0          0          0 |         7 
  174.4286 |         0          0          7          0          0          0 |         7 
   174.697 |         0          0          0          0          0          0 |        33 
  175.6957 |         0          0          0          0          0          0 |        23 
  176.4333 |         0          0          0          0          0          0 |        60 
  177.3958 |         0          0          0          0          0          0 |        48 
  178.1224 |         0         49          0          0          0          0 |        49 
     178.2 |         0          0          0          0          0          0 |        45 
  179.1429 |         0          0          0          0          0          0 |         7 
     179.2 |         0          0          0          0          0          0 |        10 
  179.3636 |         0          0          0          0          0          0 |        11 
    180.45 |         0          0          0          0          0          0 |        40 
    180.75 |         0          0          0          0          0          0 |         4 
  181.7778 |         0          0          0          0          0          0 |        18 
       182 |         0          0         32          0          0          0 |        32 
  182.4211 |         0         19          0          0          0          0 |        19 
  183.2292 |         0          0          0          0          0          0 |        48 
  183.9483 |         0          0          0          0          0          0 |        58 
       184 |         0          0          0          0          0          0 |        20 
     184.8 |        45          0          0          0          0          0 |        45 
  185.9524 |         0          0          0          0          0          0 |        21 
  186.9412 |         0          0          0          0          0          0 |        17 
  188.8333 |         6          0          0          0          0          0 |         6 
  189.4444 |         0          0         18          0          0          0 |        18 
     190.5 |         0          0          0          0          0          4 |         4 
       191 |         0          0          2          0          0          0 |         2 
     193.8 |         0          5          0          0          0          0 |         5 
     195.5 |         0          2          0          0          0          0 |         2 
    197.75 |         0          0          0          0          0          0 |         4 
  200.0714 |         0          0          0          0          0          0 |        42 
  200.4935 |         0          0          0          0          0          0 |        77 
   201.625 |         0          0          0          0          0          0 |        56 
  201.6545 |         0          0          0          0          0          0 |        55 
  202.0526 |        19          0          0          0          0          0 |        19 
  204.7727 |         0          0          0          0          0          0 |         1 
  205.3513 |         0          0          0          0          0          0 |        37 
  206.2222 |         0          0          0          0          0          0 |        36 
     206.5 |         0          0          0          0          1          0 |         1 
  207.1176 |         0          0          0         17          0          0 |        17 
     207.8 |         5          0          0          0          0          0 |         5 
  209.2603 |         0          0          0         73          0          0 |        73 
  209.3333 |         0          0          0          0          0          0 |         3 
  209.4583 |         0          0          0          0          0          0 |        24 
  209.5349 |         0          0          0          0          0          0 |        43 
  209.6035 |         0          0          0          0          0          0 |        58 
    211.25 |         0          0          0          0          0          0 |        24 
  211.3333 |         0          0          0          6          0          0 |         6 
  212.8333 |         0          0          0          0          0          0 |         6 
  213.2885 |         0          0          0          0          0          0 |        52 
  213.6897 |         1          0          0          0          0          0 |         1 
   214.381 |         0          0          0          0          0          0 |        21 
  216.3182 |         0          0          0          0          0          0 |        22 
  216.4706 |         0          0          0          0          0          0 |        17 
  217.7347 |         0          0          0          0          0          0 |        49 
       218 |         0          0          0          0          0          0 |         2 
  220.4348 |         0          0          0          0          0          0 |        23 
  220.5789 |         0          0          0          0          0          0 |        19 
  221.2326 |         0          0          0          0          0          0 |        43 
  221.5714 |         0          0          0          0          0          0 |         1 
       222 |         0          0          0          2          0          0 |         2 
  223.4706 |         0          0          0          0          0          0 |        34 
  223.7369 |         0          0          0          0          0          0 |        19 
       224 |         0          0          0          1          0          0 |         1 
  226.4286 |         0          0          0          0          0          0 |         7 
     226.5 |         0          0          0          2          0          0 |         2 
  226.5833 |         0          0          0          0          0          0 |        12 
   227.375 |         0          0          0          0          0          0 |         8 
  227.4118 |         0          0          0          0          0          0 |        17 
     231.4 |         0          0          0          0          0          0 |         1 
  231.5217 |         0          0          0          0          0          0 |        23 
  234.2174 |         0          0         23          0          0          0 |        23 
    235.55 |         0          0          0          0          0          0 |        20 
  237.3428 |         0          0          0          0          0          0 |        35 
  239.4839 |         0          0          0          0          0          0 |        31 
    239.75 |         0          0          4          0          0          0 |         4 
  240.6905 |         0         42          0          0          0          0 |        42 
       241 |         2          0          0          0          0          0 |         2 
     241.4 |         0          0          0          0          0          0 |         5 
       245 |         0          0          0          0          0          0 |         2 
  248.5909 |         0         22          0          0          0          0 |        22 
    251.35 |         0          0          0          0          0          0 |        20 
     254.4 |         0          0          0          0          0          0 |         5 
  255.1282 |         0          0         39          0          0          0 |        39 
     255.4 |         0          0          0          0          0          0 |         5 
  257.9047 |         0          0          0          0          0          0 |        21 
       259 |         0          0          0          0          0          0 |         3 
  260.9286 |         0          0          0          0          0          0 |        14 
  264.1739 |         0          0          0          0          0         23 |        23 
  264.3889 |         0          0          0          0          0          0 |        18 
  266.3333 |         0          0          0          3          0          0 |         3 
  267.1639 |         0          0          0          0         61          0 |        61 
  269.4375 |         0          0          0          0          0          0 |        16 
  271.3333 |         0          0          0          0          0          0 |        15 
     271.5 |         0          0          0          0          0          0 |         4 
     271.9 |         0          0          0          0          0          0 |        10 
       282 |         0          0          0          0          0          0 |        11 
   283.875 |         0          0          0          0          0          0 |        16 
  284.0732 |         0          0          0          0          0          0 |        41 
  288.7333 |         0          0          0          0          0          0 |        15 
    289.25 |         0          0          0          0          0          0 |         4 
     289.8 |         0          0          0          0          0          0 |         5 
  295.1864 |         0          0          0          0          0          0 |        59 
  296.5122 |         0          0          0          0          0          0 |        41 
  299.6667 |         0          0          0          0          3          0 |         3 
     300.5 |         0          0          0          0          0          0 |         2 
  301.8571 |         0          0          0          0          0          0 |         7 
  302.3333 |         0          0          0          3          0          0 |         3 
  304.2758 |         0          0          0          0          0          0 |        29 
  304.2778 |        17          0          0          0          0          0 |        17 
  305.7222 |         0          0          0         18          0          0 |        18 
  307.6667 |         0          0          0          3          0          0 |         3 
     311.4 |         0          0          0          0          0          0 |         5 
  311.4615 |         0          0          0          0          0          0 |        26 
    312.75 |         0          0          0         16          0          0 |        16 
  320.3333 |         0          0          0          0          3          0 |         3 
     320.8 |         0          0          5          0          0          0 |         5 
  325.3333 |         0          0          0          0          0          0 |         3 
     325.8 |         0          5          0          0          0          0 |         5 
    327.75 |         0          0          0          0          0          0 |         4 
  334.8571 |         0         14          0          0          0          0 |        14 
       341 |         2          0          0          0          0          0 |         2 
       345 |         0          0          0          0          0          0 |         1 
       353 |         0          0          0          0          0          0 |         3 
  355.1538 |         0          0         13          0          0          0 |        13 
  356.1429 |        13          0          0          0          0          0 |        13 
  360.1429 |         0          0          0          0          0          0 |        14 
       362 |         0          0          0          0          0          0 |         3 
     362.5 |         0          0          0          0          0          0 |         2 
  364.0833 |         0          0          0          0          0          0 |        12 
     365.3 |         0          0          0          0          0          0 |        10 
       368 |         0          0          0          0          0          0 |         6 
  375.7097 |         0          0          0          0          0          0 |        31 
  379.3333 |         0          0          3          0          0          0 |         3 
     394.5 |         0          0          0          0          0          0 |         4 
       402 |         0          0          0          0          4          0 |         4 
       421 |         0          0          0          0          0          0 |        11 
     422.6 |         0          0          0          0          0          0 |         5 
     427.9 |         0          0          0          0          0          0 |        10 
       436 |         0          0          0          0          0          0 |         1 
  440.1765 |         0          0          0          0          0          0 |        17 
  443.4286 |         0          0          0          0          0          0 |         7 
     454.9 |         0          0          0          0          0          0 |        10 
    458.25 |         0          0          0          0          0          0 |         4 
     458.5 |         0          0          0          0          0          0 |         6 
       462 |         0          0          0          0          0          1 |         1 
  463.6667 |         0          0          0          0          0          0 |         3 
  469.1429 |         0          0          0          0          0          0 |        14 
  469.3077 |         0          0          0          0          0          0 |        13 
     474.1 |         0          0          0          0          0          0 |        10 
     499.2 |         0          0          5          0          0          0 |         5 
       506 |         0          0          0          0          2          0 |         2 
     517.5 |         0          0          0          0          0          0 |         2 
       520 |         0          0          0          0          1          0 |         1 
  523.1667 |         5          0          0          0          0          0 |         5 
       529 |         0          0          0          0          0          0 |         2 
       535 |         0          0          0          0          0          0 |         4 
       544 |         0          0          0          0          0          1 |         1 
  545.7143 |         0          0          0          0          7          0 |         7 
   575.125 |         0          0          0          0          0          0 |         8 
       577 |         0          2          0          0          0          0 |         2 
       598 |         0          0          0          0          0          0 |         1 
    606.75 |         0          0          0          0          0          0 |         4 
     610.1 |         0          0          0          0          0          0 |        10 
    628.25 |         0          0          0          0          0          0 |         4 
  633.1111 |         0          0          0          0          0          0 |         9 
    633.75 |         0          4          0          0          0          0 |         4 
       665 |         0          0          0          0          0          0 |         1 
     668.2 |         0          0          0          0          0          0 |         5 
       684 |         0          0          0          0          0          0 |         1 
   684.625 |         1          0          0          0          0          0 |         1 
    687.75 |         0          0          0          0          0          0 |         4 
    712.25 |         0          0          0          0          0          0 |         8 
       714 |         0          0          0          0          0          0 |         1 
  736.6667 |         0          0          0          3          0          0 |         3 
       753 |         0          0          0          0          0          0 |         1 
       786 |         0          0          0          0          0          0 |         1 
       830 |         0          0          0          0          0          0 |         1 
       894 |         0          0          0          0          0          0 |         4 
     952.5 |         0          0          0          0          0          0 |        14 
       976 |         0          0          0          0          0          0 |         1 
       981 |         0          0          0          0          0          0 |         1 
      1005 |         1          0          0          0          0          0 |         1 
    1126.5 |         0          0          0          0          0          0 |         2 
   1148.75 |         0          0          0          0          0          0 |         4 
    1256.5 |         0          0          0          0          0          0 |         2 
  1265.667 |         3          0          0          0          0          0 |         3 
    1354.5 |         0          0          0          0          0          0 |         2 
  1371.333 |         0          0          0          0          0          0 |         3 
      1385 |         0          0          0          0          0          0 |         2 
      2945 |         0          0          0          0          0          0 |         1 
-----------+------------------------------------------------------------------+----------
     Total |     1,167      1,155      1,114      1,062      1,053        923 |    20,548 


. tabstat UAA_WEIGHT, by(YE_AR)

Summary for variables: UAA_WEIGHT
     by categories of: YE_AR 

   YE_AR |      mean
---------+----------
    1995 |  124.5751
    1996 |  110.2719
    1997 |  107.7924
    1998 |  116.7179
    1999 |  110.5878
    2000 |  110.5759
    2001 |  103.6443
    2002 |  95.73416
    2003 |  91.63891
    2004 |  89.18189
    2005 |  95.39259
    2006 |  97.55653
    2007 |  97.17608
    2008 |  89.98268
    2009 |  91.80431
    2010 |  93.69488
    2011 |  99.93289
    2012 |  85.85807
---------+----------
   Total |  100.7057
--------------------

. tab YE_AR

      YE_AR |      Freq.     Percent        Cum.
------------+-----------------------------------
       1995 |      1,165        5.67        5.67
       1996 |      1,155        5.62       11.29
       1997 |      1,190        5.79       17.08
       1998 |      1,099        5.35       22.43
       1999 |      1,116        5.43       27.86
       2000 |      1,113        5.42       33.28
       2001 |      1,161        5.65       38.93
       2002 |      1,215        5.91       44.84
       2003 |      1,249        6.08       50.92
       2004 |      1,270        6.18       57.10
       2005 |      1,182        5.75       62.85
       2006 |      1,159        5.64       68.49
       2007 |      1,167        5.68       74.17
       2008 |      1,155        5.62       79.79
       2009 |      1,114        5.42       85.22
       2010 |      1,062        5.17       90.38
       2011 |      1,053        5.12       95.51
       2012 |        923        4.49      100.00
------------+-----------------------------------
      Total |     20,548      100.00

. describe

Contains data from ../../../OrigData/FarmPriceVolMSM/svy_weights.dta
  obs:        20,548                          
 vars:             6                          12 Jun 2014 10:33
 size:       595,892                          
--------------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage  display     value
variable name   type   format      label      variable label
--------------------------------------------------------------------------------------------------------------------------------------------------------------------
YE_AR           int    %10.0g                 
FARM_CODE       int    %10.0g                 
REGION_CODE     byte   %10.0g                 
ESU_WEIGHT      double %10.0g                 
UAA_WEIGHT      double %10.0g                 
tso_weight      double %10.0g                 
--------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by:  FARM_CODE  YE_AR

. use ../../../OrigData/FarmPriceVolMSM/svy_farm, clear

. tab YE_AR

      YE_AR |      Freq.     Percent        Cum.
------------+-----------------------------------
       1984 |      1,504        4.07        4.07
       1985 |      1,449        3.92        7.99
       1986 |      1,519        4.11       12.10
       1987 |      1,466        3.97       16.07
       1988 |      1,438        3.89       19.96
       1989 |      1,464        3.96       23.92
       1990 |      1,395        3.78       27.70
       1991 |      1,384        3.75       31.44
       1992 |      1,407        3.81       35.25
       1993 |      1,449        3.92       39.17
       1994 |      1,301        3.52       42.69
       1995 |      1,239        3.35       46.05
       1996 |      1,209        3.27       49.32
       1997 |      1,241        3.36       52.68
       1998 |      1,129        3.06       55.73
       1999 |      1,148        3.11       58.84
       2000 |      1,157        3.13       61.97
       2001 |      1,229        3.33       65.30
       2002 |      1,241        3.36       68.65
       2003 |      1,281        3.47       72.12
       2004 |      1,270        3.44       75.56
       2005 |      1,217        3.29       78.85
       2006 |      1,160        3.14       81.99
       2007 |      1,207        3.27       85.26
       2008 |      1,193        3.23       88.49
       2009 |      1,142        3.09       91.58
       2010 |      1,078        2.92       94.49
       2011 |      1,077        2.91       97.41
       2012 |        958        2.59      100.00
------------+-----------------------------------
      Total |     36,952      100.00

. ds FARM*
FARM_CODE     FARM_NUM_M~O  FARM_MD_AGE   FARM_MD_SE~E  FARM_MD_HO~O  FARM_PRE_S~O  FARM_THIRD~O  FARM_PE~E_NO  F~5_15YRS_~O
FARM_SYSTEM   FARM_MD_MA~S  FARM_MD_OT~Y  FARM_MD_OC~E  FARM_MD_IN~E  FARM_PRIMA~O  FARM_FULL_~O  FARM_PE~R_NO  F~GT65YRS_~O
FARM_TYPE_~E  FARM_MD_GE~R  FARM_MD_PR~R  FARM_MD_OT~O  FARM_HOUSE~O  FARM_SECON~O  FARM_PART_~O  F~LT5YRS_M~O  FARM_FORES~A

. tabstat FARM_SYSTEM, by(YE_AR )

Summary for variables: FARM_SYSTEM
     by categories of: YE_AR 

   YE_AR |      mean
---------+----------
    1984 |  2.910738
    1985 |  3.007741
    1986 |  3.001333
    1987 |  2.969613
    1988 |  2.934043
    1989 |  2.909722
    1990 |  2.938909
    1991 |  2.994118
    1992 |  3.015942
    1993 |  3.858351
    1994 |  3.878527
    1995 |  3.794554
    1996 |       3.8
    1997 |  3.564706
    1998 |  3.525023
    1999 |  3.464158
    2000 |  3.428571
    2001 |  3.349315
    2002 |  3.520988
    2003 |  3.557246
    2004 |  3.601302
    2005 |  3.590525
    2006 |  3.637619
    2007 |  3.803824
    2008 |  3.836134
    2009 |  3.844873
    2010 |  3.879406
    2011 |  3.864991
    2012 |  3.789969
---------+----------
   Total |  3.427184
--------------------

. ds UAA*
UAA_SIZE

. tabstat UAA_SIZE, by(YE_AR )

Summary for variables: UAA_SIZE
     by categories of: YE_AR 

   YE_AR |      mean
---------+----------
    1984 |  50.18949
    1985 |  48.40081
    1986 |  48.50966
    1987 |   50.9429
    1988 |   51.9319
    1989 |  48.97906
    1990 |  49.12445
    1991 |  48.61072
    1992 |  48.76954
    1993 |  44.27153
    1994 |  44.10414
    1995 |   44.6987
    1996 |  44.02152
    1997 |  47.06729
    1998 |   46.8032
    1999 |  46.80299
    2000 |  49.18528
    2001 |  49.99889
    2002 |  52.25162
    2003 |  51.67208
    2004 |  50.90588
    2005 |  49.84325
    2006 |  51.93424
    2007 |  52.34928
    2008 |  53.50034
    2009 |  54.09504
    2010 |  55.80103
    2011 |  56.50182
    2012 |  58.82105
---------+----------
   Total |  49.82134
--------------------

. dir ../../../OutData/FarmPriceVolMSM/
  <dir>   9/02/14 16:20  .                 
  <dir>   9/02/14 16:20  ..                
  <dir>   8/27/14 12:40  1                 
  <dir>   8/17/14 20:47  3                 
2379.6k   8/18/14 13:41  bulkfeed_fed_livestock_eu_1.dta
3355.6k   8/18/14 13:41  bulkfeed_fed_livestock_eu_2.dta
8293.0k   8/18/14 13:41  bulkfeed_fed_livestock_eu_3.dta
1443.5k   8/18/14 13:45  car_electricity_telephone.dta
4709.0k   8/18/14 13:40  cattle_dairy_boarding_com.dta
  25.9M   8/18/14 13:36  crops_go_and_expnses_vars_count.dta
 289.6k   8/18/14 13:47  crops_total_dc.dta
 939.7k   8/18/14 13:57  curr_misc_cash_crops_go.dta
4470.3k   8/18/14 13:56  deer_goats_misc_dc_eu.dta
 339.4k   8/18/14 13:45  depreciation_of_buildings.dta
 339.4k   8/18/14 13:45  depreciation_of_land_imps.dta
 452.4k   8/18/14 13:45  depreciation_of_machinery.dta
  21.3M   8/18/14 13:51  d_cattle_total_direct_costs.dta
  17.4M   8/18/14 13:51  d_cattle_winter_forage_eu.dta
 723.0k   8/18/14 13:50  d_conc_fed_cattle_eu.dta
 723.0k   8/18/14 13:49  d_conc_fed_dairy_eu.dta
 723.0k   8/18/14 13:52  d_conc_fed_sheep_eu.dta
1946.5k   8/18/14 13:58  d_dairy_gross_output.dta
1675.0k   8/18/14 13:49  d_dairy_pasture_eu.dta
3533.2k   8/18/14 13:50  d_dairy_prod_misc_dc_eu.dta
  22.8M   8/18/14 13:50  d_dairy_total_direct_costs.dta
  17.2M   8/18/14 13:50  d_dairy_winter_forage_eu.dta
  18.7M   8/18/14 13:56  d_deer_goats_winter_forage_eu.dta
 794.1k   8/18/14 13:55  d_deer_pasture_eu.dta
1658.2k   8/18/14 13:58  d_gross_output_cattle.dta
1067.3k   8/18/14 13:58  d_gross_output_horses.dta
  10.8M   8/18/14 13:58  d_gross_output_pigs_eu.dta
2515.7k   8/18/14 13:58  d_gross_output_sheep_and_wool_eu.dta
  19.6M   8/18/14 13:56  d_horses_direct_costs.dta
1092.7k   8/18/14 13:54  d_horse_pasture_eu.dta
  16.9M   8/18/14 13:56  d_horse_winter_forage_eu.dta
 939.9k   8/18/14 13:56  d_inter_enterpise_trans_eu.dta
1730.9k   8/18/14 13:51  d_livestock_misc_dc_eu.dta
 793.8k   8/18/14 13:51  d_milk_and_milk_subs_no.dta
  23.7M   8/18/14 13:56  d_other_direct_costs.dta
2787.6k   8/18/14 13:58  d_other_gross_output.dta
2167.4k   8/18/14 13:53  d_pigs_total_dc_eu.dta
2485.8k   8/18/14 13:58  d_poultry_gross_output_eu.dta
1878.5k   8/18/14 13:54  d_poultry_total_dc_eu.dta
1301.3k   8/18/14 13:52  d_roots_direct_costs_eu.dta
1730.9k   8/18/14 13:53  d_sheep_misc_dc_eu.dta
1092.7k   8/18/14 13:52  d_sheep_pasture_eu.dta
  21.2M   8/18/14 13:53  d_sheep_total_direct_costs.dta
  16.7M   8/18/14 13:53  d_sheep_winter_forage_eu.dta
1384.3k   8/18/14 13:56  d_total_livestock_direct_costs.dta
1383.3k   8/18/14 13:58  d_total_livestock_gross_output.dta
1092.7k   8/18/14 13:50  d_total_pasture_eu.dta
 150.5M   8/18/14 13:46  farm_boardingi_fod_dc_0.dta
 937.3k   8/18/14 13:46  farm_boardingi_fod_dc_1.dta
2457.6k   8/18/14 13:51  fed_cattle_tonnes_ha.dta
2168.6k   8/18/14 13:50  fed_dairy_tonnes_ha.dta
1879.5k   8/18/14 13:55  fed_deer_tonnes_ha.dta
1879.5k   8/18/14 13:56  fed_goats_tonnes_ha.dta
1879.5k   8/18/14 13:54  fed_horses_tonnes_ha.dta
1735.0k   8/18/14 13:53  fed_sheep_tonnes_ha.dta
2695.3k   8/18/14 13:46  FodderCrops_DC.dta
2112.6k   8/18/14 13:46  FodderCrops_DC_1.dta
3276.6k   8/18/14 13:58  FodderCrops_GO.dta
 432.4k   9/02/14 16:20  hay_ha.dta        
 432.4k   9/02/14 16:20  hay_silage_ha.dta 
1735.0k   8/18/14 13:36  hay_sil_fed_unit_cost.dta
  53.8M   8/18/14 13:45  hired_labour_casual_excl.dta
1897.9k   8/18/14 13:37  horses_boarding_in_out_com.dta
1586.6k   8/18/14 13:54  horses_misc_dc_eu.dta
 332.6k   8/18/14 13:45  interest_payments.dta
  <dir>   8/18/14 13:44  Logs              
2886.2k   8/18/14 13:45  machinery_op_expenses.dta
 123.8M   8/18/14 13:28  merged_crop_tables.dta
 122.1M   8/18/14 13:28  merged_crop_tables_0.dta
 174.0M   8/18/14 13:31  merged_crop_tables_1.dta
 254.3M   8/18/14 13:32  merged_crop_tables_2.dta
 540.6M   8/18/14 13:36  merged_crop_tables_3.dta
2454.6k   8/18/14 13:45  misc_overhead_costs.dta
 289.6k   8/18/14 13:58  origsubset.dta    
 289.6k   8/18/14 13:47  other_cashcrops_ind_dc.dta
 289.6k   8/18/14 13:49  oth_csh_crop_ind_dc.dta
  46.5k   8/18/14 13:45  paid_labour.dta   
 434.1k   9/02/14 16:20  pasture_ha.dta    
1296.8k   9/02/14 16:20  pasture_hay_silage_ha.dta
2161.1k   9/02/14 16:20  pasture_hay_silage_ha_0.dta
1051.6k   8/18/14 13:45  power_machinery_totals.dta
  <dir>   8/17/14 20:22  sc_simulation     
 289.6k   8/18/14 13:48  select_crops_dc.dta
 289.6k   8/18/14 13:48  setaside_dc.dta   
3584.4k   8/18/14 13:38  sheep_boarding_in_out_com.dta
 432.4k   9/02/14 16:20  silage_ha.dta     
 289.6k   8/18/14 13:41  sum_grazing_total_dc_eu.dta
 289.6k   8/18/14 13:50  sum_i_conc_fed_cattle.dta
 289.6k   8/18/14 13:49  sum_i_conc_fed_dairy.dta
 289.6k   8/18/14 13:54  sum_i_conc_fed_horses.dta
 289.6k   8/18/14 13:53  sum_i_conc_fed_pigs.dta
 289.6k   8/18/14 13:54  sum_i_conc_fed_poultry.dta
 289.6k   8/18/14 13:52  sum_i_conc_fed_sheep.dta
  59.1M   8/18/14 13:38  svy_cattle_0.dta  
  90.5M   8/18/14 13:40  svy_cattle_1.dta  
  96.8M   8/18/14 13:40  svy_cattle_2.dta  
 107.2M   8/18/14 13:28  svy_crops_1.dta   
  21.4M   9/02/14 16:20  svy_crops_casual_labour_1.dta
 867.7k   8/18/14 13:46  svy_crops_fodder_dc.dta
 434.1k   8/18/14 13:57  svy_crops_fodder_go.dta
  43.2M   8/18/14 13:28  svy_crop_disposal_1.dta
  20.3M   9/02/14 16:20  svy_crop_expenses_1.dta
3980.0k   9/02/14 16:20  svy_crop_fertilizer_1.dta
6475.1k   9/02/14 16:20  svy_crop_fertilizer_2.dta
  29.8M   8/18/14 13:44  svy_dairy_produce_1.dta
  33.3M   8/18/14 13:45  svy_dairy_produce_2.dta
  15.5M   8/18/14 13:40  svy_deer_1.dta    
  22.3M   8/18/14 13:40  svy_grazing_1.dta 
  22.5M   8/18/14 13:41  svy_grazing_2.dta 
 510.2k   8/18/14 13:46  svy_grazing_fodder_dc.dta
1965.8k   8/18/14 13:57  svy_grazing_fodder_go.dta
  27.9M   8/18/14 13:36  svy_hay_silage_0.dta
  34.4M   8/18/14 13:36  svy_hay_silage_1.dta
 364.6k   8/18/14 13:46  svy_hay_silage_fodder_dc.dta
 723.2k   8/18/14 13:57  svy_hay_silage_fodder_go.dta
  19.6M   8/18/14 13:37  svy_horses_other_0.dta
  22.7M   8/18/14 13:37  svy_horses_other_1.dta
  23.5M   8/18/14 13:41  svy_livestock_expenses_1.dta
  67.2M   8/18/14 13:44  svy_livestock_expenses_2.dta
 289.6k   8/18/14 13:47  svy_misc_cash_crops_dc.dta
5782.0k   8/18/14 13:58  svy_misc_cash_crops_go.dta
  10.7M   8/18/14 13:45  svy_pigs_1.dta    
  19.0M   8/18/14 13:45  svy_poultry_1.dta 
  33.4M   8/18/14 13:37  svy_sheep_0.dta   
  39.0M   8/18/14 13:37  svy_sheep_0pc.dta 
  49.1M   8/18/14 13:38  svy_sheep_1.dta   
  53.7M   8/18/14 13:38  svy_sheep_2.dta   
  36.9M   8/18/14 13:45  svy_subsidies_grants_1.dta
1384.3k   8/18/14 13:49  total_crops_direct_costs.dta
9831.6k   8/18/14 13:58  total_crops_gross_output.dta
1089.9k   8/18/14 13:40  total_lu_home_grazing.dta
1590.4k   8/18/14 13:41  wint_forg_fed_unit_cost.dta

. merge 1:1 FARM_CODE YE_AR using ../../../OutData/FarmPriceVolMSM/d_dairy_gross_output.dta
FARM_CODE was int now long

    Result                           # of obs.
    -----------------------------------------
    not matched                            83
        from master                        83  (_merge==1)
        from using                          0  (_merge==2)

    matched                            36,869  (_merge==3)
    -----------------------------------------

. preserve do Cr_d_sample_cell.do
varlist not allowed
r(101);

. preserve

. do Cr_d_sample_cell.do

. *******************************************
. * Create sample cell membership variable
. *******************************************
. 
. 
. * Define column criterion (common to modern and historic tables)
. local col1 "UAA_SIZE <   10 "

. local col2 "UAA_SIZE >=  10 & UAA_SIZE <  20" 

. local col3 "UAA_SIZE >=  20 & UAA_SIZE <  30" 

. local col4 "UAA_SIZE >=  30 & UAA_SIZE <  50" 

. local col5 "UAA_SIZE >=  50 & UAA_SIZE < 100" 

. local col6 "UAA_SIZE >= 100" 

. 
. 
. * Use these to define a variable for tables later
. capture drop tableBcol

. gen int tableBcol = . 
(36952 missing values generated)

. replace tableBcol = 1 if `col1'
(2841 real changes made)

. replace tableBcol = 2 if `col2'
(5406 real changes made)

. replace tableBcol = 3 if `col3'
(6001 real changes made)

. replace tableBcol = 4 if `col4'
(9752 real changes made)

. replace tableBcol = 5 if `col5'
(9295 real changes made)

. replace tableBcol = 6 if `col6'
(3657 real changes made)

. 
. 
. * Label this variable and its values for tables later
. label define tableBcol 1 "< 10", modify

. label define tableBcol 2 "10 - 20", modify

. label define tableBcol 3 "20 - 30", modify

. label define tableBcol 4 "30 - 50", modify

. label define tableBcol 5 "50 - 100", modify

. label define tableBcol 6 ">100", modify

. 
. label values tableBcol tableBcol 

. label var tableBcol "Farm size categories (UAA)."

. 
. 
. 
. 
. 
. 
. *--------------------------------------------------------------------
. * Modern cell designations
. *--------------------------------------------------------------------
. 
. * Define modern row criterion (note there is no system 3)
. local row1 "FARM_SYSTEM == 1"

. local row2 "FARM_SYSTEM == 2"

. local row3 "FARM_SYSTEM == 4"

. local row4 "FARM_SYSTEM == 5"

. local row5 "FARM_SYSTEM == 6"

. local row6 "FARM_SYSTEM == 7"

. 
. 
. 
. * Assign modern cell designations based on row and column criterion
. *  (note that cell index numbers 
. capture drop D_SAMPLE_CELL

. gen int D_SAMPLE_CELL = .
(36952 missing values generated)

. replace D_SAMPLE_CELL =  1 if `row1' & `col1'
(263 real changes made)

. replace D_SAMPLE_CELL =  2 if `row1' & `col2'
(908 real changes made)

. replace D_SAMPLE_CELL =  3 if `row1' & `col3'
(1531 real changes made)

. replace D_SAMPLE_CELL =  4 if `row1' & `col4'
(2904 real changes made)

. replace D_SAMPLE_CELL =  5 if `row1' & `col5'
(2587 real changes made)

. replace D_SAMPLE_CELL =  6 if `row1' & `col6'
(553 real changes made)

. 
. replace D_SAMPLE_CELL =  7 if `row2' & `col1'
(794 real changes made)

. replace D_SAMPLE_CELL =  8 if `row2' & `col2'
(1149 real changes made)

. replace D_SAMPLE_CELL =  9 if `row2' & `col3'
(941 real changes made)

. replace D_SAMPLE_CELL = 10 if `row2' & `col4'
(1504 real changes made)

. replace D_SAMPLE_CELL = 11 if `row2' & `col5'
(1852 real changes made)

. replace D_SAMPLE_CELL = 12 if `row2' & `col6'
(699 real changes made)

. 
. replace D_SAMPLE_CELL = 19 if `row3' & `col1'
(503 real changes made)

. replace D_SAMPLE_CELL = 20 if `row3' & `col2'
(1445 real changes made)

. replace D_SAMPLE_CELL = 21 if `row3' & `col3'
(1410 real changes made)

. replace D_SAMPLE_CELL = 22 if `row3' & `col4'
(1914 real changes made)

. replace D_SAMPLE_CELL = 23 if `row3' & `col5'
(1130 real changes made)

. replace D_SAMPLE_CELL = 24 if `row3' & `col6'
(560 real changes made)

. 
. replace D_SAMPLE_CELL = 25 if `row4' & `col1'
(322 real changes made)

. replace D_SAMPLE_CELL = 26 if `row4' & `col2'
(956 real changes made)

. replace D_SAMPLE_CELL = 27 if `row4' & `col3'
(926 real changes made)

. replace D_SAMPLE_CELL = 28 if `row4' & `col4'
(1340 real changes made)

. replace D_SAMPLE_CELL = 29 if `row4' & `col5'
(1126 real changes made)

. replace D_SAMPLE_CELL = 30 if `row4' & `col6'
(277 real changes made)

. 
. replace D_SAMPLE_CELL = 31 if `row5' & `col1'
(162 real changes made)

. replace D_SAMPLE_CELL = 32 if `row5' & `col2'
(563 real changes made)

. replace D_SAMPLE_CELL = 33 if `row5' & `col3'
(580 real changes made)

. replace D_SAMPLE_CELL = 34 if `row5' & `col4'
(1006 real changes made)

. replace D_SAMPLE_CELL = 35 if `row5' & `col5'
(1033 real changes made)

. replace D_SAMPLE_CELL = 36 if `row5' & `col6'
(562 real changes made)

. 
. replace D_SAMPLE_CELL = 37 if `row6' & `col1'
(54 real changes made)

. replace D_SAMPLE_CELL = 38 if `row6' & `col2'
(200 real changes made)

. replace D_SAMPLE_CELL = 39 if `row6' & `col3'
(285 real changes made)

. replace D_SAMPLE_CELL = 40 if `row6' & `col4'
(594 real changes made)

. replace D_SAMPLE_CELL = 41 if `row6' & `col5'
(949 real changes made)

. replace D_SAMPLE_CELL = 42 if `row6' & `col6'
(744 real changes made)

. 
. * Remove hill farms' cell designation
. replace D_SAMPLE_CELL = . if D_SOIL_GROUP==3
(4592 real changes made, 4592 to missing)

. 
. *--------------------------------------------------------------------
. 
. 
. 
. 
. 
. 
. *--------------------------------------------------------------------
. * Historic cell designations
. *--------------------------------------------------------------------
. 
. * Define historic row criterion
. local row1 "FARM_SYSTEM_HISTORIC == 1"

. local row2 "FARM_SYSTEM_HISTORIC == 2"

. local row3 "FARM_SYSTEM_HISTORIC == 3"

. local row4 "FARM_SYSTEM_HISTORIC == 4"

. local row5 "FARM_SYSTEM_HISTORIC == 5"

. local row6 "FARM_SYSTEM_HISTORIC == 6"

. local row7 "FARM_SYSTEM_HISTORIC == 7"

. local row8 "FARM_SYSTEM_HISTORIC == 8"

. 
. 
. * Assign historic cell designations based on row and column criterion
. capture drop D_SAMPLE_CELL_HISTORIC

. gen int D_SAMPLE_CELL_HISTORIC = .
(36952 missing values generated)

. replace D_SAMPLE_CELL_HISTORIC =  1 if `row1' & `col1'
FARM_SYSTEM_HISTORIC not found
r(111);

end of do-file

r(111);

. do createWeights.do

. capture log close
