{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_08_13.txt
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}13 Aug 2013, 14:03:59
{txt}
{com}. di  "Job  Started  at  $S_TIME  on $S_DATE"
{res}Job  Started  at  14:03:59  on 13 Aug 2013
{txt}
{com}. cmdlog using logs/$project$datestamp.cmd.txt, replace
{txt}(cmdlog D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_08_13.cmd.txt opened)

{com}. 
. 
. * model you selected above is run here
. macro list _model1command
{txt}{p 0 16}
_model1command:{space 1}{res}{res}sfpanel lntotalinputs lndotomkgl lnPCompoundfeedingstuffsforcatt lnPCerealsandmillingbyproducts lnPOilcakes lnPFERTILISERSANDSOILIMPROVERS lnPElectricity lnPMotorfuels lnPVETERINARYEXPENSES lnPSEEDSANDPLANTINGSTOCK lnPMACHINERYANDOTHEREQUIPMENT lnPMAINTENANCEOFBUILDINGS lnPOTHERGOODSANDSERVICES i.countrycode2 year, model(bc95) cost d(tnormal) emean(fdratio, noconstant) usigma(fdratio, noconstant) vsigma(fdratio, noconstant) marginal(fdratio)
{p_end}
{txt}
{com}. `model1command' 

{res}
{txt}initial:{col 16}Log likelihood = {res:-27008.961}
Iteration 0:{space 3}Log likelihood = {res:-27008.961}  
Iteration 1:{space 3}Log likelihood = {res:-26736.629}  (backed up)
Iteration 2:{space 3}Log likelihood = {res:-24634.608}  (backed up)
Iteration 3:{space 3}Log likelihood = {res:-20523.541}  (backed up)
Iteration 4:{space 3}Log likelihood = {res:-19859.945}  (backed up)
Iteration 5:{space 3}Log likelihood = {res: -19388.43}  (backed up)
Iteration 6:{space 3}Log likelihood = {res:-18871.286}  (backed up)
Iteration 7:{space 3}Log likelihood = {res:-18813.775}  (backed up)
Iteration 8:{space 3}Log likelihood = {res:-18613.106}  (backed up)
Iteration 9:{space 3}Log likelihood = {res:-18590.383}  (backed up)
Iteration 10:{space 2}Log likelihood = {res:-18561.586}  (backed up)
Iteration 11:{space 2}Log likelihood = {res:-18189.301}  (backed up)
Iteration 12:{space 2}Log likelihood = {res:-18064.715}  (backed up)
Iteration 13:{space 2}Log likelihood = {res:-18042.991}  (backed up)
Iteration 14:{space 2}Log likelihood = {res:-18019.239}  (backed up)
Iteration 15:{space 2}Log likelihood = {res:-17357.705}  (backed up)
Iteration 16:{space 2}Log likelihood = {res:-16525.756}  
Iteration 17:{space 2}Log likelihood = {res:-16238.413}  (backed up)
Iteration 18:{space 2}Log likelihood = {res:-16030.715}  
Iteration 19:{space 2}Log likelihood = {res:-15963.128}  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 20:{space 2}Log likelihood = {res:-15128.674}  
Iteration 21:{space 2}Log likelihood = {res:-15101.748}  (backed up)
Iteration 22:{space 2}Log likelihood = {res:-15096.668}  (backed up)
Iteration 23:{space 2}Log likelihood = {res:-15003.715}  (backed up)
Iteration 24:{space 2}Log likelihood = {res:-14958.431}  (backed up)
Iteration 25:{space 2}Log likelihood = {res: -14914.97}  (backed up)
Iteration 26:{space 2}Log likelihood = {res: -14881.21}  (backed up)
Iteration 27:{space 2}Log likelihood = {res:-14874.082}  (backed up)
Iteration 28:{space 2}Log likelihood = {res:-14861.332}  (backed up)
Iteration 29:{space 2}Log likelihood = {res:-14838.391}  (backed up)
Iteration 30:{space 2}Log likelihood = {res:-14815.082}  (backed up)
Iteration 31:{space 2}Log likelihood = {res:-14776.544}  (backed up)
Iteration 32:{space 2}Log likelihood = {res:-14760.247}  (backed up)
Iteration 33:{space 2}Log likelihood = {res:-14705.222}  (backed up)
Iteration 34:{space 2}Log likelihood = {res:-14684.179}  (backed up)
Iteration 35:{space 2}Log likelihood = {res:-14683.244}  (backed up)
Iteration 36:{space 2}Log likelihood = {res:-14668.194}  (backed up)
Iteration 37:{space 2}Log likelihood = {res:-14598.115}  
Iteration 38:{space 2}Log likelihood = {res:-14571.651}  
Iteration 39:{space 2}Log likelihood = {res: -14502.63}  
Iteration 40:{space 2}Log likelihood = {res:-14474.656}  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 41:{space 2}Log likelihood = {res:-14452.869}  
Iteration 42:{space 2}Log likelihood = {res:-14440.134}  (backed up)
Iteration 43:{space 2}Log likelihood = {res:-14431.766}  (backed up)
Iteration 44:{space 2}Log likelihood = {res:-14431.575}  (backed up)
Iteration 45:{space 2}Log likelihood = {res:-14420.127}  (backed up)
Iteration 46:{space 2}Log likelihood = {res:-14411.035}  (backed up)
Iteration 47:{space 2}Log likelihood = {res:-14397.174}  (backed up)
Iteration 48:{space 2}Log likelihood = {res:-14393.408}  (backed up)
Iteration 49:{space 2}Log likelihood = {res:-14392.859}  (backed up)
Iteration 50:{space 2}Log likelihood = {res:-14376.001}  (backed up)
Iteration 51:{space 2}Log likelihood = {res:-14371.458}  (backed up)
Iteration 52:{space 2}Log likelihood = {res:-14367.281}  (backed up)
Iteration 53:{space 2}Log likelihood = {res:-14357.765}  (backed up)
Iteration 54:{space 2}Log likelihood = {res: -14348.23}  (backed up)
Iteration 55:{space 2}Log likelihood = {res:-14344.665}  (backed up)
Iteration 56:{space 2}Log likelihood = {res:-14329.311}  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 57:{space 2}Log likelihood = {res:-14321.381}  
Iteration 58:{space 2}Log likelihood = {res:-14321.072}  (backed up)
Iteration 59:{space 2}Log likelihood = {res:-14318.399}  (backed up)
Iteration 60:{space 2}Log likelihood = {res:-14316.319}  (backed up)
Iteration 61:{space 2}Log likelihood = {res:-14294.092}  (backed up)
Iteration 62:{space 2}Log likelihood = {res:-14293.681}  (backed up)
Iteration 63:{space 2}Log likelihood = {res:-14286.895}  (backed up)
Iteration 64:{space 2}Log likelihood = {res:-14283.661}  (backed up)
Iteration 65:{space 2}Log likelihood = {res:-14282.765}  (backed up)
Iteration 66:{space 2}Log likelihood = {res:-14281.815}  (backed up)
Iteration 67:{space 2}Log likelihood = {res:-14280.551}  (backed up)
Iteration 68:{space 2}Log likelihood = {res:-14276.641}  (backed up)
Iteration 69:{space 2}Log likelihood = {res:-14264.979}  (backed up)
Iteration 70:{space 2}Log likelihood = {res:-14259.723}  (backed up)
Iteration 71:{space 2}Log likelihood = {res:-14251.308}  (backed up)
Iteration 72:{space 2}Log likelihood = {res:-14243.142}  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 73:{space 2}Log likelihood = {res:-14243.095}  
Iteration 74:{space 2}Log likelihood = {res:-14242.256}  (backed up)
Iteration 75:{space 2}Log likelihood = {res:-14233.198}  (backed up)
Iteration 76:{space 2}Log likelihood = {res:-14229.782}  (backed up)
Iteration 77:{space 2}Log likelihood = {res:-14228.859}  (backed up)
Iteration 78:{space 2}Log likelihood = {res:-14225.407}  (backed up)
Iteration 79:{space 2}Log likelihood = {res:-14216.843}  (backed up)
Iteration 80:{space 2}Log likelihood = {res:-14215.101}  (backed up)
Iteration 81:{space 2}Log likelihood = {res: -14214.36}  (backed up)
Iteration 82:{space 2}Log likelihood = {res:-14213.386}  (backed up)
Iteration 83:{space 2}Log likelihood = {res:-14211.326}  (backed up)
Iteration 84:{space 2}Log likelihood = {res:-14208.827}  (backed up)
Iteration 85:{space 2}Log likelihood = {res:-14207.122}  (backed up)
Iteration 86:{space 2}Log likelihood = {res:-14206.402}  (backed up)
Iteration 87:{space 2}Log likelihood = {res:-14203.833}  (backed up)
Iteration 88:{space 2}Log likelihood = {res:-14202.878}  
Iteration 89:{space 2}Log likelihood = {res:-14202.005}  
Iteration 90:{space 2}Log likelihood = {res:-14201.917}  
Iteration 91:{space 2}Log likelihood = {res:-14198.414}  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 92:{space 2}Log likelihood = {res:-14195.081}  
Iteration 93:{space 2}Log likelihood = {res:-14195.062}  (backed up)
Iteration 94:{space 2}Log likelihood = {res:-14195.057}  (backed up)
Iteration 95:{space 2}Log likelihood = {res:-14195.038}  (backed up)
Iteration 96:{space 2}Log likelihood = {res:-14194.946}  (backed up)
Iteration 97:{space 2}Log likelihood = {res:  -14194.9}  (backed up)
Iteration 98:{space 2}Log likelihood = {res:-14194.838}  (backed up)
Iteration 99:{space 2}Log likelihood = {res: -14194.75}  (backed up)
Iteration 100:{space 1}Log likelihood = {res:-14194.716}  (backed up)

Inefficiency effects model (truncated-normal){col 54}Number of obs {col 68}={col 70}{res}    21929
{txt}Group variable: {res}pid{txt}{col 51}Number of groups{col 68}={col 70}{res}     6102
{txt}Time variable: {res}year{txt}{col 49}Obs per group: min{col 68}={col 70}{res}        1
{col 64}{txt}avg{col 68}={col 70}{res}      3.6
{col 64}{txt}max{col 68}={col 70}{res}        9

{txt}{col 54}Prob > chi2   = {res}   0.0000
{txt}Log likelihood = {res}-1.419e+04{txt}{col 54}Wald chi2({res}16{txt})  = {res} 1.39e+06

{txt}{hline 32}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                  lntotalinputs{col 33}{c |}      Coef.{col 45}   Std. Err.{col 57}      z{col 65}   P>|z|{col 73}     [95% Con{col 86}f. Interval]
{hline 32}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Frontier                        {txt}{c |}
{space 21}lndotomkgl {c |}{col 33}{res}{space 2} 1.071915{col 45}{space 2} .0045093{col 56}{space 1}  237.71{col 65}{space 3}0.000{col 73}{space 4} 1.063077{col 86}{space 3} 1.080753
{txt}lnPCompoundfeedingstuffsforcatt {c |}{col 33}{res}{space 2}-2.070966{col 45}{space 2} .1626041{col 56}{space 1}  -12.74{col 65}{space 3}0.000{col 73}{space 4}-2.389664{col 86}{space 3}-1.752268
{txt}{space 1}lnPCerealsandmillingbyproducts {c |}{col 33}{res}{space 2} .0406254{col 45}{space 2}  .033835{col 56}{space 1}    1.20{col 65}{space 3}0.230{col 73}{space 4}-.0256899{col 86}{space 3} .1069407
{txt}{space 20}lnPOilcakes {c |}{col 33}{res}{space 2} .5834068{col 45}{space 2} .0918906{col 56}{space 1}    6.35{col 65}{space 3}0.000{col 73}{space 4} .4033046{col 86}{space 3}  .763509
{txt}{space 1}lnPFERTILISERSANDSOILIMPROVERS {c |}{col 33}{res}{space 2} .2812469{col 45}{space 2} .1491499{col 56}{space 1}    1.89{col 65}{space 3}0.059{col 73}{space 4}-.0110814{col 86}{space 3} .5735753
{txt}{space 17}lnPElectricity {c |}{col 33}{res}{space 2} .3853513{col 45}{space 2} .1072226{col 56}{space 1}    3.59{col 65}{space 3}0.000{col 73}{space 4} .1751989{col 86}{space 3} .5955037
{txt}{space 18}lnPMotorfuels {c |}{col 33}{res}{space 2}-.4191153{col 45}{space 2} .0909103{col 56}{space 1}   -4.61{col 65}{space 3}0.000{col 73}{space 4}-.5972962{col 86}{space 3}-.2409343
{txt}{space 10}lnPVETERINARYEXPENSES {c |}{col 33}{res}{space 2}-.0912508{col 45}{space 2}  .323884{col 56}{space 1}   -0.28{col 65}{space 3}0.778{col 73}{space 4}-.7260518{col 86}{space 3} .5435502
{txt}{space 7}lnPSEEDSANDPLANTINGSTOCK {c |}{col 33}{res}{space 2}-.0221479{col 45}{space 2} .1113278{col 56}{space 1}   -0.20{col 65}{space 3}0.842{col 73}{space 4}-.2403464{col 86}{space 3} .1960505
{txt}{space 2}lnPMACHINERYANDOTHEREQUIPMENT {c |}{col 33}{res}{space 2} 2.670806{col 45}{space 2}  .260103{col 56}{space 1}   10.27{col 65}{space 3}0.000{col 73}{space 4} 2.161014{col 86}{space 3} 3.180599
{txt}{space 6}lnPMAINTENANCEOFBUILDINGS {c |}{col 33}{res}{space 2}-.3017406{col 45}{space 2} .2945825{col 56}{space 1}   -1.02{col 65}{space 3}0.306{col 73}{space 4}-.8791117{col 86}{space 3} .2756304
{txt}{space 7}lnPOTHERGOODSANDSERVICES {c |}{col 33}{res}{space 2} .2071242{col 45}{space 2} .1721116{col 56}{space 1}    1.20{col 65}{space 3}0.229{col 73}{space 4}-.1302083{col 86}{space 3} .5444567
{txt}{space 31} {c |}
{space 19}countrycode2 {c |}
{space 29}2  {c |}{col 33}{res}{space 2}-.1332171{col 45}{space 2} .0270594{col 56}{space 1}   -4.92{col 65}{space 3}0.000{col 73}{space 4}-.1862525{col 86}{space 3}-.0801817
{txt}{space 29}3  {c |}{col 33}{res}{space 2}-.1660824{col 45}{space 2} .0177246{col 56}{space 1}   -9.37{col 65}{space 3}0.000{col 73}{space 4} -.200822{col 86}{space 3}-.1313427
{txt}{space 29}4  {c |}{col 33}{res}{space 2} .0133024{col 45}{space 2} .0202236{col 56}{space 1}    0.66{col 65}{space 3}0.511{col 73}{space 4}-.0263351{col 86}{space 3} .0529398
{txt}{space 31} {c |}
{space 27}year {c |}{col 33}{res}{space 2}-.0119739{col 45}{space 2} .0038238{col 56}{space 1}   -3.13{col 65}{space 3}0.002{col 73}{space 4}-.0194685{col 86}{space 3}-.0044793
{txt}{space 26}_cons {c |}{col 33}{res}{space 2} 19.18818{col 45}{space 2} 7.646053{col 56}{space 1}    2.51{col 65}{space 3}0.012{col 73}{space 4} 4.202191{col 86}{space 3} 34.17417
{txt}{hline 32}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Mu                              {txt}{c |}
{space 24}fdratio {c |}{col 33}{res}{space 2} 1.106109{col 45}{space 2} .0124704{col 56}{space 1}   88.70{col 65}{space 3}0.000{col 73}{space 4} 1.081667{col 86}{space 3}  1.13055
{txt}{hline 32}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Usigma                          {txt}{c |}
{space 24}fdratio {c |}{col 33}{res}{space 2}-2.906648{col 45}{space 2} .0322919{col 56}{space 1}  -90.01{col 65}{space 3}0.000{col 73}{space 4}-2.969939{col 86}{space 3}-2.843357
{txt}{hline 32}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Vsigma                          {txt}{c |}
{space 24}fdratio {c |}{col 33}{res}{space 2}-14.47371{col 45}{space 2} .1821994{col 56}{space 1}  -79.44{col 65}{space 3}0.000{col 73}{space 4}-14.83082{col 86}{space 3}-14.11661
{txt}{hline 32}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  E(sigma_u) {c |}  {res}  .758886                                 .7563735    .7613985
{txt}  E(sigma_v) {c |}  {res} .4003768                                 .3958259    .4049276
{txt}{hline 13}{c BT}{hline 64}

{com}. 
. 
. * store estimates and predict ind. TE scores
. qui estimates store `model1name'
{txt}
{com}. 
. 
. * Get the AIC and BIC estimates for the fitted model
. estimates stats

{txt}{hline 13}{c TT}{hline 63}
       Model {c |}    Obs    ll(null)   ll(model)     df          AIC         BIC
{hline 13}{c +}{hline 63}
{ralign 12:{stata estimates replay bc95:bc95}}{col 14}{c |}{res}{col 17}21929{col 25}        .{col 37}-14194.72{col 48}   20{col 57} 28429.43{col 69} 28589.34
{txt}{hline 13}{c BT}{hline 63}
{p 15 22 2}
Note:  N=Obs used in calculating BIC; see {helpb bic_note:[R] BIC note}
{p_end}

{com}. 
. 
. 
. 
. qui estimates save  `fadnoutdatadir'/`model1name'$datestamp$timestamp.ster, replace
{txt}
{com}. qui capture drop te_`model1name'
{txt}
{com}. 
. * constructs ind. level CI's for TE scores
. *qui frontier_teci te_`model1name'_ci 
. 
. /*
> * store estimates and predict ind. TE scores
> qui estimates store `model2name'
> qui estimates save  `model2name'$datestamp.ster, replace
> qui capture drop te_`model2name'
> qui predict te_`model2name', `predict_opts'
> */
. 
. save `fadnoutdatadir'/$datanameSFApost, replace
{txt}file D:\\Data/data_FADNPanelAnalysis/OutData/multisward/.dta saved

{com}. 
. 
. ********************************************************
. * End of MODELLING section              
. ********************************************************
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ********************************************************
. * POSTESTIMATION 
. ********************************************************
. 
. if `tests' == 1 {c -(}
. 
. 
.         qui xtreg `dep_vlist' `indep_vlist', fe
.         estimates store fixed
.         
.         
.         qui xtreg `dep_vlist' `indep_vlist', re
.         estimates store random
.         
.         
.         /* Hausman specification test 
>             H0: difference in coef not systematic (i.e. OK to use RE) */ 
.         qui hausman fixed random
.         local hausman_test = "Prob>chi2 = `r(p)'"
.         
.         
.         /* Test for time fixed effects 
>             H0: Joint test of year effects =0   */ 
.         qui xtreg `dep_vlist' `indep_vlist' i.year, fe
.         qui testparm i.year
.         local time_FE = "Prob>F = `r(p)'"
.         
.         
.         /* Breusch-Pagan LM test of RE vs OLS 
>             H0: Variances across entities are 0 
>               (i.e. no panel effect)            */ 
.         estimates restore random
.         qui xttest0
.         local BreuschPagan_LM_RE = "Prob>chi2 = `r(p)'"
.         
.         
.         /* Wald test for groupwise heteroscedasticity (for FE)
>              H0: Constant variance (i.e. homoscedasticity   */ 
.         estimates restore fixed
.         qui xttest3
.         local wald_heterosc = "Prob>chi2 = `r(p)'"
. 
. 
. {c )-}
{txt}
{com}. 
. foreach lnw_var of local lnw_vlist {c -(}
{txt}  2{com}. 
.         tw (sc `dep_vlist' `lnw_var') (lfit `dep_vlist' `lnw_var')
{txt}  3{com}.         graph export `fadnoutdatadir'/scplot_dep_`lnw_var'.pdf, asis replace
{txt}  4{com}.         graph drop _all
{txt}  5{com}. 
. {c )-}
{res}{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/scplot_dep_lnPCompoundfeedingstuffsforcalv.pdf written in PDF format)
{res}{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/scplot_dep_lnPCompoundfeedingstuffsforcatt.pdf written in PDF format)
{res}{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/scplot_dep_lnPCerealsandmillingbyproducts.pdf written in PDF format)
{res}{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/scplot_dep_lnPOilcakes.pdf written in PDF format)
{res}{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/scplot_dep_lnPFERTILISERSANDSOILIMPROVERS.pdf written in PDF format)
{res}{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/scplot_dep_lnPElectricity.pdf written in PDF format)
{res}{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/scplot_dep_lnPMotorfuels.pdf written in PDF format)
{res}{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/scplot_dep_lnPVETERINARYEXPENSES.pdf written in PDF format)
{res}{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/scplot_dep_lnPSEEDSANDPLANTINGSTOCK.pdf written in PDF format)
{res}{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/scplot_dep_lnPMACHINERYANDOTHEREQUIPMENT.pdf written in PDF format)
{res}{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/scplot_dep_lnPMAINTENANCEOFBUILDINGS.pdf written in PDF format)
{res}{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/scplot_dep_lnPOTHERGOODSANDSERVICES.pdf written in PDF format)

{com}. 
. *keep `dep_vlist' `indep_vlist' `z_vlist' pid year farmcode country countrycode2
. 
. set matsize 5000
{txt}
{com}. 
. foreach var of varlist `dep_vlist' `indep_vlist' `z_vlist' {c -(}
{txt}  2{com}. 
.         kdensity `var', normal
{txt}  3{com}.         graph export `fadnoutdatadir'/normality_`var'.pdf, asis replace
{txt}  4{com}.         graph drop _all
{txt}  5{com}. 
. {c )-}
{res}{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/normality_lntotalinputs.pdf written in PDF format)
{res}{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/normality_lndotomkgl.pdf written in PDF format)
{res}{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/normality_lnPCompoundfeedingstuffsforcalv.pdf written in PDF format)
{res}{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/normality_lnPCompoundfeedingstuffsforcatt.pdf written in PDF format)
{res}{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/normality_lnPCerealsandmillingbyproducts.pdf written in PDF format)
{res}{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/normality_lnPOilcakes.pdf written in PDF format)
{res}{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/normality_lnPFERTILISERSANDSOILIMPROVERS.pdf written in PDF format)
{res}{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/normality_lnPElectricity.pdf written in PDF format)
{res}{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/normality_lnPMotorfuels.pdf written in PDF format)
{res}{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/normality_lnPVETERINARYEXPENSES.pdf written in PDF format)
{res}{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/normality_lnPSEEDSANDPLANTINGSTOCK.pdf written in PDF format)
{res}{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/normality_lnPMACHINERYANDOTHEREQUIPMENT.pdf written in PDF format)
{res}{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/normality_lnPMAINTENANCEOFBUILDINGS.pdf written in PDF format)
{res}{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/normality_lnPOTHERGOODSANDSERVICES.pdf written in PDF format)
{res}{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/normality_fdratio.pdf written in PDF format)

{com}. 
. 
. qui predict te_`model1name', `predict_opts'
{txt}
{com}. *qui predict te_ct_`modelname', ci
. predict xb, xb
{txt}(3 missing values generated)

{com}. predict u, u 
{txt}(3 missing values generated)
(3 missing values generated)
(16 missing values generated)

{com}. gen e = `dep_vlist'-xb
{txt}(3 missing values generated)

{com}. gen v = e - u
{txt}(16 missing values generated)

{com}. 
. 
. local var = "e"
{txt}
{com}. kdensity `var ', normal
{res}{txt}
{com}. graph export `fadnoutdatadir'/normality_`var '.pdf, asis replace
{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/normality_e.pdf written in PDF format)

{com}. graph drop _all
{txt}
{com}. tw sc `var' xb , yline(0)
{res}{txt}
{com}. graph export `fadnoutdatadir'/heteroscedasticity_`var '.pdf, asis replace
{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/heteroscedasticity_e.pdf written in PDF format)

{com}. graph drop _all
{txt}
{com}. 
. 
. local var = "v"
{txt}
{com}. kdensity `var ', normal
{res}{txt}
{com}. graph export `fadnoutdatadir'/normality_`var '.pdf, asis replace
{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/normality_v.pdf written in PDF format)

{com}. graph drop _all
{txt}
{com}. tw sc `var' xb , yline(0)
{res}{txt}
{com}. graph export `fadnoutdatadir'/heteroscedasticity_`var '.pdf, asis replace
{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/heteroscedasticity_v.pdf written in PDF format)

{com}. graph drop _all
{txt}
{com}. 
. 
. local var = "u"
{txt}
{com}. kdensity `var ', normal
{res}{txt}
{com}. graph export `fadnoutdatadir'/normality_`var '.pdf, asis replace
{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/normality_u.pdf written in PDF format)

{com}. graph drop _all
{txt}
{com}. tw sc `var' xb , yline(0)
{res}{txt}
{com}. graph export `fadnoutdatadir'/heteroscedasticity_`var '.pdf, asis replace
{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/heteroscedasticity_u.pdf written in PDF format)

{com}. graph drop _all
{txt}
{com}. 
. 
. 
. /*----------- Check theoretical properties (Cost Functions)----------
>                 NOTE: See Coelli et al (2005, p. 23)
>   1. Nonnegativity      : c(w,q) > 0
>   2. Nondecreasing in w : if w0  >= w1, then c(w0,q) >= c(w1,q)
>   3. Nondecreasing in q : if q0  >= q1, then c(w,q0) >= c(w,q1)
>   4. Homgeneity         : c(kw,q) = kc(w,q) for k>0     
>   5. Concave in w       : c([theta]w0 + [1-theta]w1,q) 
>                             >= [theta]c(w0,q)+[1-theta]c(w1,q)
> 
> My translation of concavity (point 5 above) is this: The cost of a 
> production technique which employs both (all) inputs in fixed shares 
> will be at least as much as the share weighted sum of multiple 
> production techniques employing each individual input in the same 
> proportions as in the single technique. So inputs are used in the 
> same proportions in either case (single vs multiple technique), but 
> the single technique will always be at least as costly (and possibly 
> moreso). 
> -------------------------------------------------------------------*/
. * Checking 1 is simple (shouldn't see any obs < 0)
. count if totalinputs < 0
{res}    0
{txt}
{com}. 
. 
. /* Checking 2 means dC/dw >= 0 (depends on functional form)
> -- For Cobb-Douglas dC/dw = C*([Beta]/w), so if all three terms
>     on the right hand side > 0, so too will dC/dw. Checked C above
>     so its just w and Beta's to check now.
>     */  
. 
. * checking w's
. foreach lnw_var of local lnw_vlist {c -(}
{txt}  2{com}.         
.         /* we want to check w's not their logs, so
>         create new local without "ln" prefix, and
>         make a list of these w_var's while your at it  */
.         local w_var: di substr("`lnw_var'", 3, .)
{txt}  3{com}.         local w_vlist "`w_vlist' `w_var'"
{txt}  4{com}. 
.         count if `w_var' < 0 
{txt}  5{com}. {c )-}
{res}    0
    0
    0
    0
    0
    0
    0
    0
    0
    0
    0
    0
{txt}
{com}. 
. * checking [Betas] ... inspect the parameter estimates for negative
. *  signs
. *--------------------------------------------------------------------
. 
. /* Display exponentiated parameters for convenience 
>  (currently All, whether that makes sense or not...
>   will not change actual stored estimates)          */ 
. matrix define B = e(b)
{txt}
{com}. matrix define expB = B
{txt}
{com}. 
. local i = 1
{txt}
{com}. while `i' <= colsof(B) {c -(}
{txt}  2{com}. 
.         matrix define expB[1,`i'] = exp(B[1,`i'])
{txt}  3{com}. 
.         local i = `i' + 1
{txt}  4{com}. {c )-}
{txt}
{com}. matrix define Bcomb = [B, expB]
{txt}
{com}. matrix define Bcomb = Bcomb' 
{txt}
{com}. 
. * for supporting discussion of positive sign on hasreps in
. * production function (unexpected)
. corr `dep_vlist' `indep_vlist'
{txt}(obs=21942)

             {c |} lntota~s lndoto~l lnPCom~v lnPCom~t lnPCer~s lnPOil~s lnPFER~S lnPEle~y lnPMot~s lnPVET~S
{hline 13}{c +}{hline 90}
lntotalinp~s {c |}{res}   1.0000
  {txt}lndotomkgl {c |}{res}   0.9319   1.0000
{txt}lnPCompoun~v {c |}{res}  -0.0585  -0.0046   1.0000
{txt}lnPCompoun~t {c |}{res}   0.0776   0.0857  -0.6923   1.0000
{txt}lnPCereals~s {c |}{res}   0.1226   0.1489  -0.2788   0.7064   1.0000
 {txt}lnPOilcakes {c |}{res}   0.0510   0.0952  -0.3703   0.7034   0.3956   1.0000
{txt}lnPFERTILI~S {c |}{res}   0.2194   0.2717   0.0630   0.1738   0.2735   0.3292   1.0000
{txt}lnPElectri~y {c |}{res}   0.0113   0.0255  -0.2834   0.2841   0.1360   0.0011   0.3781   1.0000
{txt}lnPMotorfu~s {c |}{res}   0.1336   0.1698   0.2747  -0.1640  -0.0753   0.0737   0.8020   0.4964   1.0000
{txt}lnPVETERIN~S {c |}{res}   0.0113   0.0162  -0.8026   0.7610   0.4641   0.5545   0.2346   0.4490   0.0142   1.0000
{txt}lnPSEEDSAN~K {c |}{res}   0.1367   0.1488  -0.6809   0.8126   0.6492   0.5522   0.3472   0.4807   0.0200   0.7715
{txt}lnPMACHINE~T {c |}{res}  -0.0069  -0.0524  -0.8059   0.5630   0.2912   0.2321   0.1620   0.5943   0.0958   0.8661
{txt}lnPMAINTEN~S {c |}{res}   0.0833   0.1123  -0.6487   0.7505   0.5509   0.5529   0.5409   0.5703   0.2707   0.9214
{txt}lnPOTHERGO~S {c |}{res}   0.1480   0.1369  -0.8448   0.7026   0.3977   0.4810   0.4245   0.4386   0.1415   0.8723

             {txt}{c |} lnPSEE~K lnPMAC~T lnPMAI~S lnPOTH~S
{hline 13}{c +}{hline 36}
lnPSEEDSAN~K {c |}{res}   1.0000
{txt}lnPMACHINE~T {c |}{res}   0.6556   1.0000
{txt}lnPMAINTEN~S {c |}{res}   0.8233   0.7810   1.0000
{txt}lnPOTHERGO~S {c |}{res}   0.7851   0.8196   0.8805   1.0000

{txt}
{com}. 
. 
. * some descriptives of the TE scores
. tabstat te_`model1name', stats(mean sem) by(country)

{txt}Summary for variables: te_bc95
{col 6}by categories of: country (a24)

{ralign 7:country} {...}
{c |}      mean  se(mean)
{hline 8}{c +}{hline 20}
{ralign 7:DEU} {...}
{c |}{...}
 {res} .4447288  .0010509
{txt}{ralign 7:FRA} {...}
{c |}{...}
 {res} .4129863  .0018524
{txt}{ralign 7:IRE} {...}
{c |}{...}
 {res} .5432171   .002295
{txt}{ralign 7:UKI} {...}
{c |}{...}
 {res} .4718215  .0015272
{txt}{hline 8}{c +}{hline 20}
{ralign 7:Total} {...}
{c |}{...}
 {res}   .45947  .0007857
{txt}{hline 8}{c BT}{hline 20}

{com}. 
. * describes the relationsip of fdratio to te_tfe
. tw (sc te_`modelname' fdratio) (lfit te_`modelname' fdratio, lwidth(thick))
{res}{txt}
{com}. graph export `fadnoutdatadir'/scplot_te_fdratio.pdf, asis replace
{txt}(file D:\Data/data_FADNPanelAnalysis/OutData/multisward/scplot_te_fdratio.pdf written in PDF format)

{com}. graph drop _all
{txt}
{com}. ** shows weak relation to mean, but stronger for heterscedasiticy
. ** therefore, put z's into sigma_u
. 
. 
. save `fadnoutdatadir'/$datanameSFApost, replace
{txt}file D:\\Data/data_FADNPanelAnalysis/OutData/multisward/.dta saved

{com}. 
. 
. ********************************************************
. * End of POSTESTIMATION section
. ********************************************************
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ********************************************************
. * CLEANING UP             
. ********************************************************
. 
. * report the model parameters you selected in the log
. capture macro list _dep_vlist _indep_vlist _location_vlist _model1command _model1name _predict_opts databuild ms sectors dataname datadir project 
{txt}
{com}. 
. 
. *clear
. capture erase blank.dta
{txt}
{com}. capture log close
{smcl}
{com}{sf}{ul off}