{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_08_29.txt
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}29 Aug 2013, 11:31:02
{txt}
{com}. di  "Job  Started  at  $S_TIME  on $S_DATE"
{res}Job  Started  at  11:31:02  on 29 Aug 2013
{txt}
{com}. cmdlog using logs/$project$datestamp.cmd.txt, replace
{txt}(note: file G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_08_29.cmd.txt not found)
(cmdlog G:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2013_08_29.cmd.txt opened)

{com}. 
. preserve
{txt}
{com}. drop country
{txt}
{com}. gen int country = countrycode2
{txt}
{com}. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' 
{txt}
{com}. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel
{txt}(note: file G:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.csv not found)

{com}. save `fadnoutdatadir'/exported_data.dta, replace nolabel
{txt}(note: file G:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta not found)
file G:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

{com}. 
. sfpanel `dep_vlist' `indep_vlist' if country==3,  model(bc95) cost d(tnormal) emean(`z_vlist')

{txt}note: half_lnX_22 omitted because of collinearity
note: half_lnX_23 omitted because of collinearity
note: half_lnX_33 omitted because of collinearity
{res}
{txt}initial:{col 16}Log likelihood = {res: -3328.768}
Iteration 0:{space 3}Log likelihood = {res: -3328.768}  
Iteration 1:{space 3}Log likelihood = {res:-3283.1897}  (backed up)
Iteration 2:{space 3}Log likelihood = {res:-3267.8565}  (backed up)
Iteration 3:{space 3}Log likelihood = {res:-3247.5354}  (backed up)
Iteration 4:{space 3}Log likelihood = {res:  -3209.32}  (backed up)
Iteration 5:{space 3}Log likelihood = {res:-3116.0209}  (backed up)
Iteration 6:{space 3}Log likelihood = {res:-3114.0603}  (backed up)
Iteration 7:{space 3}Log likelihood = {res:-3059.0653}  
Iteration 8:{space 3}Log likelihood = {res:-2946.1945}  
Iteration 9:{space 3}Log likelihood = {res:-2912.6228}  
Iteration 10:{space 2}Log likelihood = {res:-2889.1824}  
Iteration 11:{space 2}Log likelihood = {res:-2879.1545}  
Iteration 12:{space 2}Log likelihood = {res: -2878.579}  
Iteration 13:{space 2}Log likelihood = {res:-2878.3491}  
Iteration 14:{space 2}Log likelihood = {res:-2877.8116}  
Iteration 15:{space 2}Log likelihood = {res:-2877.4719}  
Iteration 16:{space 2}Log likelihood = {res:-2877.0966}  
Iteration 17:{space 2}Log likelihood = {res:-2876.9645}  
Iteration 18:{space 2}Log likelihood = {res:-2876.6356}  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 19:{space 2}Log likelihood = {res:-2876.2237}  
Iteration 20:{space 2}Log likelihood = {res:-2875.9555}  (backed up)
Iteration 21:{space 2}Log likelihood = {res:-2875.9546}  (backed up)
Iteration 22:{space 2}Log likelihood = {res:-2875.8966}  (backed up)
Iteration 23:{space 2}Log likelihood = {res:-2875.5344}  (backed up)
Iteration 24:{space 2}Log likelihood = {res:-2875.4183}  (backed up)
Iteration 25:{space 2}Log likelihood = {res:-2875.4054}  (backed up)
Iteration 26:{space 2}Log likelihood = {res: -2875.344}  
Iteration 27:{space 2}Log likelihood = {res:-2874.6787}  
Iteration 28:{space 2}Log likelihood = {res:-2874.2626}  
Iteration 29:{space 2}Log likelihood = {res:-2873.7315}  
Iteration 30:{space 2}Log likelihood = {res:-2872.9643}  
Iteration 31:{space 2}Log likelihood = {res:-2871.8775}  
Iteration 32:{space 2}Log likelihood = {res:-2871.1367}  
Iteration 33:{space 2}Log likelihood = {res:-2870.7793}  
Iteration 34:{space 2}Log likelihood = {res:-2870.7383}  
Iteration 35:{space 2}Log likelihood = {res:-2870.6994}  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 36:{space 2}Log likelihood = {res:-2870.6095}  
Iteration 37:{space 2}Log likelihood = {res:-2870.5945}  (backed up)
Iteration 38:{space 2}Log likelihood = {res:-2870.5944}  (backed up)
Iteration 39:{space 2}Log likelihood = {res: -2870.585}  (backed up)
Iteration 40:{space 2}Log likelihood = {res:-2870.5831}  (backed up)
Iteration 41:{space 2}Log likelihood = {res:-2870.5828}  
Iteration 42:{space 2}Log likelihood = {res:-2870.5826}  
Iteration 43:{space 2}Log likelihood = {res:-2870.5686}  
Iteration 44:{space 2}Log likelihood = {res:-2870.5491}  
Iteration 45:{space 2}Log likelihood = {res:-2870.5475}  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 46:{space 2}Log likelihood = {res:-2870.5062}  
Iteration 47:{space 2}Log likelihood = {res:-2870.5036}  (backed up)
Iteration 48:{space 2}Log likelihood = {res:-2870.4973}  (backed up)
Iteration 49:{space 2}Log likelihood = {res:-2870.4857}  (backed up)
Iteration 50:{space 2}Log likelihood = {res:-2870.4798}  (backed up)
Iteration 51:{space 2}Log likelihood = {res:-2870.4732}  (backed up)
Iteration 52:{space 2}Log likelihood = {res:-2870.4727}  (backed up)
Iteration 53:{space 2}Log likelihood = {res:-2870.4665}  
Iteration 54:{space 2}Log likelihood = {res:-2870.4607}  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 55:{space 2}Log likelihood = {res:-2870.3558}  
Iteration 56:{space 2}Log likelihood = {res:-2870.3549}  (backed up)
Iteration 57:{space 2}Log likelihood = {res:-2870.3543}  (backed up)
Iteration 58:{space 2}Log likelihood = {res:-2870.3391}  (backed up)
Iteration 59:{space 2}Log likelihood = {res:-2870.3357}  (backed up)
Iteration 60:{space 2}Log likelihood = {res:-2870.3324}  
Iteration 61:{space 2}Log likelihood = {res:-2870.3323}  
Iteration 62:{space 2}Log likelihood = {res:-2870.3187}  
Iteration 63:{space 2}Log likelihood = {res:-2870.2949}  
Iteration 64:{space 2}Log likelihood = {res:-2870.2872}  
Iteration 65:{space 2}Log likelihood = {res:-2870.2655}  
Iteration 66:{space 2}Log likelihood = {res:-2870.0277}  
Iteration 67:{space 2}Log likelihood = {res:-2869.6604}  
Iteration 68:{space 2}Log likelihood = {res:-2869.2711}  
Iteration 69:{space 2}Log likelihood = {res:-2869.1387}  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 70:{space 2}Log likelihood = {res:-2868.5412}  
Iteration 71:{space 2}Log likelihood = {res:-2868.5399}  (backed up)
Iteration 72:{space 2}Log likelihood = {res:-2868.5364}  (backed up)
Iteration 73:{space 2}Log likelihood = {res:-2868.4697}  (backed up)
Iteration 74:{space 2}Log likelihood = {res:-2868.4212}  (backed up)
Iteration 75:{space 2}Log likelihood = {res:-2868.4079}  (backed up)
Iteration 76:{space 2}Log likelihood = {res:-2868.3441}  
Iteration 77:{space 2}Log likelihood = {res:-2868.3424}  (backed up)
Iteration 78:{space 2}Log likelihood = {res:-2868.0973}  
Iteration 79:{space 2}Log likelihood = {res: -2867.375}  
Iteration 80:{space 2}Log likelihood = {res:-2867.3374}  
Iteration 81:{space 2}Log likelihood = {res:-2867.3301}  
Iteration 82:{space 2}Log likelihood = {res:-2867.3139}  
Iteration 83:{space 2}Log likelihood = {res:-2867.3014}  
Iteration 84:{space 2}Log likelihood = {res:-2866.9651}  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 85:{space 2}Log likelihood = {res:-2866.0876}  
numerical derivatives are approximate
flat or discontinuous region encountered
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 86:{space 2}Log likelihood = {res:-2866.0876}  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 87:{space 2}Log likelihood = {res:-2866.0875}  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 88:{space 2}Log likelihood = {res:-2866.0866}  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 89:{space 2}Log likelihood = {res:-2866.0744}  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 90:{space 2}Log likelihood = {res: -2866.068}  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 91:{space 2}Log likelihood = {res: -2866.068}  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 92:{space 2}Log likelihood = {res: -2866.068}  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 93:{space 2}Log likelihood = {res:-2866.0665}  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 94:{space 2}Log likelihood = {res:-2866.0659}  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 95:{space 2}Log likelihood = {res:-2866.0659}  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 96:{space 2}Log likelihood = {res:-2866.0648}  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 97:{space 2}Log likelihood = {res:-2866.0621}  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 98:{space 2}Log likelihood = {res:-2866.0598}  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 99:{space 2}Log likelihood = {res:-2866.0598}  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 100:{space 1}Log likelihood = {res:-2866.0598}  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered

Inefficiency effects model (truncated-normal){col 54}Number of obs {col 68}={col 70}{res}     2823
{txt}Group variable: {res}pid{txt}{col 51}Number of groups{col 68}={col 70}{res}      606
{txt}Time variable: {res}year{txt}{col 49}Obs per group: min{col 68}={col 70}{res}        1
{col 64}{txt}avg{col 68}={col 70}{res}      4.7
{col 64}{txt}max{col 68}={col 70}{res}        9

{txt}{col 54}Prob > chi2   = {res}   0.1197
{txt}Log likelihood = {res}-2866.0598{txt}{col 54}Wald chi2({res}5{txt})  = {res}     8.74

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}lntotalinp~s{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Frontier     {txt}{c |}
{space 9}X_1 {c |}{col 14}{res}{space 2} 23.41939{col 26}{space 2} 23.21886{col 37}{space 1}    1.01{col 46}{space 3}0.313{col 54}{space 4}-22.08874{col 67}{space 3} 68.92752
{txt}{space 9}X_2 {c |}{col 14}{res}{space 2} .2189248{col 26}{space 2}  .179538{col 37}{space 1}    1.22{col 46}{space 3}0.223{col 54}{space 4}-.1329631{col 67}{space 3} .5708128
{txt}{space 9}X_3 {c |}{col 14}{res}{space 2}-.1856426{col 26}{space 2} .1512935{col 37}{space 1}   -1.23{col 46}{space 3}0.220{col 54}{space 4}-.4821725{col 67}{space 3} .1108872
{txt}{space 1}half_lnX_11 {c |}{col 14}{res}{space 2} -20.2593{col 26}{space 2} 24.33857{col 37}{space 1}   -0.83{col 46}{space 3}0.405{col 54}{space 4}-67.96202{col 67}{space 3} 27.44343
{txt}{space 1}half_lnX_12 {c |}{col 14}{res}{space 2} -48.4511{col 26}{space 2} 41.46177{col 37}{space 1}   -1.17{col 46}{space 3}0.243{col 54}{space 4}-129.7147{col 67}{space 3} 32.81247
{txt}{space 1}half_lnX_13 {c |}{col 14}{res}{space 2} 42.94219{col 26}{space 2}  34.2784{col 37}{space 1}    1.25{col 46}{space 3}0.210{col 54}{space 4}-24.24224{col 67}{space 3} 110.1266
{txt}{space 1}half_lnX_22 {c |}{col 14}{res}{space 2} 8.00e-16{col 26}{txt}  (omitted)
{space 1}half_lnX_23 {c |}{col 14}{res}{space 2}-1.13e-15{col 26}{txt}  (omitted)
{space 1}half_lnX_33 {c |}{col 14}{res}{space 2} 3.34e-16{col 26}{txt}  (omitted)
{space 7}_cons {c |}{col 14}{res}{space 2}-3.788991{col 26}{space 2} 38.72001{col 37}{space 1}   -0.10{col 46}{space 3}0.922{col 54}{space 4}-79.67881{col 67}{space 3} 72.10083
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Mu           {txt}{c |}
{space 5}fdratio {c |}{col 14}{res}{space 2}-.5021163{col 26}{space 2} .1050722{col 37}{space 1}   -4.78{col 46}{space 3}0.000{col 54}{space 4}-.7080541{col 67}{space 3}-.2961786
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .7699545{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Usigma       {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-22.87807{col 26}{space 2}  .523081{col 37}{space 1}  -43.74{col 46}{space 3}0.000{col 54}{space 4}-23.90329{col 67}{space 3}-21.85285
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Vsigma       {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.8065148{col 26}{space 2} .0266338{col 37}{space 1}  -30.28{col 46}{space 3}0.000{col 54}{space 4} -.858716{col 67}{space 3}-.7543136
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{text}     sigma_u{col 14}{c |}{result}{space 2} .0000108{col 26}{space 2} 2.82e-06{col 37}{space 1}    3.82{col 46}{space 3}0.000{col 55}{space 3} 6.45e-06{col 67}{space 3}  .000018
{col 1}{text}     sigma_v{col 14}{c |}{result}{space 2} .6681401{col 26}{space 2} .0088975{col 37}{space 1}   75.09{col 46}{space 3}0.000{col 55}{space 3} .6509269{col 67}{space 3} .6858085
{col 1}{text}      lambda{col 14}{c |}{result}{space 2} .0000161{col 26}{space 2} .0088975{col 37}{space 1}    0.00{col 46}{space 3}0.999{col 55}{space 3}-.0174227{col 67}{space 3}  .017455
{txt}{hline 13}{c BT}{hline 64}

{com}. 
. restore
{txt}
{com}. STOP!!!
{err}unrecognized command:  STOP
{txt}{search r(199):r(199);}

end of do-file

{search r(199):r(199);}

{com}. di ln(100)
{res}4.6051702

{com}. help log

. help log_func

. help func_log

. help math_func

. help functions

. di ln(100)/ln(2)
{res}6.6438562

{com}. di log10*(100)
{res}{err}log10 not found
{txt}{search r(111):r(111);}

{com}. di log_10*(100)
{res}{err}log_10 not found
{txt}{search r(111):r(111);}

{com}. di log_10(100)
{res}{err}unknown function log_10()
{txt}{search r(133):r(133);}

{com}. di log10(100)
{res}2

{com}. di log10(100)/log10(2)
{res}6.6438562

{com}. di 2^6.6438562
{res}100

{com}. di log10(100)/log10(5)
{res}2.8613531

{com}. di log10(100)/log10(15)
{res}1.7005483

{com}. di log10(100)/log10(100)
{res}1

{com}. di log10(100)/log10(1000)
{res}.66666667

{com}. di log10(100)/log10(1000000)
{res}.33333333

{com}. exit
{err}no; data in memory would be lost
{txt}{search r(4):r(4);}

{com}. exit, clear
