------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.txt
  log type:  text
 opened on:   6 Feb 2014, 11:09:28

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  11:09:28  on  6 Feb 2014

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(note: file D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.cmd.txt not found)
(cmdlog D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file D:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. 
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') vs
> igma(TREND)
unrecognized command:  sfpanel
r(199);

end of do-file

r(199);

. findit sfpanel

. do msward_WFSresults_cost.do

. * Based on msward_code_clarity.do
. capture log close
------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.txt
  log type:  text
 opened on:   6 Feb 2014, 11:12:21

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  11:12:21  on  6 Feb 2014

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(cmdlog D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file D:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. 
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') vs
> igma(TREND)


initial:       Log pseudolikelihood = -42525.399
Iteration 0:   Log pseudolikelihood = -42525.399  
Iteration 1:   Log pseudolikelihood = -38225.927  (backed up)
Iteration 2:   Log pseudolikelihood = -37853.446  (backed up)
Iteration 3:   Log pseudolikelihood = -34550.006  (backed up)
Iteration 4:   Log pseudolikelihood = -34377.569  (backed up)
Iteration 5:   Log pseudolikelihood = -32754.185  (backed up)
Iteration 6:   Log pseudolikelihood = -32685.673  (backed up)
Iteration 7:   Log pseudolikelihood = -32615.071  (backed up)
Iteration 8:   Log pseudolikelihood = -32614.606  (backed up)
Iteration 9:   Log pseudolikelihood = -32614.606  (backed up)
Iteration 10:  Log pseudolikelihood = -29859.015  
Iteration 11:  Log pseudolikelihood = -29235.268  
Iteration 12:  Log pseudolikelihood = -28109.945  
Iteration 13:  Log pseudolikelihood = -26998.997  
Iteration 14:  Log pseudolikelihood = -22653.057  
Iteration 15:  Log pseudolikelihood = -21229.646  
Iteration 16:  Log pseudolikelihood =  -14627.56  
Iteration 17:  Log pseudolikelihood = -14257.204  
Iteration 18:  Log pseudolikelihood =   -10497.3  
Iteration 19:  Log pseudolikelihood = -8389.9952  
Iteration 20:  Log pseudolikelihood = -7043.9257  
Iteration 21:  Log pseudolikelihood = -5849.6539  
Iteration 22:  Log pseudolikelihood = -5051.3558  
Iteration 23:  Log pseudolikelihood = -4678.4082  
Iteration 24:  Log pseudolikelihood = -4587.3678  
Iteration 25:  Log pseudolikelihood = -4523.8259  
Iteration 26:  Log pseudolikelihood = -4411.2822  
Iteration 27:  Log pseudolikelihood = -4351.9103  
Iteration 28:  Log pseudolikelihood = -4326.0409  
Iteration 29:  Log pseudolikelihood = -4231.3755  
Iteration 30:  Log pseudolikelihood = -4059.5883  
Iteration 31:  Log pseudolikelihood = -3928.1843  
Iteration 32:  Log pseudolikelihood = -3846.0975  
Iteration 33:  Log pseudolikelihood = -3778.9773  
Iteration 34:  Log pseudolikelihood = -3741.8128  
Iteration 35:  Log pseudolikelihood = -3731.1887  
Iteration 36:  Log pseudolikelihood = -3726.6659  
Iteration 37:  Log pseudolikelihood =  -3724.581  
Iteration 38:  Log pseudolikelihood =  -3724.065  
Iteration 39:  Log pseudolikelihood = -3723.6663  
Iteration 40:  Log pseudolikelihood =  -3722.654  
Iteration 41:  Log pseudolikelihood = -3719.7449  
Iteration 42:  Log pseudolikelihood = -3717.4039  
Iteration 43:  Log pseudolikelihood = -3712.6526  
Iteration 44:  Log pseudolikelihood = -3710.4785  
Iteration 45:  Log pseudolikelihood = -3710.1396  
Iteration 46:  Log pseudolikelihood = -3710.1261  
Iteration 47:  Log pseudolikelihood =  -3710.126  

Inefficiency effects model (truncated-normal)        Number of obs =     13369
Group variable: pid                               Number of groups =      2966
Time variable: year                             Obs per group: min =         1
                                                               avg =       4.5
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood = -3710.1260                    Wald chi2(5)  =  15741.23

                                                    (Std. Err. adjusted for 2966 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |   1.018425   .0091923   110.79   0.000     1.000408    1.036441
                 lnPTotalCattle |   .1849968   .0476318     3.88   0.000     .0916401    .2783534
lnPCompoundfeedingstuffsforcatt |   .6127854   .0273143    22.43   0.000     .5592503    .6663204
 lnPFERTILISERSANDSOILIMPROVERS |   .1613312   .0463931     3.48   0.001     .0704024    .2522599
                          TREND |   .0007735   .0028821     0.27   0.788    -.0048754    .0064224
                          _cons |  -5.970793   .2269811   -26.31   0.000    -6.415668   -5.525918
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |   4.549041   2.425056     1.88   0.061     -.203982    9.302064
                      lnspecial |  -10.39102          .        .       .            .           .
                          _cons |   10.66122   14.18414     0.75   0.452    -17.13919    38.46162
--------------------------------+----------------------------------------------------------------
Usigma                          |
                          _cons |   1.087618   .3023651     3.60   0.000     .4949937    1.680243
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                          TREND |   .0520202   .0112184     4.64   0.000     .0300326    .0740078
                          _cons |  -2.724706   .0753686   -36.15   0.000    -2.872426   -2.576986
--------------------------------+----------------------------------------------------------------
  E(sigma_v) |   .2925477                                 .2922191    .2928763
     sigma_u |   1.722556   .2604204     6.61   0.000     1.280815    2.316648
------------------------------------------------------------------------------

. estimates store `model1name'_DEU_`tech_or_cost'

. estimates save `fadnoutdatadir'/`model1name'_DEU_`tech_or_cost'_$datestamp$timestamp.ster, replace
(note: file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_DEU_cost_2014_02_061112am.ster not found)
file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_DEU_cost_2014_02_061112am.ster saved

. di `e(converged)'
1

. 
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "FRA",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist') vsigma(TREND)


initial:       Log pseudolikelihood = -18928.767
Iteration 0:   Log pseudolikelihood = -18928.767  
Iteration 1:   Log pseudolikelihood =  -12721.39  (backed up)
Iteration 2:   Log pseudolikelihood = -8933.7001  (backed up)
Iteration 3:   Log pseudolikelihood = -8902.4794  (backed up)
Iteration 4:   Log pseudolikelihood = -7794.5228  (backed up)
Iteration 5:   Log pseudolikelihood = -7736.9277  (backed up)
Iteration 6:   Log pseudolikelihood = -7707.5824  (backed up)
Iteration 7:   Log pseudolikelihood = -7622.0211  (backed up)
Iteration 8:   Log pseudolikelihood = -7608.7781  (backed up)
Iteration 9:   Log pseudolikelihood = -7588.8977  (backed up)
Iteration 10:  Log pseudolikelihood = -7576.1853  (backed up)
Iteration 11:  Log pseudolikelihood = -7575.0364  (backed up)
Iteration 12:  Log pseudolikelihood = -6688.5732  
Iteration 13:  Log pseudolikelihood = -6489.0222  
Iteration 14:  Log pseudolikelihood = -6115.4153  
Iteration 15:  Log pseudolikelihood = -6115.4153  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 16:  Log pseudolikelihood = -6115.4153  (backed up)
Iteration 17:  Log pseudolikelihood = -5850.7425  (backed up)
Iteration 18:  Log pseudolikelihood = -5180.1992  (backed up)
Iteration 19:  Log pseudolikelihood = -5086.5221  (backed up)
Iteration 20:  Log pseudolikelihood = -4546.0913  (backed up)
Iteration 21:  Log pseudolikelihood = -4239.5278  (backed up)
Iteration 22:  Log pseudolikelihood = -4169.1684  (backed up)
Iteration 23:  Log pseudolikelihood = -3949.8727  (backed up)
Iteration 24:  Log pseudolikelihood = -3949.0032  (backed up)
Iteration 25:  Log pseudolikelihood = -3146.5351  
Iteration 26:  Log pseudolikelihood = -2702.8606  
Iteration 27:  Log pseudolikelihood = -2375.1244  
Iteration 28:  Log pseudolikelihood =  -1725.543  
Iteration 29:  Log pseudolikelihood = -1094.3365  
Iteration 30:  Log pseudolikelihood = -941.57428  
Iteration 31:  Log pseudolikelihood = -531.01169  
Iteration 32:  Log pseudolikelihood =  -353.8928  
Iteration 33:  Log pseudolikelihood = -282.52731  
Iteration 34:  Log pseudolikelihood = -214.09089  
Iteration 35:  Log pseudolikelihood = -187.14916  
Iteration 36:  Log pseudolikelihood = -174.58306  
Iteration 37:  Log pseudolikelihood = -171.71825  
Iteration 38:  Log pseudolikelihood = -160.40284  
Iteration 39:  Log pseudolikelihood = -158.28692  
Iteration 40:  Log pseudolikelihood = -150.44095  
Iteration 41:  Log pseudolikelihood = -147.99584  
Iteration 42:  Log pseudolikelihood = -140.47645  
Iteration 43:  Log pseudolikelihood = -132.92674  
Iteration 44:  Log pseudolikelihood =  -127.2179  
Iteration 45:  Log pseudolikelihood = -109.81909  
Iteration 46:  Log pseudolikelihood = -103.50368  
Iteration 47:  Log pseudolikelihood = -102.38547  
Iteration 48:  Log pseudolikelihood = -100.25308  
Iteration 49:  Log pseudolikelihood = -98.243713  
Iteration 50:  Log pseudolikelihood = -95.572164  
Iteration 51:  Log pseudolikelihood = -94.676693  
Iteration 52:  Log pseudolikelihood = -93.729947  
Iteration 53:  Log pseudolikelihood = -92.922891  
Iteration 54:  Log pseudolikelihood = -91.588908  
Iteration 55:  Log pseudolikelihood = -90.467598  
Iteration 56:  Log pseudolikelihood = -89.957819  
Iteration 57:  Log pseudolikelihood = -89.746079  
Iteration 58:  Log pseudolikelihood = -89.673474  
Iteration 59:  Log pseudolikelihood = -89.663152  
Iteration 60:  Log pseudolikelihood = -89.662671  
Iteration 61:  Log pseudolikelihood = -89.662649  
Iteration 62:  Log pseudolikelihood = -89.662648  

Inefficiency effects model (truncated-normal)        Number of obs =      3727
Group variable: pid                               Number of groups =      1629
Time variable: year                             Obs per group: min =         1
                                                               avg =       2.3
                                                               max =         8

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood =   -89.6626                    Wald chi2(5)  =   3811.53

                                                    (Std. Err. adjusted for 1629 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |   1.018245   .0170056    59.88   0.000     .9849143    1.051575
                 lnPTotalCattle |  -.1565048   .1079462    -1.45   0.147    -.3680755    .0550658
lnPCompoundfeedingstuffsforcatt |   1.128881   .1510499     7.47   0.000     .8328285    1.424933
 lnPFERTILISERSANDSOILIMPROVERS |   .8765143    .136035     6.44   0.000     .6098907    1.143138
                          TREND |  -.0557834   .0062078    -8.99   0.000    -.0679504   -.0436164
                          _cons |  -12.68203    .792346   -16.01   0.000      -14.235   -11.12906
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |  -.0431394   .0077414    -5.57   0.000    -.0583122   -.0279666
                      lnspecial |  -.8970746   .0591554   -15.16   0.000    -1.013017   -.7811323
                          _cons |   5.359872   .2834122    18.91   0.000     4.804394     5.91535
--------------------------------+----------------------------------------------------------------
Usigma                          |
                   lngrassratio |   4.325771   .8730738     4.95   0.000     2.614578    6.036964
                      lnspecial |   7.828909   1.606469     4.87   0.000     4.680287    10.97753
                          _cons |    -55.459   9.419981    -5.89   0.000    -73.92183   -36.99618
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                          TREND |    .311708   .0193171    16.14   0.000     .2738473    .3495688
                          _cons |  -3.863947   .1052454   -36.71   0.000    -4.070224    -3.65767
--------------------------------+----------------------------------------------------------------
  E(sigma_u) |   .0423355                                 .0282807    .0563902
  E(sigma_v) |   .3428615                                 .3384413    .3472817
------------------------------------------------------------------------------

. estimates store `model1name'_FRA_`tech_or_cost' 

. estimates save `fadnoutdatadir'/`model1name'_FRA_`tech_or_cost'_$datestamp$timestamp.ster, replace
(note: file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_FRA_cost_2014_02_061112am.ster not found)
file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_FRA_cost_2014_02_061112am.ster saved

. di `e(converged)'
1

. 
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "IRE",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist') 


initial:       Log pseudolikelihood = -18260.666
Iteration 0:   Log pseudolikelihood = -18260.666  
Iteration 1:   Log pseudolikelihood = -13434.349  (backed up)
Iteration 2:   Log pseudolikelihood = -7622.8719  (backed up)
Iteration 3:   Log pseudolikelihood = -7497.4589  (backed up)
Iteration 4:   Log pseudolikelihood = -6425.6533  (backed up)
Iteration 5:   Log pseudolikelihood = -6369.4881  (backed up)
Iteration 6:   Log pseudolikelihood = -6131.8482  (backed up)
Iteration 7:   Log pseudolikelihood = -6075.2981  (backed up)
Iteration 8:   Log pseudolikelihood = -6007.8542  
Iteration 9:   Log pseudolikelihood =  -4783.877  
Iteration 10:  Log pseudolikelihood = -4081.0749  
Iteration 11:  Log pseudolikelihood = -3759.2684  
Iteration 12:  Log pseudolikelihood = -3651.3242  
Iteration 13:  Log pseudolikelihood = -3651.3242  (backed up)
Iteration 14:  Log pseudolikelihood = -3641.0347  
Iteration 15:  Log pseudolikelihood = -3533.5117  
Iteration 16:  Log pseudolikelihood = -3391.3291  
Iteration 17:  Log pseudolikelihood = -3163.0996  
Iteration 18:  Log pseudolikelihood = -3036.9014  
Iteration 19:  Log pseudolikelihood = -2943.5348  
Iteration 20:  Log pseudolikelihood = -2396.5157  
Iteration 21:  Log pseudolikelihood = -2229.2182  
Iteration 22:  Log pseudolikelihood = -1796.7738  
Iteration 23:  Log pseudolikelihood = -1428.8869  
Iteration 24:  Log pseudolikelihood = -935.18086  
Iteration 25:  Log pseudolikelihood = -477.09202  
Iteration 26:  Log pseudolikelihood = -282.65771  
Iteration 27:  Log pseudolikelihood =  23.549829  
Iteration 28:  Log pseudolikelihood =  121.74684  
Iteration 29:  Log pseudolikelihood =  212.66839  
Iteration 30:  Log pseudolikelihood =   267.9872  
Iteration 31:  Log pseudolikelihood =  293.85277  
Iteration 32:  Log pseudolikelihood =  309.58281  
Iteration 33:  Log pseudolikelihood =  314.77481  
Iteration 34:  Log pseudolikelihood =  320.11677  
Iteration 35:  Log pseudolikelihood =  327.22821  
Iteration 36:  Log pseudolikelihood =  331.05563  
Iteration 37:  Log pseudolikelihood =  335.00247  
Iteration 38:  Log pseudolikelihood =   336.5606  
Iteration 39:  Log pseudolikelihood =  337.52135  
Iteration 40:  Log pseudolikelihood =  337.91694  
Iteration 41:  Log pseudolikelihood =  338.47052  
Iteration 42:  Log pseudolikelihood =  338.98321  
Iteration 43:  Log pseudolikelihood =  341.34784  
Iteration 44:  Log pseudolikelihood =  342.10785  
Iteration 45:  Log pseudolikelihood =   342.4216  
Iteration 46:  Log pseudolikelihood =  343.16424  
Iteration 47:  Log pseudolikelihood =  343.22501  
Iteration 48:  Log pseudolikelihood =  343.23451  
Iteration 49:  Log pseudolikelihood =   343.2353  
Iteration 50:  Log pseudolikelihood =  343.23533  

Inefficiency effects model (truncated-normal)        Number of obs =      3549
Group variable: pid                               Number of groups =       724
Time variable: year                             Obs per group: min =         1
                                                               avg =       4.9
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood =   343.2353                    Wald chi2(5)  =   7402.14

                                                     (Std. Err. adjusted for 724 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |    .984384   .0121129    81.27   0.000      .960643    1.008125
                 lnPTotalCattle |   .2705533   .0724399     3.73   0.000     .1285738    .4125328
lnPCompoundfeedingstuffsforcatt |   1.019733    .090773    11.23   0.000     .8418212    1.197645
 lnPFERTILISERSANDSOILIMPROVERS |   .3441195   .0810692     4.24   0.000     .1852269    .5030122
                          TREND |   -.044969   .0050669    -8.88   0.000    -.0548999   -.0350382
                          _cons |   -16.3578   .5192922   -31.50   0.000     -17.3756   -15.34001
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |  -.0998233   .0137938    -7.24   0.000    -.1268586   -.0727879
                      lnspecial |  -1.019213   .0501654   -20.32   0.000    -1.117536   -.9208911
                          _cons |   13.07795          .        .       .            .           .
--------------------------------+----------------------------------------------------------------
Usigma                          |
                   lngrassratio |  -1.397906   .3153606    -4.43   0.000    -2.016002   -.7798106
                      lnspecial |   2.757505   .9449816     2.92   0.004     .9053754    4.609635
                          _cons |  -13.09381   4.434923    -2.95   0.003     -21.7861   -4.401524
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                          _cons |  -3.179744   .0846214   -37.58   0.000    -3.345599   -3.013889
--------------------------------+----------------------------------------------------------------
  E(sigma_u) |   .0779142                                 .0754564    .0803719
     sigma_v |   .2039517   .0086293    23.63   0.000     .1877208     .221586
------------------------------------------------------------------------------

. estimates store `model1name'_IRE_`tech_or_cost'

. estimates save `fadnoutdatadir'/`model1name'_IRE_`tech_or_cost'_$datestamp$timestamp.ster, replace
(note: file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_IRE_cost_2014_02_061112am.ster not found)
file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_IRE_cost_2014_02_061112am.ster saved

. di `e(converged)'
1

. 
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "UKI",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist')


initial:       Log pseudolikelihood = -23991.175
Iteration 0:   Log pseudolikelihood = -23991.175  
Iteration 1:   Log pseudolikelihood = -18498.644  (backed up)
Iteration 2:   Log pseudolikelihood = -17830.249  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   Log pseudolikelihood = -10799.095  (backed up)
Iteration 4:   Log pseudolikelihood = -10761.213  (backed up)
Iteration 5:   Log pseudolikelihood = -9732.3019  (backed up)
Iteration 6:   Log pseudolikelihood = -8596.8721  (backed up)
Iteration 7:   Log pseudolikelihood = -8589.0818  (backed up)
Iteration 8:   Log pseudolikelihood = -8084.8637  
Iteration 9:   Log pseudolikelihood = -7634.0649  (backed up)
Iteration 10:  Log pseudolikelihood = -6958.8726  
Iteration 11:  Log pseudolikelihood = -6934.3472  
Iteration 12:  Log pseudolikelihood =  -6222.521  
Iteration 13:  Log pseudolikelihood = -6078.4533  
Iteration 14:  Log pseudolikelihood = -5559.6406  
Iteration 15:  Log pseudolikelihood = -4991.2346  
Iteration 16:  Log pseudolikelihood = -3772.6173  
Iteration 17:  Log pseudolikelihood = -3665.0266  
Iteration 18:  Log pseudolikelihood = -3068.8555  
Iteration 19:  Log pseudolikelihood = -2914.2336  
Iteration 20:  Log pseudolikelihood = -2896.6358  
Iteration 21:  Log pseudolikelihood = -2896.6358  (backed up)
Iteration 22:  Log pseudolikelihood = -2896.3037  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 23:  Log pseudolikelihood = -2896.3037  (backed up)
Iteration 24:  Log pseudolikelihood = -2877.2468  (backed up)
Iteration 25:  Log pseudolikelihood =  -1844.637  (backed up)
Iteration 26:  Log pseudolikelihood = -672.95596  (backed up)
Iteration 27:  Log pseudolikelihood = -562.67172  (backed up)
Iteration 28:  Log pseudolikelihood = -559.29497  (backed up)
Iteration 29:  Log pseudolikelihood = -554.22045  (backed up)
Iteration 30:  Log pseudolikelihood = -376.81103  
Iteration 31:  Log pseudolikelihood = -332.34637  
Iteration 32:  Log pseudolikelihood = -328.32745  
Iteration 33:  Log pseudolikelihood = -319.51643  
Iteration 34:  Log pseudolikelihood = -317.80602  
Iteration 35:  Log pseudolikelihood = -294.70582  
Iteration 36:  Log pseudolikelihood = -289.38312  
Iteration 37:  Log pseudolikelihood = -281.79031  
Iteration 38:  Log pseudolikelihood = -276.11472  
Iteration 39:  Log pseudolikelihood = -275.14164  
Iteration 40:  Log pseudolikelihood = -272.47089  
Iteration 41:  Log pseudolikelihood = -269.46304  
Iteration 42:  Log pseudolikelihood = -267.36649  
Iteration 43:  Log pseudolikelihood =  -266.9446  
Iteration 44:  Log pseudolikelihood = -266.29822  
Iteration 45:  Log pseudolikelihood = -265.94323  
Iteration 46:  Log pseudolikelihood = -265.46469  
Iteration 47:  Log pseudolikelihood = -265.31097  
Iteration 48:  Log pseudolikelihood = -265.25399  
Iteration 49:  Log pseudolikelihood = -265.24387  
Iteration 50:  Log pseudolikelihood = -265.24308  
Iteration 51:  Log pseudolikelihood =  -265.2429  
Iteration 52:  Log pseudolikelihood =  -265.2429  

Inefficiency effects model (truncated-normal)        Number of obs =      4961
Group variable: pid                               Number of groups =      1682
Time variable: year                             Obs per group: min =         1
                                                               avg =       2.9
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood =  -265.2429                    Wald chi2(5)  =   9769.85

                                                    (Std. Err. adjusted for 1682 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |    .991189    .011176    88.69   0.000     .9692844    1.013094
                 lnPTotalCattle |   .2824773   .0811232     3.48   0.000     .1234788    .4414758
lnPCompoundfeedingstuffsforcatt |   .9705705   .1065852     9.11   0.000     .7616674    1.179474
 lnPFERTILISERSANDSOILIMPROVERS |   .6137901   .0966777     6.35   0.000     .4243052    .8032751
                          TREND |  -.0504789   .0067898    -7.43   0.000    -.0637867   -.0371711
                          _cons |   -21.3268   .4541212   -46.96   0.000    -22.21687   -20.43674
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |   .0172176   .0055437     3.11   0.002     .0063522     .028083
                      lnspecial |  -.8387546   .0721304   -11.63   0.000    -.9801276   -.6973816
                          _cons |   15.98282   .2922928    54.68   0.000     15.40993     16.5557
--------------------------------+----------------------------------------------------------------
Usigma                          |
                   lngrassratio |   2.198627   .4834996     4.55   0.000     1.250985    3.146269
                      lnspecial |  -2.296248   1.369504    -1.68   0.094    -4.980426    .3879308
                          _cons |  -1.756786   5.769211    -0.30   0.761    -13.06423     9.55066
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                          _cons |  -2.800038   .0669579   -41.82   0.000    -2.931273   -2.668803
--------------------------------+----------------------------------------------------------------
  E(sigma_u) |   .0514477                                 .0498037    .0530917
     sigma_v |   .2465923   .0082557    29.87   0.000     .2309309    .2633157
------------------------------------------------------------------------------

. estimates store `model1name'_UKI_`tech_or_cost'

. estimates save `fadnoutdatadir'/`model1name'_UKI_`tech_or_cost'_$datestamp$timestamp.ster, replace
(note: file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_UKI_cost_2014_02_061112am.ster not found)
file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_UKI_cost_2014_02_061112am.ster saved

. di `e(converged)'
1

. 
. sfpanel `dep_vlist' `indep_vlist' TREND if atl_plains == 1, `cost'  model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usi
> gma(`z_vlist') vsigma(TREND)


initial:       Log pseudolikelihood = -36775.006
Iteration 0:   Log pseudolikelihood = -36775.006  
Iteration 1:   Log pseudolikelihood = -21749.985  (backed up)
Iteration 2:   Log pseudolikelihood = -17760.886  (backed up)
Iteration 3:   Log pseudolikelihood = -17667.024  (backed up)
Iteration 4:   Log pseudolikelihood = -16898.296  (backed up)
Iteration 5:   Log pseudolikelihood = -16855.231  (backed up)
Iteration 6:   Log pseudolikelihood = -16850.746  (backed up)
Iteration 7:   Log pseudolikelihood = -16782.295  (backed up)
Iteration 8:   Log pseudolikelihood = -16712.316  (backed up)
Iteration 9:   Log pseudolikelihood = -14006.933  
Iteration 10:  Log pseudolikelihood = -13324.618  (backed up)
Iteration 11:  Log pseudolikelihood = -13037.116  
Iteration 12:  Log pseudolikelihood = -12614.586  
Iteration 13:  Log pseudolikelihood = -10636.025  
Iteration 14:  Log pseudolikelihood =  -10499.33  
Iteration 15:  Log pseudolikelihood = -10484.827  (backed up)
Iteration 16:  Log pseudolikelihood = -10479.463  (backed up)
Iteration 17:  Log pseudolikelihood = -10478.288  (backed up)
Iteration 18:  Log pseudolikelihood = -10477.198  (backed up)
Iteration 19:  Log pseudolikelihood = -10476.865  (backed up)
Iteration 20:  Log pseudolikelihood = -10476.836  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 21:  Log pseudolikelihood = -10476.818  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 22:  Log pseudolikelihood = -10476.817  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 23:  Log pseudolikelihood = -10476.816  (backed up)
Iteration 24:  Log pseudolikelihood = -9689.2404  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 25:  Log pseudolikelihood = -9689.2404  (backed up)
Iteration 26:  Log pseudolikelihood = -9681.8095  (backed up)
Iteration 27:  Log pseudolikelihood = -8997.4291  (backed up)
Iteration 28:  Log pseudolikelihood = -8987.9554  (backed up)
Iteration 29:  Log pseudolikelihood = -5611.9985  (backed up)
Iteration 30:  Log pseudolikelihood = -5559.8236  (backed up)
Iteration 31:  Log pseudolikelihood = -5456.8612  (backed up)
Iteration 32:  Log pseudolikelihood = -5400.5525  (backed up)
Iteration 33:  Log pseudolikelihood = -4836.4922  (backed up)
Iteration 34:  Log pseudolikelihood = -3992.5228  (backed up)
Iteration 35:  Log pseudolikelihood = -3398.5248  (backed up)
Iteration 36:  Log pseudolikelihood = -3068.4181  
Iteration 37:  Log pseudolikelihood = -1393.0333  
Iteration 38:  Log pseudolikelihood = -841.36674  
Iteration 39:  Log pseudolikelihood = -835.87971  
Iteration 40:  Log pseudolikelihood =  1535.1438  
Iteration 41:  Log pseudolikelihood =  2069.6049  
Iteration 42:  Log pseudolikelihood =  2122.7941  
Iteration 43:  Log pseudolikelihood =  2191.5103  
Iteration 44:  Log pseudolikelihood =  2214.4473  
Iteration 45:  Log pseudolikelihood =  2219.0204  
Iteration 46:  Log pseudolikelihood =  2228.8579  
Iteration 47:  Log pseudolikelihood =  2230.4878  
Iteration 48:  Log pseudolikelihood =  2230.6232  
Iteration 49:  Log pseudolikelihood =  2231.2891  
Iteration 50:  Log pseudolikelihood =  2231.3064  
Iteration 51:  Log pseudolikelihood =  2231.6673  
Iteration 52:  Log pseudolikelihood =  2231.7612  
Iteration 53:  Log pseudolikelihood =  2231.7666  
Iteration 54:  Log pseudolikelihood =   2231.767  
Iteration 55:  Log pseudolikelihood =   2231.767  

Inefficiency effects model (truncated-normal)        Number of obs =      7353
Group variable: pid                               Number of groups =      1909
Time variable: year                             Obs per group: min =         1
                                                               avg =       3.9
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood =  2231.7670                    Wald chi2(5)  =  11562.39

                                                    (Std. Err. adjusted for 1909 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |   .9812546   .0093214   105.27   0.000     .9629851    .9995241
                 lnPTotalCattle |  -.0697699   .0696829    -1.00   0.317    -.2063459    .0668062
lnPCompoundfeedingstuffsforcatt |   .7743301   .1673987     4.63   0.000     .4462347    1.102426
 lnPFERTILISERSANDSOILIMPROVERS |   .5226542   .0828377     6.31   0.000     .3602953    .6850131
                          TREND |  -.0497909    .004245   -11.73   0.000     -.058111   -.0414708
                          _cons |  -21.36733          .        .       .            .           .
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |  -.0518436   .0074689    -6.94   0.000    -.0664823    -.037205
                      lnspecial |  -.9833663   .0610059   -16.12   0.000    -1.102936   -.8637969
                          _cons |   18.16485   .6355415    28.58   0.000     16.91922    19.41049
--------------------------------+----------------------------------------------------------------
Usigma                          |
                   lngrassratio |   .3987186          .        .       .            .           .
                      lnspecial |  -4.506775          .        .       .            .           .
                          _cons |   -3.22521          .        .       .            .           .
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                          TREND |   .5616244   .0224623    25.00   0.000     .5175992    .6056497
                          _cons |  -4.713819   .0776168   -60.73   0.000    -4.865945   -4.561693
--------------------------------+----------------------------------------------------------------
  E(sigma_u) |   .0000213                                 .0000204    .0000223
  E(sigma_v) |   .4786841                                 .4710621    .4863061
------------------------------------------------------------------------------

. estimates store `model1name'_ATL_`tech_or_cost'

. estimates save `fadnoutdatadir'/`model1name'_ATL_`tech_or_cost'_$datestamp$timestamp.ster, replace
(note: file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_ATL_cost_2014_02_061112am.ster not found)
file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_ATL_cost_2014_02_061112am.ster saved

. di `e(converged)'
1

. 
. sfpanel `dep_vlist' `indep_vlist' TREND if cont_eur == 1,   `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usig
> ma(`z_vlist') 


initial:       Log pseudolikelihood = -90455.043
Iteration 0:   Log pseudolikelihood = -90455.043  
Iteration 1:   Log pseudolikelihood = -71969.594  (backed up)
Iteration 2:   Log pseudolikelihood = -32683.044  (backed up)
Iteration 3:   Log pseudolikelihood = -32174.778  (backed up)
Iteration 4:   Log pseudolikelihood = -29688.461  (backed up)
Iteration 5:   Log pseudolikelihood = -25886.042  (backed up)
Iteration 6:   Log pseudolikelihood = -23735.322  (backed up)
Iteration 7:   Log pseudolikelihood = -23460.213  (backed up)
Iteration 8:   Log pseudolikelihood = -23220.117  (backed up)
Iteration 9:   Log pseudolikelihood = -22559.193  
Iteration 10:  Log pseudolikelihood = -22084.658  (backed up)
Iteration 11:  Log pseudolikelihood = -21813.349  (backed up)
Iteration 12:  Log pseudolikelihood = -20786.736  (backed up)
Iteration 13:  Log pseudolikelihood = -19678.681  (backed up)
Iteration 14:  Log pseudolikelihood = -11767.171  
Iteration 15:  Log pseudolikelihood = -9500.0284  
Iteration 16:  Log pseudolikelihood = -8303.9423  
Iteration 17:  Log pseudolikelihood = -6464.7928  
Iteration 18:  Log pseudolikelihood =  -4592.424  
Iteration 19:  Log pseudolikelihood = -4519.9198  
Iteration 20:  Log pseudolikelihood = -4420.3917  
Iteration 21:  Log pseudolikelihood = -4388.6361  
Iteration 22:  Log pseudolikelihood = -4382.4111  
Iteration 23:  Log pseudolikelihood = -4379.1789  
Iteration 24:  Log pseudolikelihood = -4378.7913  (backed up)
Iteration 25:  Log pseudolikelihood = -4378.7858  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 26:  Log pseudolikelihood = -4378.7831  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 27:  Log pseudolikelihood = -4378.7831  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 28:  Log pseudolikelihood = -4378.7831  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 29:  Log pseudolikelihood = -4378.7831  (backed up)
Iteration 30:  Log pseudolikelihood = -4374.9749  
Iteration 31:  Log pseudolikelihood = -4369.8123  
Iteration 32:  Log pseudolikelihood = -4365.4066  
Iteration 33:  Log pseudolikelihood = -4364.6697  
Iteration 34:  Log pseudolikelihood = -4364.4387  (backed up)
Iteration 35:  Log pseudolikelihood = -4364.3803  (backed up)
Iteration 36:  Log pseudolikelihood = -4364.3509  (backed up)
Iteration 37:  Log pseudolikelihood = -4364.3435  (backed up)
Iteration 38:  Log pseudolikelihood = -4364.3398  (backed up)
Iteration 39:  Log pseudolikelihood = -4364.3389  (backed up)
Iteration 40:  Log pseudolikelihood = -4364.3384  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 41:  Log pseudolikelihood = -4364.3382  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 42:  Log pseudolikelihood = -4364.3381  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 43:  Log pseudolikelihood = -4364.3381  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 44:  Log pseudolikelihood = -4364.3381  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 45:  Log pseudolikelihood = -4364.3381  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 46:  Log pseudolikelihood = -4364.2859  (backed up)
Iteration 47:  Log pseudolikelihood = -4356.5881  
Iteration 48:  Log pseudolikelihood = -4347.2214  
Iteration 49:  Log pseudolikelihood =  -4340.568  
Iteration 50:  Log pseudolikelihood = -4339.0931  
Iteration 51:  Log pseudolikelihood = -4338.9942  
Iteration 52:  Log pseudolikelihood = -4338.9849  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 53:  Log pseudolikelihood =  -4338.973  
Iteration 54:  Log pseudolikelihood = -4338.9728  (backed up)
Iteration 55:  Log pseudolikelihood = -4338.9728  (backed up)
Iteration 56:  Log pseudolikelihood = -4338.9726  (backed up)
Iteration 57:  Log pseudolikelihood = -4338.9721  (backed up)
Iteration 58:  Log pseudolikelihood = -4338.9708  (backed up)
Iteration 59:  Log pseudolikelihood = -4338.9706  (backed up)
Iteration 60:  Log pseudolikelihood = -4338.9693  (backed up)
Iteration 61:  Log pseudolikelihood = -4338.9693  (backed up)
Iteration 62:  Log pseudolikelihood = -4338.9691  
Iteration 63:  Log pseudolikelihood = -4338.9655  
Iteration 64:  Log pseudolikelihood = -4338.9631  
Iteration 65:  Log pseudolikelihood = -4338.9623  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 66:  Log pseudolikelihood = -4338.9621  
Iteration 67:  Log pseudolikelihood = -4338.9621  (backed up)
Iteration 68:  Log pseudolikelihood = -4338.9621  (backed up)
Iteration 69:  Log pseudolikelihood = -4338.9621  (backed up)
Iteration 70:  Log pseudolikelihood = -4338.9621  (backed up)
Iteration 71:  Log pseudolikelihood = -4338.9621  (backed up)
Iteration 72:  Log pseudolikelihood = -4338.9621  (backed up)
Iteration 73:  Log pseudolikelihood = -4338.9621  (backed up)
Iteration 74:  Log pseudolikelihood = -4338.9621  (backed up)
Iteration 75:  Log pseudolikelihood = -4338.9621  (backed up)

Inefficiency effects model (truncated-normal)        Number of obs =     18253
Group variable: pid                               Number of groups =      5092
Time variable: year                             Obs per group: min =         1
                                                               avg =       3.6
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood = -4338.9621                    Wald chi2(5)  =  27255.70

                                                    (Std. Err. adjusted for 5092 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |   1.033251   .0072089   143.33   0.000     1.019122     1.04738
                 lnPTotalCattle |   .0126241   .0459243     0.27   0.783    -.0773858     .102634
lnPCompoundfeedingstuffsforcatt |   .6499794   .0316044    20.57   0.000     .5880358    .7119229
 lnPFERTILISERSANDSOILIMPROVERS |   .7032475   .0536898    13.10   0.000     .5980174    .8084776
                          TREND |  -.0258635   .0027504    -9.40   0.000    -.0312542   -.0204728
                          _cons |  -10.04211          .        .       .            .           .
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |   .0056517   .0028584     1.98   0.048     .0000495     .011254
                      lnspecial |  -.7338315   .0435942   -16.83   0.000    -.8192745   -.6483885
                          _cons |   4.642598   .2282171    20.34   0.000     4.195301    5.089895
--------------------------------+----------------------------------------------------------------
Usigma                          |
                   lngrassratio |  -3.370097   .4227595    -7.97   0.000     -4.19869   -2.541503
                      lnspecial |    3.57323          .        .       .            .           .
                          _cons |  -46.66738          .        .       .            .           .
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                          _cons |  -2.362451   .0284408   -83.07   0.000    -2.418194   -2.306708
--------------------------------+----------------------------------------------------------------
  E(sigma_u) |   3.17e-06                                 2.19e-06    4.15e-06
     sigma_v |   .3069024   .0043643    70.32   0.000     .2984666    .3155765
------------------------------------------------------------------------------

. estimates store `model1name'_CEU_`tech_or_cost'

. estimates save `fadnoutdatadir'/`model1name'_CEU_`tech_or_cost'_$datestamp$timestamp.ster, replace
(note: file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_CEU_cost_2014_02_061112am.ster not found)
file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_CEU_cost_2014_02_061112am.ster saved

. di `e(converged)'
1

. 
. * BEST RESULT Effect on Mu parameter = -0.0054 Sigma U Parameter = 2.308268 need to figure out partial effect for this. Non-monoto
> nic effect of grass. HARD CODE for reference. 
. *sfpanel lntotalspecificcosts lndairyproducts lnPTotalCattle lnPCompoundfeedingstuffsforcatt lnPFERTILISERSANDSOILIMPROVERS TREND 
> , cost model(bc95) d(tnormal) posthessian robust emean(lngrassratio lnspecial) usigma(lngrassratio lnspecial) vsigma(TREND)
. 
. sfpanel `dep_vlist' `indep_vlist' TREND , `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usigma(`z_vlist') vsig
> ma(TREND)


initial:       Log pseudolikelihood = -127529.32
Iteration 0:   Log pseudolikelihood = -127529.32  
Iteration 1:   Log pseudolikelihood = -68827.285  (backed up)
Iteration 2:   Log pseudolikelihood =  -57578.35  (backed up)
Iteration 3:   Log pseudolikelihood = -57061.161  (backed up)
Iteration 4:   Log pseudolikelihood = -54587.567  (backed up)
Iteration 5:   Log pseudolikelihood = -53533.717  (backed up)
Iteration 6:   Log pseudolikelihood = -53489.536  (backed up)
Iteration 7:   Log pseudolikelihood = -53386.514  (backed up)
Iteration 8:   Log pseudolikelihood = -53337.871  (backed up)
Iteration 9:   Log pseudolikelihood = -53285.283  (backed up)
Iteration 10:  Log pseudolikelihood = -45218.979  (backed up)
Iteration 11:  Log pseudolikelihood = -37513.474  (backed up)
Iteration 12:  Log pseudolikelihood = -33623.351  (backed up)
Iteration 13:  Log pseudolikelihood = -32881.116  (backed up)
Iteration 14:  Log pseudolikelihood = -32675.992  (backed up)
Iteration 15:  Log pseudolikelihood =     -29200  
Iteration 16:  Log pseudolikelihood = -26613.967  
Iteration 17:  Log pseudolikelihood = -22386.728  
Iteration 18:  Log pseudolikelihood = -21594.561  
Iteration 19:  Log pseudolikelihood = -21543.621  (backed up)
Iteration 20:  Log pseudolikelihood = -16691.559  
Iteration 21:  Log pseudolikelihood = -12445.742  
Iteration 22:  Log pseudolikelihood = -10694.325  
Iteration 23:  Log pseudolikelihood = -7980.9527  
Iteration 24:  Log pseudolikelihood = -7389.3241  
Iteration 25:  Log pseudolikelihood = -7235.5898  (backed up)
Iteration 26:  Log pseudolikelihood = -7214.0094  (backed up)
Iteration 27:  Log pseudolikelihood = -7212.1436  (backed up)
Iteration 28:  Log pseudolikelihood = -7210.7612  (backed up)
Iteration 29:  Log pseudolikelihood = -7210.3092  (backed up)
Iteration 30:  Log pseudolikelihood = -7210.0336  (backed up)
Iteration 31:  Log pseudolikelihood = -7209.9542  (backed up)
Iteration 32:  Log pseudolikelihood = -7209.9337  (backed up)
Iteration 33:  Log pseudolikelihood = -7209.9286  (backed up)
Iteration 34:  Log pseudolikelihood = -7209.9273  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 35:  Log pseudolikelihood = -7209.9266  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 36:  Log pseudolikelihood =  -7209.926  (backed up)
Iteration 37:  Log pseudolikelihood =  1078.2714  (backed up)
Iteration 38:  Log pseudolikelihood =   2452.594  
Iteration 39:  Log pseudolikelihood =  2736.0902  
Iteration 40:  Log pseudolikelihood =   3343.182  
Iteration 41:  Log pseudolikelihood =  3370.1725  
Iteration 42:  Log pseudolikelihood =  3430.7253  
Iteration 43:  Log pseudolikelihood =  3551.2754  
Iteration 44:  Log pseudolikelihood =  3576.5788  
Iteration 45:  Log pseudolikelihood =  3635.0632  
Iteration 46:  Log pseudolikelihood =  3657.1783  
Iteration 47:  Log pseudolikelihood =  3661.1198  
Iteration 48:  Log pseudolikelihood =   3667.269  
Iteration 49:  Log pseudolikelihood =  3698.4809  
Iteration 50:  Log pseudolikelihood =   3699.815  
Iteration 51:  Log pseudolikelihood =  3715.0157  
Iteration 52:  Log pseudolikelihood =  3721.2098  
Iteration 53:  Log pseudolikelihood =   3725.237  
Iteration 54:  Log pseudolikelihood =  3726.9294  
Iteration 55:  Log pseudolikelihood =  3727.9182  
Iteration 56:  Log pseudolikelihood =  3728.0949  
Iteration 57:  Log pseudolikelihood =  3728.2414  
Iteration 58:  Log pseudolikelihood =  3729.3149  
Iteration 59:  Log pseudolikelihood =   3731.267  
Iteration 60:  Log pseudolikelihood =   3731.384  
Iteration 61:  Log pseudolikelihood =  3731.3864  
Iteration 62:  Log pseudolikelihood =  3731.4406  
Iteration 63:  Log pseudolikelihood =  3731.8534  
Iteration 64:  Log pseudolikelihood =  3732.0719  
Iteration 65:  Log pseudolikelihood =  3732.1219  
Iteration 66:  Log pseudolikelihood =  3732.1345  
Iteration 67:  Log pseudolikelihood =  3732.1356  
Iteration 68:  Log pseudolikelihood =  3732.1356  

Inefficiency effects model (truncated-normal)        Number of obs =     25606
Group variable: pid                               Number of groups =      7001
Time variable: year                             Obs per group: min =         1
                                                               avg =       3.7
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood =  3732.1356                    Wald chi2(5)  =  31056.66

                                                    (Std. Err. adjusted for 7001 clusters in pid)
-------------------------------------------------------------------------------------------------
                                |               Robust
           lntotalspecificcosts |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
Frontier                        |
                lndairyproducts |   1.021172   .0058682   174.02   0.000      1.00967    1.032674
                 lnPTotalCattle |   .0908232   .0384272     2.36   0.018     .0155072    .1661392
lnPCompoundfeedingstuffsforcatt |   .8211557   .0782973    10.49   0.000     .6676959    .9746156
 lnPFERTILISERSANDSOILIMPROVERS |   .3718991   .0495539     7.50   0.000     .2747753    .4690229
                          TREND |  -.0256454   .0023293   -11.01   0.000    -.0302108     -.02108
                          _cons |  -9.368743   1.519443    -6.17   0.000     -12.3468   -6.390689
--------------------------------+----------------------------------------------------------------
Mu                              |
                   lngrassratio |  -.0054131   .0028567    -1.89   0.058    -.0110122     .000186
                      lnspecial |   -.854449   .0457637   -18.67   0.000    -.9441441   -.7647538
                          _cons |   5.425669   1.488719     3.64   0.000     2.507834    8.343504
--------------------------------+----------------------------------------------------------------
Usigma                          |
                   lngrassratio |   2.308268   .4753376     4.86   0.000     1.376623    3.239912
                      lnspecial |   13.88524   2.056493     6.75   0.000     9.854583    17.91589
                          _cons |  -75.53368   8.781422    -8.60   0.000    -92.74495   -58.32241
--------------------------------+----------------------------------------------------------------
Vsigma                          |
                          TREND |   .5547151   .0123843    44.79   0.000     .5304423    .5789879
                          _cons |  -4.538382    .051596   -87.96   0.000    -4.639508   -4.437256
--------------------------------+----------------------------------------------------------------
  E(sigma_u) |   197.6849                                -186.7471     582.117
  E(sigma_v) |   .5214682                                 .5171171    .5258193
------------------------------------------------------------------------------

. estimates store `model1name'_ALL_`tech_or_cost'

. estimates save `fadnoutdatadir'/`model1name'_ALL_`tech_or_cost'_$datestamp$timestamp.ster, replace
(note: file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_ALL_cost_2014_02_061112am.ster not found)
file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_ALL_cost_2014_02_061112am.ster saved

. di `e(converged)'
1

. 
. log close
      name:  <unnamed>
       log:  D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.txt
  log type:  text
 closed on:   6 Feb 2014, 11:24:52
------------------------------------------------------------------------------------------------------------------------------------
------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.txt
  log type:  text
 opened on:   6 Feb 2014, 12:14:18

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  12:14:18  on  6 Feb 2014

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(cmdlog D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file D:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. 
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') vs
> igma(TREND)

note: half_lnX_23 omitted because of collinearity
note: half_lnX_24 omitted because of collinearity
note: half_lnX_33 omitted because of collinearity
note: half_lnX_34 omitted because of collinearity
note: half_lnX_44 omitted because of collinearity

initial:       Log pseudolikelihood =  -39625.47
Iteration 0:   Log pseudolikelihood =  -39625.47  
Iteration 1:   Log pseudolikelihood = -39069.584  (backed up)
Iteration 2:   Log pseudolikelihood = -37891.655  (backed up)
Iteration 3:   Log pseudolikelihood = -36831.654  (backed up)
Iteration 4:   Log pseudolikelihood = -36318.305  (backed up)
Iteration 5:   Log pseudolikelihood = -36148.306  (backed up)
Iteration 6:   Log pseudolikelihood = -32048.631  (backed up)
Iteration 7:   Log pseudolikelihood = -31941.751  (backed up)
Iteration 8:   Log pseudolikelihood = -31890.183  (backed up)
Iteration 9:   Log pseudolikelihood = -31869.677  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 10:  Log pseudolikelihood = -31515.417  
Iteration 11:  Log pseudolikelihood = -31402.331  (backed up)
Iteration 12:  Log pseudolikelihood =  -31359.08  (backed up)
Iteration 13:  Log pseudolikelihood =  -29422.56  (backed up)
Iteration 14:  Log pseudolikelihood = -28490.682  (backed up)
Iteration 15:  Log pseudolikelihood =  -25890.57  (backed up)
Iteration 16:  Log pseudolikelihood =  -23022.62  (backed up)
Iteration 17:  Log pseudolikelihood = -21902.756  (backed up)
Iteration 18:  Log pseudolikelihood = -21680.865  (backed up)
Iteration 19:  Log pseudolikelihood = -21633.651  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 20:  Log pseudolikelihood = -21540.524  (backed up)
Iteration 21:  Log pseudolikelihood = -21320.272  (backed up)
Iteration 22:  Log pseudolikelihood = -21172.096  (backed up)
Iteration 23:  Log pseudolikelihood = -19488.587  (backed up)
Iteration 24:  Log pseudolikelihood = -19347.713  (backed up)
Iteration 25:  Log pseudolikelihood = -19309.376  (backed up)
Iteration 26:  Log pseudolikelihood = -19302.461  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 27:  Log pseudolikelihood = -19302.263  (backed up)
Iteration 28:  Log pseudolikelihood = -19056.872  (backed up)
Iteration 29:  Log pseudolikelihood = -18832.792  (backed up)
Iteration 30:  Log pseudolikelihood = -18818.936  (backed up)
Iteration 31:  Log pseudolikelihood = -18816.366  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 32:  Log pseudolikelihood = -18809.381  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 33:  Log pseudolikelihood = -18809.223  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 34:  Log pseudolikelihood = -18809.219  (backed up)
Iteration 35:  Log pseudolikelihood = -18396.897  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 36:  Log pseudolikelihood = -16675.813  
Iteration 37:  Log pseudolikelihood = -16150.387  (backed up)
Iteration 38:  Log pseudolikelihood = -16068.666  (backed up)
Iteration 39:  Log pseudolikelihood = -15920.708  (backed up)
Iteration 40:  Log pseudolikelihood = -15864.849  (backed up)
Iteration 41:  Log pseudolikelihood = -14470.258  (backed up)
Iteration 42:  Log pseudolikelihood =  -10913.93  (backed up)
Iteration 43:  Log pseudolikelihood = -10628.652  (backed up)
Iteration 44:  Log pseudolikelihood = -10580.238  (backed up)
Iteration 45:  Log pseudolikelihood = -9960.5454  (backed up)
Iteration 46:  Log pseudolikelihood = -9878.7872  (backed up)
Iteration 47:  Log pseudolikelihood = -9097.6829  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 48:  Log pseudolikelihood = -7384.6294  
Iteration 49:  Log pseudolikelihood = -7207.9689  (backed up)
Iteration 50:  Log pseudolikelihood = -4884.3939  (backed up)
Iteration 51:  Log pseudolikelihood = -4868.7388  (backed up)
Iteration 52:  Log pseudolikelihood = -4382.8396  (backed up)
Iteration 53:  Log pseudolikelihood = -4365.7279  (backed up)
Iteration 54:  Log pseudolikelihood = -3676.5801  (backed up)
Iteration 55:  Log pseudolikelihood =  -3538.604  (backed up)
Iteration 56:  Log pseudolikelihood = -3513.6094  (backed up)
Iteration 57:  Log pseudolikelihood = -3455.8078  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 58:  Log pseudolikelihood = -3229.0198  (backed up)
Iteration 59:  Log pseudolikelihood = -1003.3438  (backed up)
Iteration 60:  Log pseudolikelihood = -871.39552  (backed up)
Iteration 61:  Log pseudolikelihood = -849.89451  (backed up)
Iteration 62:  Log pseudolikelihood = -682.50749  (backed up)
Iteration 63:  Log pseudolikelihood =  -646.5331  (backed up)
Iteration 64:  Log pseudolikelihood = -641.09944  (backed up)
Iteration 65:  Log pseudolikelihood = -639.66404  (backed up)
Iteration 66:  Log pseudolikelihood = -638.51268  (backed up)
Iteration 67:  Log pseudolikelihood = -638.41781  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 68:  Log pseudolikelihood =  -638.4104  (backed up)
Iteration 69:  Log pseudolikelihood = -552.16255  (backed up)
Iteration 70:  Log pseudolikelihood = -552.14373  (backed up)
Iteration 71:  Log pseudolikelihood =   -552.132  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 72:  Log pseudolikelihood = -552.13189  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 73:  Log pseudolikelihood = -552.13182  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 74:  Log pseudolikelihood = -552.13181  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 75:  Log pseudolikelihood = -552.13181  (backed up)
Iteration 76:  Log pseudolikelihood = -477.21854  (backed up)
Iteration 77:  Log pseudolikelihood = -376.75243  (backed up)
Iteration 78:  Log pseudolikelihood =   -325.138  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 79:  Log pseudolikelihood =  465.26354  (backed up)
Iteration 80:  Log pseudolikelihood =  465.26674  (backed up)
Iteration 81:  Log pseudolikelihood =  613.42502  (backed up)
Iteration 82:  Log pseudolikelihood =   965.0035  (backed up)
Iteration 83:  Log pseudolikelihood =   1354.113  (backed up)
Iteration 84:  Log pseudolikelihood =  1423.4215  (backed up)
Iteration 85:  Log pseudolikelihood =  1445.9557  (backed up)
Iteration 86:  Log pseudolikelihood =  1449.3826  (backed up)
Iteration 87:  Log pseudolikelihood =  1498.8281  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 88:  Log pseudolikelihood =  1757.5492  (backed up)
Iteration 89:  Log pseudolikelihood =  1804.9531  (backed up)
Iteration 90:  Log pseudolikelihood =  1871.6233  (backed up)
Iteration 91:  Log pseudolikelihood =  2099.0895  (backed up)
Iteration 92:  Log pseudolikelihood =  2113.4502  (backed up)
Iteration 93:  Log pseudolikelihood =  2114.3977  (backed up)
Iteration 94:  Log pseudolikelihood =  2130.2666  (backed up)
Iteration 95:  Log pseudolikelihood =  2225.8051  (backed up)
Iteration 96:  Log pseudolikelihood =  2264.7701  (backed up)
Iteration 97:  Log pseudolikelihood =  2267.4381  (backed up)
Iteration 98:  Log pseudolikelihood =  2370.2542  (backed up)
Iteration 99:  Log pseudolikelihood =  2399.0383  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 100: Log pseudolikelihood =  2409.4037  (backed up)

Inefficiency effects model (truncated-normal)        Number of obs =     13369
Group variable: pid                               Number of groups =      2966
Time variable: year                             Obs per group: min =         1
                                                               avg =       4.5
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood =  2409.4037                    Wald chi2(8)  =  8.04e+15

                                 (Std. Err. adjusted for 2966 clusters in pid)
------------------------------------------------------------------------------
             |               Robust
lntotalspe~s |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
Frontier     |
        CD_1 |   8.03e-08   3.99e-08     2.01   0.044     2.07e-09    1.58e-07
        CD_2 |   1.419728   1.741056     0.82   0.415    -1.992679    4.832136
        CD_3 |   .0619916   .0072786     8.52   0.000     .0477259    .0762573
        CD_4 |   .0039556   .0005665     6.98   0.000     .0028452    .0050659
 half_lnX_11 |   7.978936   .8039106     9.93   0.000       6.4033    9.554572
 half_lnX_12 |  -1.679446          .        .       .            .           .
 half_lnX_13 |  -12.00963   1.611164    -7.45   0.000    -15.16745   -8.851805
 half_lnX_14 |  -.3117935          .        .       .            .           .
 half_lnX_22 |   .1014732   1.677798     0.06   0.952    -3.186951    3.389897
 half_lnX_23 |  -4.74e-19  (omitted)
 half_lnX_24 |  -6.22e-19  (omitted)
 half_lnX_33 |   3.75e-21  (omitted)
 half_lnX_34 |  -3.21e-20  (omitted)
 half_lnX_44 |   4.81e-21  (omitted)
       TREND |   .0003065   .0031429     0.10   0.922    -.0058535    .0064665
       _cons |   18.45897   3.764726     4.90   0.000     11.08024    25.83769
-------------+----------------------------------------------------------------
Mu           |
lngrassratio |    .006233   .0038876     1.60   0.109    -.0013864    .0138525
   lnspecial |   -.703822   .1184546    -5.94   0.000    -.9359888   -.4716552
       _cons |   3.223309   .5041199     6.39   0.000     2.235252    4.211366
-------------+----------------------------------------------------------------
Usigma       |
       _cons |  -7.218146   .2614053   -27.61   0.000    -7.730491   -6.705801
-------------+----------------------------------------------------------------
Vsigma       |
       TREND |   .6166664    .018973    32.50   0.000       .57948    .6538527
       _cons |  -4.551589   .0633273   -71.87   0.000    -4.675708    -4.42747
-------------+----------------------------------------------------------------
  E(sigma_v) |   .6493211                                 .6411911    .6574511
     sigma_u |   .0270769    .003539     7.65   0.000     .0209578    .0349827
------------------------------------------------------------------------------

. estimates store `model1name'_DEU_`tech_or_cost'

. estimates save `fadnoutdatadir'/`model1name'_DEU_`tech_or_cost'_$datestamp$timestamp.ster, replace
(note: file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_DEU_cost_2014_02_061214pm.ster not found)
file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_DEU_cost_2014_02_061214pm.ster saved

. di `e(converged)'
0

. 
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "FRA",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist') vsigma(TREND)

note: half_lnX_22 omitted because of collinearity
note: half_lnX_23 omitted because of collinearity
note: half_lnX_24 omitted because of collinearity
note: half_lnX_33 omitted because of collinearity
note: half_lnX_34 omitted because of collinearity
note: half_lnX_44 omitted because of collinearity

initial:       Log pseudolikelihood = -18727.099
Iteration 0:   Log pseudolikelihood = -18727.099  
Iteration 1:   Log pseudolikelihood = -18123.678  (backed up)
Iteration 2:   Log pseudolikelihood = -15617.591  (backed up)
Iteration 3:   Log pseudolikelihood =  -15599.54  (backed up)
Iteration 4:   Log pseudolikelihood = -15587.016  (backed up)
Iteration 5:   Log pseudolikelihood = -15522.533  (backed up)
Iteration 6:   Log pseudolikelihood = -15324.891  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 7:   Log pseudolikelihood = -14615.912  (backed up)
Iteration 8:   Log pseudolikelihood = -14609.916  (backed up)
Iteration 9:   Log pseudolikelihood = -13494.985  (backed up)
Iteration 10:  Log pseudolikelihood = -12708.365  (backed up)
Iteration 11:  Log pseudolikelihood = -12426.254  (backed up)
Iteration 12:  Log pseudolikelihood = -11582.771  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 13:  Log pseudolikelihood = -10907.987  (backed up)
Iteration 14:  Log pseudolikelihood = -10254.627  (backed up)
Iteration 15:  Log pseudolikelihood = -9474.8717  (backed up)
Iteration 16:  Log pseudolikelihood = -9065.2392  (backed up)
Iteration 17:  Log pseudolikelihood = -9063.5267  (backed up)
Iteration 18:  Log pseudolikelihood = -9047.3677  (backed up)
Iteration 19:  Log pseudolikelihood = -9040.1082  (backed up)
Iteration 20:  Log pseudolikelihood = -9033.9192  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 21:  Log pseudolikelihood = -8957.5509  
Iteration 22:  Log pseudolikelihood = -8856.2878  (backed up)
Iteration 23:  Log pseudolikelihood = -8411.2997  (backed up)
Iteration 24:  Log pseudolikelihood =  -8293.092  (backed up)
Iteration 25:  Log pseudolikelihood = -8138.0019  (backed up)
Iteration 26:  Log pseudolikelihood =  -8073.832  (backed up)
Iteration 27:  Log pseudolikelihood = -7933.3228  (backed up)
Iteration 28:  Log pseudolikelihood = -7910.2713  (backed up)
Iteration 29:  Log pseudolikelihood = -7839.5184  (backed up)
Iteration 30:  Log pseudolikelihood = -7777.6531  (backed up)
Iteration 31:  Log pseudolikelihood = -7677.4809  (backed up)
Iteration 32:  Log pseudolikelihood = -7432.2763  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 33:  Log pseudolikelihood = -6167.5049  (backed up)
Iteration 34:  Log pseudolikelihood = -5226.1438  (backed up)
Iteration 35:  Log pseudolikelihood = -5220.7719  (backed up)
Iteration 36:  Log pseudolikelihood = -4914.5523  (backed up)
Iteration 37:  Log pseudolikelihood = -4005.4439  (backed up)
Iteration 38:  Log pseudolikelihood = -3820.2768  (backed up)
Iteration 39:  Log pseudolikelihood = -3703.7694  (backed up)
Iteration 40:  Log pseudolikelihood = -3647.9342  (backed up)
Iteration 41:  Log pseudolikelihood = -3645.1096  (backed up)
Iteration 42:  Log pseudolikelihood = -3644.1187  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 43:  Log pseudolikelihood = -3544.8306  (backed up)
Iteration 44:  Log pseudolikelihood = -3531.8142  (backed up)
Iteration 45:  Log pseudolikelihood = -1672.7403  (backed up)
Iteration 46:  Log pseudolikelihood = -1421.8445  (backed up)
Iteration 47:  Log pseudolikelihood = -1203.9994  (backed up)
Iteration 48:  Log pseudolikelihood = -1186.1471  (backed up)
Iteration 49:  Log pseudolikelihood =  -1166.512  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 50:  Log pseudolikelihood = -1056.9048  (backed up)
Iteration 51:  Log pseudolikelihood = -1036.1755  (backed up)
Iteration 52:  Log pseudolikelihood = -954.16509  (backed up)
Iteration 53:  Log pseudolikelihood = -913.72996  (backed up)
Iteration 54:  Log pseudolikelihood = -863.74423  (backed up)
Iteration 55:  Log pseudolikelihood =  -859.5453  (backed up)
Iteration 56:  Log pseudolikelihood = -859.05361  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 57:  Log pseudolikelihood = -858.92667  (backed up)
Iteration 58:  Log pseudolikelihood = -851.15678  (backed up)
Iteration 59:  Log pseudolikelihood = -845.92305  (backed up)
Iteration 60:  Log pseudolikelihood = -845.91567  (backed up)
Iteration 61:  Log pseudolikelihood = -845.91369  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 62:  Log pseudolikelihood = -845.91362  (backed up)
numerical derivatives are approximate
nearby values are missing
Iteration 63:  Log pseudolikelihood = -845.91361  (backed up)
numerical derivatives are approximate
nearby values are missing
numerical derivatives are approximate
nearby values are missing
Iteration 64:  Log pseudolikelihood =  -845.9136  (backed up)
numerical derivatives are approximate
nearby values are missing
could not calculate numerical derivatives -- discontinuous region with missing values encountered
numerical derivatives are approximate
nearby values are missing
could not calculate numerical derivatives -- discontinuous region with missing values encountered
estimates post: matrix has missing values
r(504);

end of do-file

r(504);

. do msward_2014_02_06_cost.do

. * Based on msward_code_clarity.do
. capture log close
------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.txt
  log type:  text
 opened on:   6 Feb 2014, 12:17:10

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  12:17:10  on  6 Feb 2014

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(cmdlog D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file D:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') vs
> igma(TREND)
> estimates store `model1name'_DEU_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_DEU_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "FRA",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist') vsigma(TREND)
> estimates store `model1name'_FRA_`tech_or_cost' 
> estimates save `fadnoutdatadir'/`model1name'_FRA_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> */
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "IRE",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist') 

note: half_lnX_22 omitted because of collinearity
note: half_lnX_23 omitted because of collinearity
note: half_lnX_24 omitted because of collinearity
note: half_lnX_33 omitted because of collinearity
note: half_lnX_34 omitted because of collinearity
note: half_lnX_44 omitted because of collinearity

initial:       Log pseudolikelihood =  -16444.81
Iteration 0:   Log pseudolikelihood =  -16444.81  
Iteration 1:   Log pseudolikelihood = -16095.556  (backed up)
Iteration 2:   Log pseudolikelihood = -12857.046  (backed up)
Iteration 3:   Log pseudolikelihood = -12852.381  (backed up)
Iteration 4:   Log pseudolikelihood = -11372.874  (backed up)
Iteration 5:   Log pseudolikelihood = -11365.118  (backed up)
Iteration 6:   Log pseudolikelihood = -10138.137  (backed up)
Iteration 7:   Log pseudolikelihood = -10090.667  (backed up)
Iteration 8:   Log pseudolikelihood = -10064.506  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 9:   Log pseudolikelihood = -9876.7497  
Iteration 10:  Log pseudolikelihood = -9315.4068  (backed up)
Iteration 11:  Log pseudolikelihood =  -9099.123  (backed up)
Iteration 12:  Log pseudolikelihood = -8633.5192  (backed up)
Iteration 13:  Log pseudolikelihood =  -8557.162  (backed up)
Iteration 14:  Log pseudolikelihood = -8363.5331  (backed up)
Iteration 15:  Log pseudolikelihood = -8117.7268  (backed up)
Iteration 16:  Log pseudolikelihood = -8108.1029  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 17:  Log pseudolikelihood = -7715.4001  (backed up)
Iteration 18:  Log pseudolikelihood = -5880.4837  (backed up)
Iteration 19:  Log pseudolikelihood =    -5793.7  (backed up)
Iteration 20:  Log pseudolikelihood = -3973.5036  (backed up)
Iteration 21:  Log pseudolikelihood = -3408.2811  (backed up)
Iteration 22:  Log pseudolikelihood = -2846.0266  (backed up)
Iteration 23:  Log pseudolikelihood = -2508.2497  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 24:  Log pseudolikelihood = -2401.8705  (backed up)
Iteration 25:  Log pseudolikelihood = -2393.6636  (backed up)
Iteration 26:  Log pseudolikelihood = -2390.1076  (backed up)
Iteration 27:  Log pseudolikelihood = -1983.9091  (backed up)
Iteration 28:  Log pseudolikelihood = -1796.4728  (backed up)
Iteration 29:  Log pseudolikelihood = -1779.5942  (backed up)
Iteration 30:  Log pseudolikelihood = -1563.9286  (backed up)
Iteration 31:  Log pseudolikelihood = -1485.9436  (backed up)
Iteration 32:  Log pseudolikelihood = -1478.3159  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 33:  Log pseudolikelihood = -1458.0106  (backed up)
Iteration 34:  Log pseudolikelihood = -1457.0358  (backed up)
Iteration 35:  Log pseudolikelihood = -1449.0731  (backed up)
Iteration 36:  Log pseudolikelihood = -1034.6214  (backed up)
Iteration 37:  Log pseudolikelihood = -436.53468  (backed up)
Iteration 38:  Log pseudolikelihood = -407.37678  (backed up)
Iteration 39:  Log pseudolikelihood = -404.26538  (backed up)
Iteration 40:  Log pseudolikelihood = -403.71309  (backed up)
Iteration 41:  Log pseudolikelihood = -393.59995  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 42:  Log pseudolikelihood =  -365.5025  (backed up)
Iteration 43:  Log pseudolikelihood = -352.66011  (backed up)
Iteration 44:  Log pseudolikelihood =  -352.1325  (backed up)
Iteration 45:  Log pseudolikelihood = -200.82698  (backed up)
Iteration 46:  Log pseudolikelihood = -138.30791  (backed up)
Iteration 47:  Log pseudolikelihood = -117.45796  (backed up)
Iteration 48:  Log pseudolikelihood = -81.825891  (backed up)
Iteration 49:  Log pseudolikelihood = -77.039056  (backed up)
Iteration 50:  Log pseudolikelihood = -74.083658  (backed up)
Iteration 51:  Log pseudolikelihood = -42.607679  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 52:  Log pseudolikelihood =  59.939866  (backed up)
Iteration 53:  Log pseudolikelihood =  62.807691  (backed up)
Iteration 54:  Log pseudolikelihood =   62.82742  (backed up)
Iteration 55:  Log pseudolikelihood =  78.054114  (backed up)
Iteration 56:  Log pseudolikelihood =  83.059114  (backed up)
Iteration 57:  Log pseudolikelihood =  84.918516  (backed up)
Iteration 58:  Log pseudolikelihood =  93.735685  (backed up)
Iteration 59:  Log pseudolikelihood =  96.087545  (backed up)
Iteration 60:  Log pseudolikelihood =  119.25503  (backed up)
Iteration 61:  Log pseudolikelihood =  138.96338  (backed up)
Iteration 62:  Log pseudolikelihood =  142.84828  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 63:  Log pseudolikelihood =  244.84896  
Iteration 64:  Log pseudolikelihood =  246.14073  (backed up)
Iteration 65:  Log pseudolikelihood =  248.82249  (backed up)
Iteration 66:  Log pseudolikelihood =  259.59219  (backed up)
Iteration 67:  Log pseudolikelihood =   285.2147  (backed up)
Iteration 68:  Log pseudolikelihood =  288.40783  (backed up)
Iteration 69:  Log pseudolikelihood =  289.18083  (backed up)
Iteration 70:  Log pseudolikelihood =  324.47958  (backed up)
Iteration 71:  Log pseudolikelihood =  328.39964  (backed up)
Iteration 72:  Log pseudolikelihood =  332.23813  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 73:  Log pseudolikelihood =  340.94876  (backed up)
Iteration 74:  Log pseudolikelihood =  341.96643  (backed up)
Iteration 75:  Log pseudolikelihood =  341.96913  (backed up)
Iteration 76:  Log pseudolikelihood =  342.36224  (backed up)
Iteration 77:  Log pseudolikelihood =  344.44312  (backed up)
Iteration 78:  Log pseudolikelihood =  347.70301  (backed up)
Iteration 79:  Log pseudolikelihood =  348.11036  (backed up)
Iteration 80:  Log pseudolikelihood =  349.42466  (backed up)
Iteration 81:  Log pseudolikelihood =  358.70439  (backed up)
Iteration 82:  Log pseudolikelihood =  360.05148  (backed up)
Iteration 83:  Log pseudolikelihood =    360.507  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 84:  Log pseudolikelihood =  362.39513  
Iteration 85:  Log pseudolikelihood =  362.49818  (backed up)
Iteration 86:  Log pseudolikelihood =  362.49913  (backed up)
Iteration 87:  Log pseudolikelihood =  363.90912  (backed up)
Iteration 88:  Log pseudolikelihood =  364.34711  (backed up)
Iteration 89:  Log pseudolikelihood =  366.06988  (backed up)
Iteration 90:  Log pseudolikelihood =  366.15718  (backed up)
Iteration 91:  Log pseudolikelihood =  366.85042  (backed up)
Iteration 92:  Log pseudolikelihood =  368.07032  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 93:  Log pseudolikelihood =  370.39875  (backed up)
Iteration 94:  Log pseudolikelihood =   370.4261  (backed up)
Iteration 95:  Log pseudolikelihood =  370.52945  (backed up)
Iteration 96:  Log pseudolikelihood =  370.58556  (backed up)
Iteration 97:  Log pseudolikelihood =  370.81768  (backed up)
Iteration 98:  Log pseudolikelihood =  371.08316  (backed up)
Iteration 99:  Log pseudolikelihood =  371.17606  (backed up)
Iteration 100: Log pseudolikelihood =  371.24291  (backed up)

Inefficiency effects model (truncated-normal)        Number of obs =      3549
Group variable: pid                               Number of groups =       724
Time variable: year                             Obs per group: min =         1
                                                               avg =       4.9
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood =   371.2429                    Wald chi2(8)  =  7.14e+16

                                  (Std. Err. adjusted for 724 clusters in pid)
------------------------------------------------------------------------------
             |               Robust
lntotalspe~s |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
Frontier     |
        CD_1 |   3.27e-07   9.04e-08     3.61   0.000     1.49e-07    5.04e-07
        CD_2 |   .9113708     2.9629     0.31   0.758    -4.895807    6.718549
        CD_3 |   .0609847   .0007869    77.50   0.000     .0594424     .062527
        CD_4 |   .0068651   .0113903     0.60   0.547    -.0154594    .0291896
 half_lnX_11 |   7.870627   1.852105     4.25   0.000     4.240568    11.50069
 half_lnX_12 |  -1.785742   5.759598    -0.31   0.757    -13.07435    9.502863
 half_lnX_13 |  -12.09061          .        .       .            .           .
 half_lnX_14 |  -.0349243   2.416528    -0.01   0.988    -4.771232    4.701383
 half_lnX_22 |   2.79e-21  (omitted)
 half_lnX_23 |   2.83e-20  (omitted)
 half_lnX_24 |   7.22e-19  (omitted)
 half_lnX_33 |  -9.90e-20  (omitted)
 half_lnX_34 |  -1.39e-19  (omitted)
 half_lnX_44 |  -4.86e-19  (omitted)
       TREND |  -.0473509   .0050742    -9.33   0.000    -.0572961   -.0374057
       _cons |   18.32767   7.267825     2.52   0.012     4.082993    32.57234
-------------+----------------------------------------------------------------
Mu           |
lngrassratio |   -.094683   .0124043    -7.63   0.000     -.118995    -.070371
   lnspecial |   -1.03051   .0507999   -20.29   0.000    -1.130076   -.9309443
       _cons |     5.6871   .2325832    24.45   0.000     5.231245    6.142955
-------------+----------------------------------------------------------------
Usigma       |
lngrassratio |  -.2634564   .0810688    -3.25   0.001    -.4223484   -.1045645
   lnspecial |   .3478643   .2383966     1.46   0.145    -.1193844    .8151129
       _cons |  -3.746288   1.082851    -3.46   0.001    -5.868637   -1.623939
-------------+----------------------------------------------------------------
Vsigma       |
       _cons |    -8.0566          .        .       .            .           .
-------------+----------------------------------------------------------------
  E(sigma_u) |   .2198419                                 .2191851    .2204986
     sigma_v |   .0178046          .        .       .            .           .
------------------------------------------------------------------------------

. estimates store `model1name'_IRE_`tech_or_cost'

. estimates save `fadnoutdatadir'/`model1name'_IRE_`tech_or_cost'_$datestamp$timestamp.ster, replace
(note: file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_IRE_cost_2014_02_061217pm.ster not found)
file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_IRE_cost_2014_02_061217pm.ster saved

. di `e(converged)'
0

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "UKI",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist')
> estimates store `model1name'_UKI_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_UKI_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if atl_plains == 1, `cost'  model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usi
> gma(`z_vlist') vsigma(TREND)
> estimates store `model1name'_ATL_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_ATL_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if cont_eur == 1,   `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usig
> ma(`z_vlist') 
> estimates store `model1name'_CEU_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_CEU_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> * BEST RESULT Effect on Mu parameter = -0.0054 Sigma U Parameter = 2.308268 need to figure out partial effect for this. Non-monoto
> nic effect of grass. HARD CODE for reference. 
> *sfpanel lntotalspecificcosts lndairyproducts lnPTotalCattle lnPCompoundfeedingstuffsforcatt lnPFERTILISERSANDSOILIMPROVERS TREND 
> , cost model(bc95) d(tnormal) posthessian robust emean(lngrassratio lnspecial) usigma(lngrassratio lnspecial) vsigma(TREND)
> 
> sfpanel `dep_vlist' `indep_vlist' TREND , `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usigma(`z_vlist') vsig
> ma(TREND)
> estimates store `model1name'_ALL_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_ALL_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> */
. log close
      name:  <unnamed>
       log:  D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.txt
  log type:  text
 closed on:   6 Feb 2014, 12:17:55
------------------------------------------------------------------------------------------------------------------------------------
------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.txt
  log type:  text
 opened on:   6 Feb 2014, 12:28:51

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  12:28:51  on  6 Feb 2014

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(cmdlog D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file D:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') vs
> igma(TREND)
> estimates store `model1name'_DEU_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_DEU_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "FRA",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist') vsigma(TREND)
> estimates store `model1name'_FRA_`tech_or_cost' 
> estimates save `fadnoutdatadir'/`model1name'_FRA_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> */
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "IRE",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist') 

note: half_lnX_13 omitted because of collinearity
note: half_lnX_14 omitted because of collinearity
note: half_lnX_22 omitted because of collinearity
note: half_lnX_23 omitted because of collinearity
note: half_lnX_24 omitted because of collinearity
note: half_lnX_33 omitted because of collinearity
note: half_lnX_34 omitted because of collinearity
note: half_lnX_44 omitted because of collinearity
note: TREND omitted because of collinearity

initial:       Log pseudolikelihood = -4581.5535
Iteration 0:   Log pseudolikelihood = -4581.5535  
Iteration 1:   Log pseudolikelihood = -4504.8218  (backed up)
Iteration 2:   Log pseudolikelihood = -3100.9458  (backed up)
Iteration 3:   Log pseudolikelihood = -1827.2204  (backed up)
Iteration 4:   Log pseudolikelihood = -1820.5747  (backed up)
Iteration 5:   Log pseudolikelihood =  -1764.489  (backed up)
Iteration 6:   Log pseudolikelihood =  -1754.952  (backed up)
Iteration 7:   Log pseudolikelihood = -1679.9836  (backed up)
Iteration 8:   Log pseudolikelihood = -1601.7184  (backed up)
Iteration 9:   Log pseudolikelihood = -1594.0624  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 10:  Log pseudolikelihood = -1336.4503  
Iteration 11:  Log pseudolikelihood = -1250.9539  (backed up)
Iteration 12:  Log pseudolikelihood = -1216.7687  (backed up)
Iteration 13:  Log pseudolikelihood = -1210.9575  (backed up)
Iteration 14:  Log pseudolikelihood = -1143.0633  (backed up)
Iteration 15:  Log pseudolikelihood =  -966.0031  (backed up)
Iteration 16:  Log pseudolikelihood = -883.86295  (backed up)
Iteration 17:  Log pseudolikelihood =  -880.9267  (backed up)
Iteration 18:  Log pseudolikelihood = -862.43762  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 19:  Log pseudolikelihood = -838.10331  
Iteration 20:  Log pseudolikelihood = -823.62587  (backed up)
Iteration 21:  Log pseudolikelihood = -770.55546  (backed up)
Iteration 22:  Log pseudolikelihood = -766.73128  (backed up)
Iteration 23:  Log pseudolikelihood = -681.32306  (backed up)
Iteration 24:  Log pseudolikelihood = -667.24162  (backed up)
Iteration 25:  Log pseudolikelihood =  -612.9767  (backed up)
Iteration 26:  Log pseudolikelihood = -600.18104  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 27:  Log pseudolikelihood = -581.14126  
Iteration 28:  Log pseudolikelihood = -571.59529  (backed up)
Iteration 29:  Log pseudolikelihood = -523.13515  (backed up)
Iteration 30:  Log pseudolikelihood =  -521.7118  (backed up)
Iteration 31:  Log pseudolikelihood = -521.24292  (backed up)
Iteration 32:  Log pseudolikelihood = -512.08719  (backed up)
Iteration 33:  Log pseudolikelihood = -493.64301  (backed up)
Iteration 34:  Log pseudolikelihood = -483.79769  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 35:  Log pseudolikelihood = -426.73981  
Iteration 36:  Log pseudolikelihood = -424.17022  (backed up)
Iteration 37:  Log pseudolikelihood = -400.39654  (backed up)
Iteration 38:  Log pseudolikelihood = -397.74245  (backed up)
Iteration 39:  Log pseudolikelihood = -385.75232  (backed up)
Iteration 40:  Log pseudolikelihood = -361.44361  (backed up)
Iteration 41:  Log pseudolikelihood = -353.33029  (backed up)
Iteration 42:  Log pseudolikelihood = -350.71066  (backed up)
Iteration 43:  Log pseudolikelihood = -345.71103  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 44:  Log pseudolikelihood = -333.74925  (backed up)
Iteration 45:  Log pseudolikelihood = -330.11285  (backed up)
Iteration 46:  Log pseudolikelihood = -322.33244  (backed up)
Iteration 47:  Log pseudolikelihood = -318.90978  (backed up)
Iteration 48:  Log pseudolikelihood = -318.72828  (backed up)
Iteration 49:  Log pseudolikelihood = -316.32925  (backed up)
Iteration 50:  Log pseudolikelihood =  -312.0154  (backed up)
Iteration 51:  Log pseudolikelihood = -309.29469  (backed up)
Iteration 52:  Log pseudolikelihood = -308.68561  (backed up)
Iteration 53:  Log pseudolikelihood = -299.70799  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 54:  Log pseudolikelihood = -294.15726  (backed up)
Iteration 55:  Log pseudolikelihood = -292.52729  (backed up)
Iteration 56:  Log pseudolikelihood = -291.74388  (backed up)
Iteration 57:  Log pseudolikelihood = -290.66533  (backed up)
Iteration 58:  Log pseudolikelihood = -288.78268  (backed up)
Iteration 59:  Log pseudolikelihood = -283.27747  (backed up)
Iteration 60:  Log pseudolikelihood = -281.81492  (backed up)
Iteration 61:  Log pseudolikelihood = -280.45362  (backed up)
Iteration 62:  Log pseudolikelihood = -279.94842  (backed up)
Iteration 63:  Log pseudolikelihood = -277.69972  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 64:  Log pseudolikelihood = -277.64657  (backed up)
Iteration 65:  Log pseudolikelihood = -277.64655  (backed up)
Iteration 66:  Log pseudolikelihood = -277.39598  (backed up)
Iteration 67:  Log pseudolikelihood = -277.34074  (backed up)
Iteration 68:  Log pseudolikelihood = -277.29152  (backed up)
Iteration 69:  Log pseudolikelihood = -276.91321  (backed up)
Iteration 70:  Log pseudolikelihood = -276.47017  (backed up)
Iteration 71:  Log pseudolikelihood = -276.12823  (backed up)
Iteration 72:  Log pseudolikelihood = -275.66923  (backed up)
Iteration 73:  Log pseudolikelihood = -274.68022  (backed up)
Iteration 74:  Log pseudolikelihood = -272.34137  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 75:  Log pseudolikelihood =  -272.0003  
Iteration 76:  Log pseudolikelihood = -271.99828  (backed up)
Iteration 77:  Log pseudolikelihood = -271.99064  (backed up)
Iteration 78:  Log pseudolikelihood = -271.97685  (backed up)
Iteration 79:  Log pseudolikelihood = -271.51592  (backed up)
Iteration 80:  Log pseudolikelihood = -271.43613  (backed up)
Iteration 81:  Log pseudolikelihood = -271.02708  (backed up)
Iteration 82:  Log pseudolikelihood = -270.81524  (backed up)
Iteration 83:  Log pseudolikelihood = -270.79649  (backed up)
Iteration 84:  Log pseudolikelihood = -270.68183  
Iteration 85:  Log pseudolikelihood = -270.22612  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 86:  Log pseudolikelihood = -268.84083  
Iteration 87:  Log pseudolikelihood =  -268.8407  (backed up)
Iteration 88:  Log pseudolikelihood = -268.83945  (backed up)
Iteration 89:  Log pseudolikelihood = -268.83864  (backed up)
Iteration 90:  Log pseudolikelihood = -268.83851  (backed up)
Iteration 91:  Log pseudolikelihood = -268.83815  (backed up)
Iteration 92:  Log pseudolikelihood =  -268.8376  (backed up)
Iteration 93:  Log pseudolikelihood = -268.83492  (backed up)
Iteration 94:  Log pseudolikelihood = -268.83224  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 95:  Log pseudolikelihood = -268.79408  
Iteration 96:  Log pseudolikelihood = -268.79401  (backed up)
Iteration 97:  Log pseudolikelihood = -268.79378  (backed up)
Iteration 98:  Log pseudolikelihood = -268.79294  (backed up)
Iteration 99:  Log pseudolikelihood =  -268.7929  (backed up)
Iteration 100: Log pseudolikelihood = -268.79191  (backed up)

Inefficiency effects model (truncated-normal)        Number of obs =       919
Group variable: pid                               Number of groups =       484
Time variable: year                             Obs per group: min =         1
                                                               avg =       1.9
                                                               max =         5

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood =  -268.7919                    Wald chi2(6)  =   1480.56

                                  (Std. Err. adjusted for 484 clusters in pid)
------------------------------------------------------------------------------
             |               Robust
lntotalspe~s |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
Frontier     |
        CD_1 |   3.31e-06   2.95e-07    11.22   0.000     2.74e-06    3.89e-06
        CD_2 |   3.035026   .9383118     3.23   0.001     1.195968    4.874083
        CD_3 |   .0109905   .0022783     4.82   0.000     .0065251    .0154558
        CD_4 |  -.0272581   .0072343    -3.77   0.000     -.041437   -.0130792
 half_lnX_11 |   -.269068   .0316633    -8.50   0.000    -.3311269   -.2070091
 half_lnX_12 |   .0833412   .0302819     2.75   0.006     .0239898    .1426926
 half_lnX_13 |   2.12e-18  (omitted)
 half_lnX_14 |  -8.47e-18  (omitted)
 half_lnX_22 |  -7.90e-18  (omitted)
 half_lnX_23 |   6.42e-18  (omitted)
 half_lnX_24 |  -7.40e-18  (omitted)
 half_lnX_33 |  -1.89e-19  (omitted)
 half_lnX_34 |  -4.72e-19  (omitted)
 half_lnX_44 |   1.46e-19  (omitted)
       TREND |  -1.18e-30  (omitted)
       _cons |   10.42798          .        .       .            .           .
-------------+----------------------------------------------------------------
Mu           |
lngrassratio |  -.0910707   .0241421    -3.77   0.000    -.1383883    -.043753
   lnspecial |  -.9793988   .1152401    -8.50   0.000    -1.205265   -.7535324
       _cons |   7.421113   .6340971    11.70   0.000     6.178305    8.663921
-------------+----------------------------------------------------------------
Usigma       |
lngrassratio |   5.987419   1.486517     4.03   0.000     3.073899     8.90094
   lnspecial |  -5.633982   6.621833    -0.85   0.395    -18.61254    7.344572
       _cons |    -1.8489   23.52252    -0.08   0.937    -47.95219    44.25439
-------------+----------------------------------------------------------------
Vsigma       |
       _cons |  -2.358857   .1544518   -15.27   0.000    -2.661577   -2.056137
-------------+----------------------------------------------------------------
  E(sigma_u) |   .0691049                                 .0571255    .0810843
     sigma_v |   .3074544   .0237434    12.95   0.000     .2642688    .3576971
------------------------------------------------------------------------------

. estimates store `model1name'_IRE_`tech_or_cost'

. estimates save `fadnoutdatadir'/`model1name'_IRE_`tech_or_cost'_$datestamp$timestamp.ster, replace
(note: file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_IRE_cost_2014_02_061228pm.ster not found)
file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_IRE_cost_2014_02_061228pm.ster saved

. di `e(converged)'
0

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "UKI",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist')
> estimates store `model1name'_UKI_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_UKI_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if atl_plains == 1, `cost'  model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usi
> gma(`z_vlist') vsigma(TREND)
> estimates store `model1name'_ATL_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_ATL_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if cont_eur == 1,   `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usig
> ma(`z_vlist') 
> estimates store `model1name'_CEU_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_CEU_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> * BEST RESULT Effect on Mu parameter = -0.0054 Sigma U Parameter = 2.308268 need to figure out partial effect for this. Non-monoto
> nic effect of grass. HARD CODE for reference. 
> *sfpanel lntotalspecificcosts lndairyproducts lnPTotalCattle lnPCompoundfeedingstuffsforcatt lnPFERTILISERSANDSOILIMPROVERS TREND 
> , cost model(bc95) d(tnormal) posthessian robust emean(lngrassratio lnspecial) usigma(lngrassratio lnspecial) vsigma(TREND)
> 
> sfpanel `dep_vlist' `indep_vlist' TREND , `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usigma(`z_vlist') vsig
> ma(TREND)
> estimates store `model1name'_ALL_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_ALL_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> */
. log close
      name:  <unnamed>
       log:  D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.txt
  log type:  text
 closed on:   6 Feb 2014, 12:29:07
------------------------------------------------------------------------------------------------------------------------------------
------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.txt
  log type:  text
 opened on:   6 Feb 2014, 12:31:18

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  12:31:18  on  6 Feb 2014

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(cmdlog D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file D:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') vs
> igma(TREND)
> estimates store `model1name'_DEU_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_DEU_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "FRA",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist') vsigma(TREND)
> estimates store `model1name'_FRA_`tech_or_cost' 
> estimates save `fadnoutdatadir'/`model1name'_FRA_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> */
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "IRE",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist') 

note: half_lnX_22 omitted because of collinearity
note: half_lnX_23 omitted because of collinearity
note: half_lnX_24 omitted because of collinearity
note: half_lnX_25 omitted because of collinearity
note: half_lnX_26 omitted because of collinearity
note: half_lnX_27 omitted because of collinearity
note: half_lnX_33 omitted because of collinearity
note: half_lnX_34 omitted because of collinearity
note: half_lnX_35 omitted because of collinearity
note: half_lnX_36 omitted because of collinearity
note: half_lnX_37 omitted because of collinearity
note: half_lnX_44 omitted because of collinearity
note: half_lnX_45 omitted because of collinearity
note: half_lnX_46 omitted because of collinearity
note: half_lnX_47 omitted because of collinearity
note: half_lnX_55 omitted because of collinearity
note: half_lnX_56 omitted because of collinearity
note: half_lnX_57 omitted because of collinearity
note: half_lnX_66 omitted because of collinearity
note: half_lnX_67 omitted because of collinearity
note: half_lnX_77 omitted because of collinearity

initial:       Log pseudolikelihood = -6865.4093
Iteration 0:   Log pseudolikelihood = -6865.4093  
Iteration 1:   Log pseudolikelihood = -6755.4222  (backed up)
Iteration 2:   Log pseudolikelihood =  -6683.773  (backed up)
Iteration 3:   Log pseudolikelihood = -6586.7709  (backed up)
Iteration 4:   Log pseudolikelihood = -6534.8534  (backed up)
Iteration 5:   Log pseudolikelihood = -6527.4207  (backed up)
Iteration 6:   Log pseudolikelihood = -5848.2781  (backed up)
Iteration 7:   Log pseudolikelihood = -5760.3528  (backed up)
Iteration 8:   Log pseudolikelihood = -5724.5513  (backed up)
Iteration 9:   Log pseudolikelihood = -5529.2941  (backed up)
Iteration 10:  Log pseudolikelihood = -5131.4041  (backed up)
Iteration 11:  Log pseudolikelihood = -5050.5337  (backed up)
Iteration 12:  Log pseudolikelihood =  -4997.711  
Iteration 13:  Log pseudolikelihood = -4944.6556  (backed up)
Iteration 14:  Log pseudolikelihood = -4764.4525  (backed up)
Iteration 15:  Log pseudolikelihood = -4661.9792  
Iteration 16:  Log pseudolikelihood = -4266.0114  
Iteration 17:  Log pseudolikelihood = -4052.8566  
Iteration 18:  Log pseudolikelihood = -3803.9851  
Iteration 19:  Log pseudolikelihood = -3240.0968  
Iteration 20:  Log pseudolikelihood = -3106.2914  
Iteration 21:  Log pseudolikelihood = -3036.4155  
Iteration 22:  Log pseudolikelihood = -2854.7883  
Iteration 23:  Log pseudolikelihood =  -2798.365  
Iteration 24:  Log pseudolikelihood = -2733.1312  
Iteration 25:  Log pseudolikelihood = -2561.4172  
Iteration 26:  Log pseudolikelihood = -2299.9354  
Iteration 27:  Log pseudolikelihood = -2265.7447  
Iteration 28:  Log pseudolikelihood = -2007.5327  
Iteration 29:  Log pseudolikelihood = -1723.4594  
Iteration 30:  Log pseudolikelihood = -1720.4031  
Iteration 31:  Log pseudolikelihood = -1446.2305  
Iteration 32:  Log pseudolikelihood = -1295.1441  
Iteration 33:  Log pseudolikelihood = -1130.0002  
Iteration 34:  Log pseudolikelihood = -1063.3506  
Iteration 35:  Log pseudolikelihood = -1015.9052  
Iteration 36:  Log pseudolikelihood =  -952.2073  
Iteration 37:  Log pseudolikelihood = -895.62024  
Iteration 38:  Log pseudolikelihood = -728.42028  
Iteration 39:  Log pseudolikelihood = -610.84887  
Iteration 40:  Log pseudolikelihood = -602.44335  
Iteration 41:  Log pseudolikelihood = -552.32798  
Iteration 42:  Log pseudolikelihood =  -445.8991  
Iteration 43:  Log pseudolikelihood = -417.22427  
Iteration 44:  Log pseudolikelihood = -384.25592  
Iteration 45:  Log pseudolikelihood = -347.65561  
Iteration 46:  Log pseudolikelihood = -320.28429  
Iteration 47:  Log pseudolikelihood = -308.51525  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 48:  Log pseudolikelihood = -301.68427  
Iteration 49:  Log pseudolikelihood =  -298.4757  (backed up)
Iteration 50:  Log pseudolikelihood = -298.28444  (backed up)
Iteration 51:  Log pseudolikelihood = -297.02627  (backed up)
Iteration 52:  Log pseudolikelihood = -293.73258  (backed up)
Iteration 53:  Log pseudolikelihood = -293.60909  (backed up)
Iteration 54:  Log pseudolikelihood =  -285.2883  (backed up)
Iteration 55:  Log pseudolikelihood = -284.78258  (backed up)
Iteration 56:  Log pseudolikelihood = -284.34093  (backed up)
Iteration 57:  Log pseudolikelihood = -283.12252  (backed up)
Iteration 58:  Log pseudolikelihood = -277.83522  (backed up)
Iteration 59:  Log pseudolikelihood =  -275.3924  (backed up)
Iteration 60:  Log pseudolikelihood = -270.65359  (backed up)
Iteration 61:  Log pseudolikelihood = -270.59761  (backed up)
Iteration 62:  Log pseudolikelihood = -269.84465  (backed up)
Iteration 63:  Log pseudolikelihood = -267.36754  (backed up)
Iteration 64:  Log pseudolikelihood = -257.99188  (backed up)
Iteration 65:  Log pseudolikelihood = -247.73921  (backed up)
Iteration 66:  Log pseudolikelihood = -236.73583  (backed up)
Iteration 67:  Log pseudolikelihood =    -236.69  (backed up)
Iteration 68:  Log pseudolikelihood = -235.18384  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 69:  Log pseudolikelihood = -221.60876  (backed up)
Iteration 70:  Log pseudolikelihood = -221.57507  (backed up)
Iteration 71:  Log pseudolikelihood = -221.36484  (backed up)
Iteration 72:  Log pseudolikelihood =  -219.7731  (backed up)
Iteration 73:  Log pseudolikelihood = -217.02038  (backed up)
Iteration 74:  Log pseudolikelihood = -217.00139  (backed up)
Iteration 75:  Log pseudolikelihood = -214.87353  (backed up)
Iteration 76:  Log pseudolikelihood = -214.18193  (backed up)
Iteration 77:  Log pseudolikelihood = -213.97133  (backed up)
Iteration 78:  Log pseudolikelihood = -213.37785  (backed up)
Iteration 79:  Log pseudolikelihood = -211.85482  (backed up)
Iteration 80:  Log pseudolikelihood =  -206.6724  (backed up)
Iteration 81:  Log pseudolikelihood =  -205.3859  (backed up)
Iteration 82:  Log pseudolikelihood = -204.71514  (backed up)
Iteration 83:  Log pseudolikelihood = -204.53684  (backed up)
Iteration 84:  Log pseudolikelihood = -204.46728  (backed up)
Iteration 85:  Log pseudolikelihood = -204.24667  (backed up)
Iteration 86:  Log pseudolikelihood = -202.29612  (backed up)
Iteration 87:  Log pseudolikelihood = -201.69822  (backed up)
Iteration 88:  Log pseudolikelihood = -201.16804  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 89:  Log pseudolikelihood = -197.48703  (backed up)
Iteration 90:  Log pseudolikelihood = -197.46652  (backed up)
Iteration 91:  Log pseudolikelihood = -197.46483  (backed up)
Iteration 92:  Log pseudolikelihood = -197.38025  (backed up)
Iteration 93:  Log pseudolikelihood =  -197.2894  (backed up)
Iteration 94:  Log pseudolikelihood = -197.28582  (backed up)
Iteration 95:  Log pseudolikelihood = -195.56834  (backed up)
Iteration 96:  Log pseudolikelihood = -195.43578  (backed up)
Iteration 97:  Log pseudolikelihood = -195.40165  (backed up)
Iteration 98:  Log pseudolikelihood = -195.11133  (backed up)
Iteration 99:  Log pseudolikelihood = -193.81926  (backed up)
Iteration 100: Log pseudolikelihood = -192.46206  (backed up)

Inefficiency effects model (truncated-normal)        Number of obs =      1367
Group variable: pid                               Number of groups =       376
Time variable: year                             Obs per group: min =         1
                                                               avg =       3.6
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood =  -192.4621                    Wald chi2(15)  =   1807.55

                                  (Std. Err. adjusted for 376 clusters in pid)
------------------------------------------------------------------------------
             |               Robust
lndairypro~s |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
Frontier     |
        CD_1 |   .0000204   4.57e-06     4.47   0.000     .0000115    .0000294
        CD_2 |    .000011   3.12e-06     3.54   0.000     4.93e-06    .0000172
        CD_3 |   .0001533   .0014164     0.11   0.914    -.0026228    .0029295
        CD_4 |   .0088424   .0020346     4.35   0.000     .0048547    .0128302
        CD_5 |    .000024   .0000187     1.28   0.200    -.0000127    .0000606
        CD_6 |   .0000758   .0000815     0.93   0.352    -.0000839    .0002355
        CD_7 |   .0000409   .0000644     0.63   0.526    -.0000854    .0001672
 half_lnX_11 |   .5015354    .094521     5.31   0.000     .3162777    .6867932
 half_lnX_12 |  -.2978097   .2043345    -1.46   0.145     -.698298    .1026786
 half_lnX_13 |  -.1449491   .0338744    -4.28   0.000    -.2113417   -.0785565
 half_lnX_14 |  -.4211452   .1231772    -3.42   0.001     -.662568   -.1797224
 half_lnX_15 |  -.0611096   .0421818    -1.45   0.147    -.1437844    .0215652
 half_lnX_16 |  -.1366364   .0779164    -1.75   0.079    -.2893497    .0160769
 half_lnX_17 |  -.0882568   .0341015    -2.59   0.010    -.1550945   -.0214191
 half_lnX_22 |   3.16e-15  (omitted)
 half_lnX_23 |  -3.23e-15  (omitted)
 half_lnX_24 |   4.64e-15  (omitted)
 half_lnX_25 |   8.08e-15  (omitted)
 half_lnX_26 |   1.21e-14  (omitted)
 half_lnX_27 |  -5.67e-16  (omitted)
 half_lnX_33 |  -6.66e-15  (omitted)
 half_lnX_34 |   2.31e-15  (omitted)
 half_lnX_35 |  -1.38e-15  (omitted)
 half_lnX_36 |   1.82e-14  (omitted)
 half_lnX_37 |  -7.05e-15  (omitted)
 half_lnX_44 |   7.46e-15  (omitted)
 half_lnX_45 |  -6.38e-15  (omitted)
 half_lnX_46 |   9.80e-15  (omitted)
 half_lnX_47 |  -4.82e-15  (omitted)
 half_lnX_55 |  -1.24e-14  (omitted)
 half_lnX_56 |  -9.43e-15  (omitted)
 half_lnX_57 |  -2.82e-15  (omitted)
 half_lnX_66 |  -9.26e-16  (omitted)
 half_lnX_67 |  -1.08e-16  (omitted)
 half_lnX_77 |  -5.72e-16  (omitted)
       TREND |   .0019563   .0050826     0.38   0.700    -.0080054     .011918
       _cons |   17.07615          .        .       .            .           .
-------------+----------------------------------------------------------------
Mu           |
lngrassratio |  -.0506718   .0527696    -0.96   0.337    -.1540984    .0527548
   lnspecial |  -.8785809   .2885044    -3.05   0.002    -1.444039   -.3131227
       _cons |   4.799078          .        .       .            .           .
-------------+----------------------------------------------------------------
Usigma       |
lngrassratio |   5.834363   1.685049     3.46   0.001     2.531727       9.137
   lnspecial |  -5.447257   3.740434    -1.46   0.145    -12.77837    1.883859
       _cons |  -1.263009   10.84729    -0.12   0.907    -22.52331    19.99729
-------------+----------------------------------------------------------------
Vsigma       |
       _cons |  -2.686078   .1147205   -23.41   0.000    -2.910926    -2.46123
-------------+----------------------------------------------------------------
  E(sigma_u) |   .0950624                                 .0815445    .1085803
     sigma_v |   .2610512    .014974    17.43   0.000     .2332924    .2921129
------------------------------------------------------------------------------

. estimates store `model1name'_IRE_`tech_or_cost'

. estimates save `fadnoutdatadir'/`model1name'_IRE_`tech_or_cost'_$datestamp$timestamp.ster, replace
(note: file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_IRE_tech_2014_02_061231pm.ster not found)
file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_IRE_tech_2014_02_061231pm.ster saved

. di `e(converged)'
0

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "UKI",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist')
> estimates store `model1name'_UKI_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_UKI_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if atl_plains == 1, `cost'  model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usi
> gma(`z_vlist') vsigma(TREND)
> estimates store `model1name'_ATL_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_ATL_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if cont_eur == 1,   `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usig
> ma(`z_vlist') 
> estimates store `model1name'_CEU_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_CEU_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> * BEST RESULT Effect on Mu parameter = -0.0054 Sigma U Parameter = 2.308268 need to figure out partial effect for this. Non-monoto
> nic effect of grass. HARD CODE for reference. 
> *sfpanel lntotalspecificcosts lndairyproducts lnPTotalCattle lnPCompoundfeedingstuffsforcatt lnPFERTILISERSANDSOILIMPROVERS TREND 
> , cost model(bc95) d(tnormal) posthessian robust emean(lngrassratio lnspecial) usigma(lngrassratio lnspecial) vsigma(TREND)
> 
> sfpanel `dep_vlist' `indep_vlist' TREND , `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usigma(`z_vlist') vsig
> ma(TREND)
> estimates store `model1name'_ALL_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_ALL_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> */
. log close
      name:  <unnamed>
       log:  D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.txt
  log type:  text
 closed on:   6 Feb 2014, 12:31:42
------------------------------------------------------------------------------------------------------------------------------------
------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.txt
  log type:  text
 opened on:   6 Feb 2014, 12:49:54

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  12:49:54  on  6 Feb 2014

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(cmdlog D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file D:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') vs
> igma(TREND)
> estimates store `model1name'_DEU_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_DEU_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "FRA",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist') vsigma(TREND)
> estimates store `model1name'_FRA_`tech_or_cost' 
> estimates save `fadnoutdatadir'/`model1name'_FRA_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> */
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "IRE",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist') 

note: half_lnX_22 omitted because of collinearity
note: half_lnX_23 omitted because of collinearity
note: half_lnX_24 omitted because of collinearity
note: half_lnX_33 omitted because of collinearity
note: half_lnX_34 omitted because of collinearity
note: half_lnX_44 omitted because of collinearity

initial:       Log pseudolikelihood = -8965.2186
Iteration 0:   Log pseudolikelihood = -8965.2186  
Iteration 1:   Log pseudolikelihood =  -8811.194  (backed up)
Iteration 2:   Log pseudolikelihood = -8739.9924  (backed up)
Iteration 3:   Log pseudolikelihood = -8685.5574  (backed up)
Iteration 4:   Log pseudolikelihood = -6114.7692  (backed up)
Iteration 5:   Log pseudolikelihood = -5144.1552  (backed up)
Iteration 6:   Log pseudolikelihood = -4821.6786  (backed up)
Iteration 7:   Log pseudolikelihood =  -4806.182  (backed up)
Iteration 8:   Log pseudolikelihood = -4686.8183  (backed up)
Iteration 9:   Log pseudolikelihood = -4674.9696  (backed up)
Iteration 10:  Log pseudolikelihood = -4296.4391  
Iteration 11:  Log pseudolikelihood = -4264.3428  (backed up)
Iteration 12:  Log pseudolikelihood = -4063.3005  
Iteration 13:  Log pseudolikelihood =  -3942.923  (backed up)
Iteration 14:  Log pseudolikelihood = -3797.1023  
Iteration 15:  Log pseudolikelihood = -3484.6601  
Iteration 16:  Log pseudolikelihood = -2949.3102  (backed up)
Iteration 17:  Log pseudolikelihood =  -2526.554  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 18:  Log pseudolikelihood = -2085.3934  
Iteration 19:  Log pseudolikelihood = -2072.2327  (backed up)
Iteration 20:  Log pseudolikelihood = -2059.0395  (backed up)
Iteration 21:  Log pseudolikelihood = -2036.2694  (backed up)
Iteration 22:  Log pseudolikelihood = -1981.1653  (backed up)
Iteration 23:  Log pseudolikelihood = -1979.6836  (backed up)
Iteration 24:  Log pseudolikelihood = -1934.7916  (backed up)
Iteration 25:  Log pseudolikelihood = -1480.2927  (backed up)
Iteration 26:  Log pseudolikelihood = -1473.9386  (backed up)
Iteration 27:  Log pseudolikelihood = -1472.7278  (backed up)
Iteration 28:  Log pseudolikelihood =  -1471.743  (backed up)
Iteration 29:  Log pseudolikelihood = -1434.1466  (backed up)
Iteration 30:  Log pseudolikelihood = -1333.5705  (backed up)
Iteration 31:  Log pseudolikelihood = -1267.1336  (backed up)
Iteration 32:  Log pseudolikelihood = -1242.6595  (backed up)
Iteration 33:  Log pseudolikelihood = -1137.4707  (backed up)
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 34:  Log pseudolikelihood = -961.94597  
Iteration 35:  Log pseudolikelihood =  -959.7207  (backed up)
Iteration 36:  Log pseudolikelihood = -957.81465  (backed up)
Iteration 37:  Log pseudolikelihood =  -956.4833  (backed up)
Iteration 38:  Log pseudolikelihood = -941.19922  (backed up)
Iteration 39:  Log pseudolikelihood = -940.61348  (backed up)
Iteration 40:  Log pseudolikelihood = -929.37729  (backed up)
Iteration 41:  Log pseudolikelihood = -907.59516  (backed up)
Iteration 42:  Log pseudolikelihood = -893.42142  (backed up)
Iteration 43:  Log pseudolikelihood = -875.31382  (backed up)
Iteration 44:  Log pseudolikelihood = -866.83168  (backed up)
Iteration 45:  Log pseudolikelihood = -796.18707  
Iteration 46:  Log pseudolikelihood = -780.64243  (backed up)
Iteration 47:  Log pseudolikelihood = -776.10259  (backed up)
Iteration 48:  Log pseudolikelihood = -774.37901  (backed up)
Iteration 49:  Log pseudolikelihood = -705.66281  
Iteration 50:  Log pseudolikelihood =   -548.229  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 51:  Log pseudolikelihood = -390.46755  
Iteration 52:  Log pseudolikelihood = -390.44839  (backed up)
Iteration 53:  Log pseudolikelihood = -390.34999  (backed up)
Iteration 54:  Log pseudolikelihood = -390.33267  (backed up)
Iteration 55:  Log pseudolikelihood = -389.47302  (backed up)
Iteration 56:  Log pseudolikelihood = -389.37064  (backed up)
Iteration 57:  Log pseudolikelihood = -388.32854  (backed up)
Iteration 58:  Log pseudolikelihood = -376.08638  (backed up)
Iteration 59:  Log pseudolikelihood = -374.01215  (backed up)
Iteration 60:  Log pseudolikelihood = -372.60839  (backed up)
Iteration 61:  Log pseudolikelihood = -368.91171  (backed up)
Iteration 62:  Log pseudolikelihood =  -364.5567  (backed up)
Iteration 63:  Log pseudolikelihood = -364.10522  (backed up)
Iteration 64:  Log pseudolikelihood =   -362.542  (backed up)
Iteration 65:  Log pseudolikelihood = -348.80007  (backed up)
Iteration 66:  Log pseudolikelihood = -327.22132  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 67:  Log pseudolikelihood = -287.07056  
Iteration 68:  Log pseudolikelihood = -287.07024  (backed up)
Iteration 69:  Log pseudolikelihood = -287.06849  (backed up)
Iteration 70:  Log pseudolikelihood = -287.06828  (backed up)
Iteration 71:  Log pseudolikelihood = -287.05304  (backed up)
Iteration 72:  Log pseudolikelihood = -286.41609  (backed up)
Iteration 73:  Log pseudolikelihood = -283.48317  (backed up)
Iteration 74:  Log pseudolikelihood = -283.38503  (backed up)
Iteration 75:  Log pseudolikelihood = -283.30636  (backed up)
Iteration 76:  Log pseudolikelihood = -283.09279  (backed up)
Iteration 77:  Log pseudolikelihood = -283.00299  (backed up)
Iteration 78:  Log pseudolikelihood = -282.84423  (backed up)
Iteration 79:  Log pseudolikelihood = -282.58328  (backed up)
Iteration 80:  Log pseudolikelihood = -278.51462  (backed up)
Iteration 81:  Log pseudolikelihood = -278.35001  (backed up)
Iteration 82:  Log pseudolikelihood = -277.71473  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 83:  Log pseudolikelihood = -272.07777  
Iteration 84:  Log pseudolikelihood = -272.07768  (backed up)
Iteration 85:  Log pseudolikelihood = -272.07765  (backed up)
Iteration 86:  Log pseudolikelihood = -272.07758  (backed up)
Iteration 87:  Log pseudolikelihood = -272.07199  (backed up)
Iteration 88:  Log pseudolikelihood = -272.07142  (backed up)
Iteration 89:  Log pseudolikelihood = -272.07045  (backed up)
Iteration 90:  Log pseudolikelihood = -272.02502  (backed up)
Iteration 91:  Log pseudolikelihood = -272.00629  (backed up)
Iteration 92:  Log pseudolikelihood = -271.98891  (backed up)
Iteration 93:  Log pseudolikelihood = -271.98139  (backed up)
Iteration 94:  Log pseudolikelihood = -271.97915  (backed up)
Iteration 95:  Log pseudolikelihood = -271.97598  (backed up)
Iteration 96:  Log pseudolikelihood = -271.97409  (backed up)
Iteration 97:  Log pseudolikelihood = -271.97233  
Iteration 98:  Log pseudolikelihood = -271.84849  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 99:  Log pseudolikelihood = -271.55386  
Iteration 100: Log pseudolikelihood = -271.55384  (backed up)

Inefficiency effects model (truncated-normal)        Number of obs =      1800
Group variable: pid                               Number of groups =       481
Time variable: year                             Obs per group: min =         1
                                                               avg =       3.7
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood =  -271.5538                    Wald chi2(9)  =   2029.84

                                  (Std. Err. adjusted for 481 clusters in pid)
------------------------------------------------------------------------------
             |               Robust
lndairypro~s |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
Frontier     |
        CD_1 |   .0000216   3.77e-06     5.72   0.000     .0000142    .0000289
        CD_2 |   .0000129   2.94e-06     4.38   0.000     7.11e-06    .0000186
        CD_3 |   .0103326   .0014768     7.00   0.000      .007438    .0132271
        CD_4 |   7.25e-06   .0000116     0.63   0.531    -.0000154    .0000299
 half_lnX_11 |   .2673509   .0363449     7.36   0.000     .1961163    .3385856
 half_lnX_12 |  -.2513982   .0458331    -5.49   0.000    -.3412294    -.161567
 half_lnX_13 |  -.3710056   .0428916    -8.65   0.000    -.4550716   -.2869397
 half_lnX_14 |  -.0870042   .0226466    -3.84   0.000    -.1313906   -.0426178
 half_lnX_22 |  -2.92e-17  (omitted)
 half_lnX_23 |   9.82e-17  (omitted)
 half_lnX_24 |   4.08e-19  (omitted)
 half_lnX_33 |  -9.45e-19  (omitted)
 half_lnX_34 |   2.47e-18  (omitted)
 half_lnX_44 |  -2.99e-18  (omitted)
       TREND |   .0039785   .0033956     1.17   0.241    -.0026769    .0106338
       _cons |   19.68071          .        .       .            .           .
-------------+----------------------------------------------------------------
Mu           |
lngrassratio |  -.0307864   .0195518    -1.57   0.115    -.0691073    .0075345
   lnspecial |  -.7007634   .1051461    -6.66   0.000     -.906846   -.4946807
       _cons |   7.613542   .4622186    16.47   0.000      6.70761    8.519474
-------------+----------------------------------------------------------------
Usigma       |
lngrassratio |   6.086603   1.495622     4.07   0.000     3.155237    9.017969
   lnspecial |  -3.996492   4.644374    -0.86   0.390     -13.0993    5.106314
       _cons |  -8.561691   19.07025    -0.45   0.653     -45.9387    28.81531
-------------+----------------------------------------------------------------
Vsigma       |
       _cons |  -2.661986   .1074491   -24.77   0.000    -2.872583    -2.45139
-------------+----------------------------------------------------------------
  E(sigma_u) |   .0718869                                 .0636783    .0800954
     sigma_v |   .2642147   .0141948    18.61   0.000     .2378081    .2935536
------------------------------------------------------------------------------

. estimates store `model1name'_IRE_`tech_or_cost'

. estimates save `fadnoutdatadir'/`model1name'_IRE_`tech_or_cost'_$datestamp$timestamp.ster, replace
(note: file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_IRE_tech_2014_02_061249pm.ster not found)
file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_IRE_tech_2014_02_061249pm.ster saved

. di `e(converged)'
0

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "UKI",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist')
> estimates store `model1name'_UKI_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_UKI_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if atl_plains == 1, `cost'  model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usi
> gma(`z_vlist') vsigma(TREND)
> estimates store `model1name'_ATL_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_ATL_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if cont_eur == 1,   `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usig
> ma(`z_vlist') 
> estimates store `model1name'_CEU_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_CEU_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> * BEST RESULT Effect on Mu parameter = -0.0054 Sigma U Parameter = 2.308268 need to figure out partial effect for this. Non-monoto
> nic effect of grass. HARD CODE for reference. 
> *sfpanel lntotalspecificcosts lndairyproducts lnPTotalCattle lnPCompoundfeedingstuffsforcatt lnPFERTILISERSANDSOILIMPROVERS TREND 
> , cost model(bc95) d(tnormal) posthessian robust emean(lngrassratio lnspecial) usigma(lngrassratio lnspecial) vsigma(TREND)
> 
> sfpanel `dep_vlist' `indep_vlist' TREND , `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usigma(`z_vlist') vsig
> ma(TREND)
> estimates store `model1name'_ALL_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_ALL_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> */
. log close
      name:  <unnamed>
       log:  D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.txt
  log type:  text
 closed on:   6 Feb 2014, 12:50:23
------------------------------------------------------------------------------------------------------------------------------------
------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.txt
  log type:  text
 opened on:   6 Feb 2014, 12:55:25

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  12:55:25  on  6 Feb 2014

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(cmdlog D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file D:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') vs
> igma(TREND)
> estimates store `model1name'_DEU_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_DEU_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "FRA",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist') vsigma(TREND)
> estimates store `model1name'_FRA_`tech_or_cost' 
> estimates save `fadnoutdatadir'/`model1name'_FRA_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> */
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "IRE",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist') 

note: half_lnX_22 omitted because of collinearity
note: half_lnX_23 omitted because of collinearity
note: half_lnX_24 omitted because of collinearity
note: half_lnX_33 omitted because of collinearity
note: half_lnX_34 omitted because of collinearity
note: half_lnX_44 omitted because of collinearity

initial:       Log pseudolikelihood = -1306.0635
Iteration 0:   Log pseudolikelihood = -1306.0635  
Iteration 1:   Log pseudolikelihood = -1211.5817  (backed up)
Iteration 2:   Log pseudolikelihood = -1199.3393  (backed up)
Iteration 3:   Log pseudolikelihood = -1196.6415  (backed up)
Iteration 4:   Log pseudolikelihood = -1128.1043  (backed up)
Iteration 5:   Log pseudolikelihood = -1109.7797  (backed up)
Iteration 6:   Log pseudolikelihood = -1091.1158  (backed up)
Iteration 7:   Log pseudolikelihood = -1090.2586  (backed up)
Iteration 8:   Log pseudolikelihood = -966.88128  
Iteration 9:   Log pseudolikelihood = -945.49254  (backed up)
Iteration 10:  Log pseudolikelihood = -924.27215  
Iteration 11:  Log pseudolikelihood = -907.48901  
Iteration 12:  Log pseudolikelihood = -898.41567  
Iteration 13:  Log pseudolikelihood = -863.31227  
Iteration 14:  Log pseudolikelihood = -842.97137  
Iteration 15:  Log pseudolikelihood = -838.32967  
Iteration 16:  Log pseudolikelihood =  -827.0496  
Iteration 17:  Log pseudolikelihood = -811.39707  
Iteration 18:  Log pseudolikelihood = -772.23216  
Iteration 19:  Log pseudolikelihood = -761.71085  
Iteration 20:  Log pseudolikelihood = -750.71312  
Iteration 21:  Log pseudolikelihood =     -739.7  
Iteration 22:  Log pseudolikelihood = -726.49477  
Iteration 23:  Log pseudolikelihood = -698.58986  
Iteration 24:  Log pseudolikelihood = -685.39526  
Iteration 25:  Log pseudolikelihood = -664.98366  
Iteration 26:  Log pseudolikelihood = -641.55715  
Iteration 27:  Log pseudolikelihood = -630.82176  
Iteration 28:  Log pseudolikelihood = -604.43486  
Iteration 29:  Log pseudolikelihood = -599.55366  
Iteration 30:  Log pseudolikelihood = -580.32103  
Iteration 31:  Log pseudolikelihood = -570.40582  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 32:  Log pseudolikelihood = -553.27169  
Iteration 33:  Log pseudolikelihood = -551.75695  (backed up)
Iteration 34:  Log pseudolikelihood = -550.30334  (backed up)
Iteration 35:  Log pseudolikelihood = -549.72655  (backed up)
Iteration 36:  Log pseudolikelihood = -544.04546  (backed up)
Iteration 37:  Log pseudolikelihood = -490.22068  (backed up)
Iteration 38:  Log pseudolikelihood = -397.05332  (backed up)
Iteration 39:  Log pseudolikelihood = -376.14939  (backed up)
Iteration 40:  Log pseudolikelihood = -371.05079  (backed up)
Iteration 41:  Log pseudolikelihood = -364.39876  (backed up)
Iteration 42:  Log pseudolikelihood = -338.26359  (backed up)
Iteration 43:  Log pseudolikelihood = -330.50777  
Iteration 44:  Log pseudolikelihood = -296.30122  
Iteration 45:  Log pseudolikelihood = -291.80031  (backed up)
Iteration 46:  Log pseudolikelihood = -276.10299  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 47:  Log pseudolikelihood = -243.28093  
Iteration 48:  Log pseudolikelihood = -242.97039  (backed up)
Iteration 49:  Log pseudolikelihood = -242.42235  (backed up)
Iteration 50:  Log pseudolikelihood = -241.77816  (backed up)
Iteration 51:  Log pseudolikelihood =  -241.6117  (backed up)
Iteration 52:  Log pseudolikelihood = -241.46383  (backed up)
Iteration 53:  Log pseudolikelihood =  -240.8342  (backed up)
Iteration 54:  Log pseudolikelihood = -236.10963  (backed up)
Iteration 55:  Log pseudolikelihood = -235.20136  (backed up)
Iteration 56:  Log pseudolikelihood =  -234.0338  (backed up)
Iteration 57:  Log pseudolikelihood = -233.35388  
Iteration 58:  Log pseudolikelihood = -232.11434  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 59:  Log pseudolikelihood = -217.53518  
Iteration 60:  Log pseudolikelihood = -215.73905  (backed up)
Iteration 61:  Log pseudolikelihood = -215.73433  (backed up)
Iteration 62:  Log pseudolikelihood = -215.72022  (backed up)
Iteration 63:  Log pseudolikelihood = -215.37065  (backed up)
Iteration 64:  Log pseudolikelihood = -214.71029  (backed up)
Iteration 65:  Log pseudolikelihood = -214.65292  (backed up)
Iteration 66:  Log pseudolikelihood = -212.78963  (backed up)
Iteration 67:  Log pseudolikelihood = -211.99255  (backed up)
Iteration 68:  Log pseudolikelihood =  -206.8207  (backed up)
Iteration 69:  Log pseudolikelihood =  -206.0322  
Iteration 70:  Log pseudolikelihood = -204.18812  (backed up)
Iteration 71:  Log pseudolikelihood = -196.94442  
Iteration 72:  Log pseudolikelihood = -182.96633  
Iteration 73:  Log pseudolikelihood = -181.50295  
Iteration 74:  Log pseudolikelihood = -178.88816  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 75:  Log pseudolikelihood = -169.82955  
Iteration 76:  Log pseudolikelihood = -169.68113  (backed up)
Iteration 77:  Log pseudolikelihood = -169.29899  (backed up)
Iteration 78:  Log pseudolikelihood = -169.29836  (backed up)
Iteration 79:  Log pseudolikelihood = -169.14305  (backed up)
Iteration 80:  Log pseudolikelihood = -168.98395  (backed up)
Iteration 81:  Log pseudolikelihood = -168.49459  (backed up)
Iteration 82:  Log pseudolikelihood =  -168.1902  (backed up)
Iteration 83:  Log pseudolikelihood = -167.58222  (backed up)
Iteration 84:  Log pseudolikelihood = -167.36262  (backed up)
Iteration 85:  Log pseudolikelihood = -166.82705  (backed up)
Iteration 86:  Log pseudolikelihood = -166.55049  (backed up)
Iteration 87:  Log pseudolikelihood = -166.04865  (backed up)
Iteration 88:  Log pseudolikelihood = -165.33011  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 89:  Log pseudolikelihood = -162.47805  
Iteration 90:  Log pseudolikelihood = -162.45203  (backed up)
Iteration 91:  Log pseudolikelihood = -162.44866  (backed up)
Iteration 92:  Log pseudolikelihood = -162.44278  (backed up)
Iteration 93:  Log pseudolikelihood = -162.42516  (backed up)
Iteration 94:  Log pseudolikelihood = -162.38544  (backed up)
Iteration 95:  Log pseudolikelihood = -162.36901  (backed up)
Iteration 96:  Log pseudolikelihood = -162.27686  (backed up)
Iteration 97:  Log pseudolikelihood =  -162.1949  (backed up)
Iteration 98:  Log pseudolikelihood = -162.14719  (backed up)
Iteration 99:  Log pseudolikelihood = -161.98059  
Iteration 100: Log pseudolikelihood = -161.86081  (backed up)

Inefficiency effects model (truncated-normal)        Number of obs =       266
Group variable: pid                               Number of groups =        75
Time variable: year                             Obs per group: min =         1
                                                               avg =       3.5
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood =  -161.8608                    Wald chi2(9)  =    394.75

                                   (Std. Err. adjusted for 75 clusters in pid)
------------------------------------------------------------------------------
             |               Robust
lndairypro~s |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
Frontier     |
        CD_1 |   8.44e-06   .0000142     0.59   0.552    -.0000194    .0000362
        CD_2 |   8.30e-06   2.00e-06     4.16   0.000     4.38e-06    .0000122
        CD_3 |   .0029604   .0032893     0.90   0.368    -.0034865    .0094074
        CD_4 |   8.58e-06   .0000424     0.20   0.839    -.0000744    .0000916
 half_lnX_11 |   -.338194   .1904887    -1.78   0.076    -.7115449     .035157
 half_lnX_12 |   .0174157   .0731188     0.24   0.812    -.1258944    .1607259
 half_lnX_13 |   .6855177   .2978917     2.30   0.021     .1016606    1.269375
 half_lnX_14 |  -.1091177   .0429677    -2.54   0.011    -.1933329   -.0249025
 half_lnX_22 |  -4.07e-17  (omitted)
 half_lnX_23 |  -3.16e-17  (omitted)
 half_lnX_24 |  -1.52e-18  (omitted)
 half_lnX_33 |   4.48e-16  (omitted)
 half_lnX_34 |  -3.97e-16  (omitted)
 half_lnX_44 |   4.47e-15  (omitted)
       TREND |   .0089838   .0096826     0.93   0.353    -.0099937    .0279613
       _cons |   11.78443   .7237434    16.28   0.000     10.36592    13.20294
-------------+----------------------------------------------------------------
Mu           |
lngrassratio |   .1838067   20.10579     0.01   0.993    -39.22281    39.59042
   lnspecial |  -4.451312   12.09903    -0.37   0.713    -28.16498    19.26235
       _cons |    18.0719   14.78976     1.22   0.222     -10.9155    47.05931
-------------+----------------------------------------------------------------
Usigma       |
lngrassratio |   .3260027   12.08531     0.03   0.978    -23.36077    24.01278
   lnspecial |   .2986582   8.660471     0.03   0.972    -16.67555    17.27287
       _cons |  -2.128611          .        .       .            .           .
-------------+----------------------------------------------------------------
Vsigma       |
       _cons |  -4.484036   1.252464    -3.58   0.000    -6.938821   -2.029251
-------------+----------------------------------------------------------------
  E(sigma_u) |   1.058256                                 1.048439    1.068074
     sigma_v |   .1062439   .0665333     1.60   0.110     .0311354    .3625381
------------------------------------------------------------------------------

. estimates store `model1name'_IRE_`tech_or_cost'

. estimates save `fadnoutdatadir'/`model1name'_IRE_`tech_or_cost'_$datestamp$timestamp.ster, replace
(note: file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_IRE_tech_2014_02_061255pm.ster not found)
file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_IRE_tech_2014_02_061255pm.ster saved

. di `e(converged)'
0

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "UKI",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist')
> estimates store `model1name'_UKI_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_UKI_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if atl_plains == 1, `cost'  model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usi
> gma(`z_vlist') vsigma(TREND)
> estimates store `model1name'_ATL_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_ATL_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if cont_eur == 1,   `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usig
> ma(`z_vlist') 
> estimates store `model1name'_CEU_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_CEU_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> * BEST RESULT Effect on Mu parameter = -0.0054 Sigma U Parameter = 2.308268 need to figure out partial effect for this. Non-monoto
> nic effect of grass. HARD CODE for reference. 
> *sfpanel lntotalspecificcosts lndairyproducts lnPTotalCattle lnPCompoundfeedingstuffsforcatt lnPFERTILISERSANDSOILIMPROVERS TREND 
> , cost model(bc95) d(tnormal) posthessian robust emean(lngrassratio lnspecial) usigma(lngrassratio lnspecial) vsigma(TREND)
> 
> sfpanel `dep_vlist' `indep_vlist' TREND , `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usigma(`z_vlist') vsig
> ma(TREND)
> estimates store `model1name'_ALL_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_ALL_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> */
. log close
      name:  <unnamed>
       log:  D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.txt
  log type:  text
 closed on:   6 Feb 2014, 12:55:35
------------------------------------------------------------------------------------------------------------------------------------
------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.txt
  log type:  text
 opened on:   6 Feb 2014, 12:56:44

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  12:56:44  on  6 Feb 2014

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(cmdlog D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file D:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') vs
> igma(TREND)
> estimates store `model1name'_DEU_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_DEU_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "FRA",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist') vsigma(TREND)
> estimates store `model1name'_FRA_`tech_or_cost' 
> estimates save `fadnoutdatadir'/`model1name'_FRA_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> */
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "IRE",  `cost' model(tfe) d(tnormal) posthessian robust emean(`z_vlist') usi
> gma(`z_vlist') 

note: half_lnX_22 omitted because of collinearity
note: half_lnX_23 omitted because of collinearity
note: half_lnX_24 omitted because of collinearity
note: half_lnX_33 omitted because of collinearity
note: half_lnX_34 omitted because of collinearity
note: half_lnX_44 omitted because of collinearity
Warning: only units with more than 1 time occasion will be considered

initial:       Log pseudolikelihood = -4069.1458
Iteration 0:   Log pseudolikelihood = -4069.1458  (not concave)
Iteration 1:   Log pseudolikelihood = -1478.5345  (not concave)
Iteration 2:   Log pseudolikelihood = -546.55375  (not concave)
Iteration 3:   Log pseudolikelihood = -264.10507  (not concave)
Iteration 4:   Log pseudolikelihood = -193.76195  (not concave)
Iteration 5:   Log pseudolikelihood = -179.81222  (not concave)
Iteration 6:   Log pseudolikelihood = -179.16758  (not concave)
Iteration 7:   Log pseudolikelihood = -179.03921  (not concave)
Iteration 8:   Log pseudolikelihood = -178.93666  (not concave)
Iteration 9:   Log pseudolikelihood =  -178.9341  (not concave)
Iteration 10:  Log pseudolikelihood = -178.93359  (not concave)
Iteration 11:  Log pseudolikelihood = -178.93356  (not concave)
Iteration 12:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 13:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 14:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 15:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 16:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 17:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 18:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 19:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 20:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 21:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 22:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 23:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 24:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 25:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 26:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 27:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 28:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 29:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 30:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 31:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 32:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 33:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 34:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 35:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 36:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 37:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 38:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 39:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 40:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 41:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 42:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 43:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 44:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 45:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 46:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 47:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 48:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 49:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 50:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 51:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 52:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 53:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 54:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 55:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 56:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 57:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 58:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 59:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 60:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 61:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 62:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 63:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 64:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 65:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 66:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 67:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 68:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 69:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 70:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 71:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 72:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 73:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 74:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 75:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 76:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 77:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 78:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 79:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 80:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 81:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 82:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 83:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 84:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 85:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 86:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 87:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 88:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 89:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 90:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 91:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 92:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 93:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 94:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 95:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 96:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 97:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 98:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 99:  Log pseudolikelihood = -178.93355  (not concave)
Iteration 100: Log pseudolikelihood = -178.93355  (not concave)

True fixed-effects model (truncated-normal)          Number of obs =       239
Group variable: pid                               Number of groups =        48
Time variable: year                             Obs per group: min =         2
                                                               avg =       5.0
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood =  -178.9335                    Wald chi2(9)  =  55410.31

                                   (Std. Err. adjusted for 48 clusters in pid)
------------------------------------------------------------------------------
             |               Robust
lndairypro~s |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
Frontier     |
        CD_1 |   .0000276   .0035261     0.01   0.994    -.0068834    .0069385
        CD_2 |   5.76e-06   .0008558     0.01   0.995    -.0016716    .0016831
        CD_3 |   .0070448   .0084653     0.83   0.405    -.0095469    .0236365
        CD_4 |   .0002034   .0266282     0.01   0.994    -.0519868    .0523937
 half_lnX_11 |  -.6360433   37.77968    -0.02   0.987    -74.68286    73.41077
 half_lnX_12 |   .5612535   21.68744     0.03   0.979    -41.94535    43.06786
 half_lnX_13 |   1.312115   37.15722     0.04   0.972     -71.5147    74.13893
 half_lnX_14 |    .120181   63.79327     0.00   0.998    -124.9123    125.1527
 half_lnX_22 |  -4.07e-17  (omitted)
 half_lnX_23 |  -3.16e-17  (omitted)
 half_lnX_24 |  -1.52e-18  (omitted)
 half_lnX_33 |   4.48e-16  (omitted)
 half_lnX_34 |  -3.97e-16  (omitted)
 half_lnX_44 |   4.47e-15  (omitted)
       TREND |   .1331361   6.816936     0.02   0.984    -13.22781    13.49409
-------------+----------------------------------------------------------------
Mu           |
lngrassratio |  -7.628363          .        .       .            .           .
   lnspecial |  -3.804532   848.5593    -0.00   0.996     -1666.95    1659.341
       _cons |  -18.36197   3633.722    -0.01   0.996    -7140.326    7103.602
-------------+----------------------------------------------------------------
Usigma       |
lngrassratio |   .1403518    6.15331     0.02   0.982    -11.91991    12.20062
   lnspecial |   .4560897   29.76457     0.02   0.988     -57.8814    58.79358
       _cons |  -1.378185   123.3607    -0.01   0.991    -243.1607    240.4043
-------------+----------------------------------------------------------------
Vsigma       |
       _cons |  -1.107458   86.84618    -0.01   0.990    -171.3228    169.1079
-------------+----------------------------------------------------------------
  E(sigma_u) |   1.660109                                 1.651581    1.668637
     sigma_v |   .5748023   24.95969     0.02   0.982     6.28e-38    5.26e+36
------------------------------------------------------------------------------

. estimates store `model1name'_IRE_`tech_or_cost'

. estimates save `fadnoutdatadir'/`model1name'_IRE_`tech_or_cost'_$datestamp$timestamp.ster, replace
(note: file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_IRE_tech_2014_02_061256pm.ster not found)
file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_IRE_tech_2014_02_061256pm.ster saved

. di `e(converged)'
0

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "UKI",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist')
> estimates store `model1name'_UKI_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_UKI_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if atl_plains == 1, `cost'  model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usi
> gma(`z_vlist') vsigma(TREND)
> estimates store `model1name'_ATL_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_ATL_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if cont_eur == 1,   `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usig
> ma(`z_vlist') 
> estimates store `model1name'_CEU_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_CEU_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> * BEST RESULT Effect on Mu parameter = -0.0054 Sigma U Parameter = 2.308268 need to figure out partial effect for this. Non-monoto
> nic effect of grass. HARD CODE for reference. 
> *sfpanel lntotalspecificcosts lndairyproducts lnPTotalCattle lnPCompoundfeedingstuffsforcatt lnPFERTILISERSANDSOILIMPROVERS TREND 
> , cost model(bc95) d(tnormal) posthessian robust emean(lngrassratio lnspecial) usigma(lngrassratio lnspecial) vsigma(TREND)
> 
> sfpanel `dep_vlist' `indep_vlist' TREND , `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usigma(`z_vlist') vsig
> ma(TREND)
> estimates store `model1name'_ALL_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_ALL_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> */
. log close
      name:  <unnamed>
       log:  D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.txt
  log type:  text
 closed on:   6 Feb 2014, 12:56:56
------------------------------------------------------------------------------------------------------------------------------------
------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.txt
  log type:  text
 opened on:   6 Feb 2014, 12:57:39

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  12:57:39  on  6 Feb 2014

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(cmdlog D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file D:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') vs
> igma(TREND)
> estimates store `model1name'_DEU_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_DEU_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "FRA",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist') vsigma(TREND)
> estimates store `model1name'_FRA_`tech_or_cost' 
> estimates save `fadnoutdatadir'/`model1name'_FRA_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> */
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "IRE",  `cost' model(tfe) d(hnormal) posthessian robust // emean(`z_vlist') 
> usigma(`z_vlist') 

note: half_lnX_22 omitted because of collinearity
note: half_lnX_23 omitted because of collinearity
note: half_lnX_24 omitted because of collinearity
note: half_lnX_33 omitted because of collinearity
note: half_lnX_34 omitted because of collinearity
note: half_lnX_44 omitted because of collinearity
Warning: only units with more than 1 time occasion will be considered

initial:       Log pseudolikelihood =  -15429.57
Iteration 0:   Log pseudolikelihood =  -15429.57  (not concave)
Iteration 1:   Log pseudolikelihood = -2800.0857  (not concave)
Iteration 2:   Log pseudolikelihood = -536.43521  (not concave)
Iteration 3:   Log pseudolikelihood = -299.39958  (not concave)
Iteration 4:   Log pseudolikelihood = -260.16019  (not concave)
Iteration 5:   Log pseudolikelihood = -246.61717  (not concave)
Iteration 6:   Log pseudolikelihood = -226.72343  (not concave)
Iteration 7:   Log pseudolikelihood = -221.44275  (not concave)
Iteration 8:   Log pseudolikelihood = -218.45426  (not concave)
Iteration 9:   Log pseudolikelihood = -215.40971  (not concave)
Iteration 10:  Log pseudolikelihood = -189.03718  (not concave)
Iteration 11:  Log pseudolikelihood = -181.91903  (not concave)
Iteration 12:  Log pseudolikelihood = -179.17327  (not concave)
Iteration 13:  Log pseudolikelihood = -176.96351  (not concave)
Iteration 14:  Log pseudolikelihood = -174.80111  (not concave)
Iteration 15:  Log pseudolikelihood = -173.27635  (not concave)
Iteration 16:  Log pseudolikelihood =  -171.9405  (not concave)
Iteration 17:  Log pseudolikelihood = -170.65294  (not concave)
Iteration 18:  Log pseudolikelihood = -169.35984  (not concave)
Iteration 19:  Log pseudolikelihood = -168.10312  (not concave)
Iteration 20:  Log pseudolikelihood = -166.89054  (not concave)
Iteration 21:  Log pseudolikelihood = -165.70231  (not concave)
Iteration 22:  Log pseudolikelihood = -164.53793  (not concave)
Iteration 23:  Log pseudolikelihood = -163.40297  (not concave)
Iteration 24:  Log pseudolikelihood =  -162.2955  (not concave)
Iteration 25:  Log pseudolikelihood = -161.21259  (not concave)
Iteration 26:  Log pseudolikelihood = -160.15425  (not concave)
Iteration 27:  Log pseudolikelihood = -159.12038  (not concave)
Iteration 28:  Log pseudolikelihood = -158.10981  (not concave)
Iteration 29:  Log pseudolikelihood = -157.12163  (not concave)
Iteration 30:  Log pseudolikelihood = -156.15529  (not concave)
Iteration 31:  Log pseudolikelihood =  -155.2101  (not concave)
Iteration 32:  Log pseudolikelihood =  -154.2853  (not concave)
Iteration 33:  Log pseudolikelihood = -153.38022  (not concave)
Iteration 34:  Log pseudolikelihood = -152.49424  (not concave)
Iteration 35:  Log pseudolikelihood = -151.62672  (not concave)
Iteration 36:  Log pseudolikelihood = -150.77706  (not concave)
Iteration 37:  Log pseudolikelihood = -149.94466  (not concave)
Iteration 38:  Log pseudolikelihood = -149.12897  (not concave)
Iteration 39:  Log pseudolikelihood = -148.32946  (not concave)
Iteration 40:  Log pseudolikelihood = -147.54561  (not concave)
Iteration 41:  Log pseudolikelihood = -146.77691  (not concave)
Iteration 42:  Log pseudolikelihood =  -146.0229  (not concave)
Iteration 43:  Log pseudolikelihood = -145.28311  (not concave)
Iteration 44:  Log pseudolikelihood = -144.55711  (not concave)
Iteration 45:  Log pseudolikelihood = -143.84447  (not concave)
Iteration 46:  Log pseudolikelihood =  -143.1448  (not concave)
Iteration 47:  Log pseudolikelihood =  -142.4577  (not concave)
Iteration 48:  Log pseudolikelihood = -141.78281  (not concave)
Iteration 49:  Log pseudolikelihood = -141.11977  (not concave)
Iteration 50:  Log pseudolikelihood = -140.46824  (not concave)
Iteration 51:  Log pseudolikelihood = -139.82789  (not concave)
Iteration 52:  Log pseudolikelihood = -139.19841  (not concave)
Iteration 53:  Log pseudolikelihood = -138.57949  (not concave)
Iteration 54:  Log pseudolikelihood = -137.97086  (not concave)
Iteration 55:  Log pseudolikelihood = -137.37223  (not concave)
Iteration 56:  Log pseudolikelihood = -136.78333  (not concave)
Iteration 57:  Log pseudolikelihood = -136.20392  (not concave)
Iteration 58:  Log pseudolikelihood = -135.63375  (not concave)
Iteration 59:  Log pseudolikelihood = -135.07257  (not concave)
Iteration 60:  Log pseudolikelihood = -134.52017  (not concave)
Iteration 61:  Log pseudolikelihood = -133.97633  (not concave)
Iteration 62:  Log pseudolikelihood = -133.44084  (not concave)
Iteration 63:  Log pseudolikelihood =  -132.9135  (not concave)
Iteration 64:  Log pseudolikelihood = -132.39411  (not concave)
Iteration 65:  Log pseudolikelihood =  -131.8825  (not concave)
Iteration 66:  Log pseudolikelihood = -131.37847  (not concave)
Iteration 67:  Log pseudolikelihood = -130.88186  (not concave)
Iteration 68:  Log pseudolikelihood = -130.39251  (not concave)
Iteration 69:  Log pseudolikelihood = -129.91024  (not concave)
Iteration 70:  Log pseudolikelihood = -129.43492  (not concave)
Iteration 71:  Log pseudolikelihood = -128.96638  (not concave)
Iteration 72:  Log pseudolikelihood = -128.50449  (not concave)
Iteration 73:  Log pseudolikelihood = -128.04911  (not concave)
Iteration 74:  Log pseudolikelihood =  -127.6001  (not concave)
Iteration 75:  Log pseudolikelihood = -127.15733  (not concave)
Iteration 76:  Log pseudolikelihood = -126.72068  (not concave)
Iteration 77:  Log pseudolikelihood = -126.29003  (not concave)
Iteration 78:  Log pseudolikelihood = -125.86526  (not concave)
Iteration 79:  Log pseudolikelihood = -125.44625  (not concave)
Iteration 80:  Log pseudolikelihood =  -125.0329  (not concave)
Iteration 81:  Log pseudolikelihood =  -124.6251  (not concave)
Iteration 82:  Log pseudolikelihood = -124.22275  (not concave)
Iteration 83:  Log pseudolikelihood = -123.82574  (not concave)
Iteration 84:  Log pseudolikelihood = -123.43398  (not concave)
Iteration 85:  Log pseudolikelihood = -123.04738  (not concave)
Iteration 86:  Log pseudolikelihood = -122.66584  (not concave)
Iteration 87:  Log pseudolikelihood = -122.28927  (not concave)
Iteration 88:  Log pseudolikelihood = -121.91759  (not concave)
Iteration 89:  Log pseudolikelihood = -121.55072  (not concave)
Iteration 90:  Log pseudolikelihood = -121.18856  (not concave)
Iteration 91:  Log pseudolikelihood = -120.83105  (not concave)
Iteration 92:  Log pseudolikelihood =  -120.4781  (not concave)
Iteration 93:  Log pseudolikelihood = -120.12964  (not concave)
Iteration 94:  Log pseudolikelihood = -119.78558  (not concave)
Iteration 95:  Log pseudolikelihood = -119.44588  (not concave)
Iteration 96:  Log pseudolikelihood = -119.11044  (not concave)
Iteration 97:  Log pseudolikelihood =  -118.7792  (not concave)
Iteration 98:  Log pseudolikelihood =  -118.4521  (not concave)
Iteration 99:  Log pseudolikelihood = -118.12907  (not concave)
Iteration 100: Log pseudolikelihood = -117.81004  (not concave)

True fixed-effects model (half-normal)               Number of obs =       244
Group variable: pid                               Number of groups =        48
Time variable: year                             Obs per group: min =         2
                                                               avg =       5.1
                                                               max =         9

                                                     Prob > chi2   =    0.0000
Log pseudolikelihood =  -117.8100                    Wald chi2(9)  =  63584.91

                                   (Std. Err. adjusted for 48 clusters in pid)
------------------------------------------------------------------------------
             |               Robust
lndairypro~s |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
Frontier     |
        CD_1 |  -3.19e-06    .000021    -0.15   0.879    -.0000443    .0000379
        CD_2 |  -3.98e-06   6.03e-06    -0.66   0.510    -.0000158    7.85e-06
        CD_3 |   .0122951   .0077724     1.58   0.114    -.0029385    .0275287
        CD_4 |   .0001655   .0001369     1.21   0.226    -.0001027    .0004338
 half_lnX_11 |  -.2530788   .4281968    -0.59   0.554    -1.092329    .5861716
 half_lnX_12 |   .4288804   .2337343     1.83   0.067    -.0292304    .8869913
 half_lnX_13 |    .851048   .5029887     1.69   0.091    -.1347918    1.836888
 half_lnX_14 |   .2187843   .2841427     0.77   0.441    -.3381252    .7756939
 half_lnX_22 |   1.18e-18  (omitted)
 half_lnX_23 |   2.86e-19  (omitted)
 half_lnX_24 |   2.48e-19  (omitted)
 half_lnX_33 |  -1.36e-19  (omitted)
 half_lnX_34 |   2.87e-21  (omitted)
 half_lnX_44 |  -2.39e-20  (omitted)
       TREND |   .0730083   .0218136     3.35   0.001     .0302545    .1157621
-------------+----------------------------------------------------------------
Usigma       |
       _cons |  -471.3634          .        .       .            .           .
-------------+----------------------------------------------------------------
Vsigma       |
       _cons |  -1.860342   .3051054    -6.10   0.000    -2.458337   -1.262346
-------------+----------------------------------------------------------------
     sigma_u |   4.4e-103          .        .       .            .           .
     sigma_v |   .3944863     .06018     6.56   0.000     .2925357    .5319674
      lambda |   1.1e-102          .        .       .            .           .
------------------------------------------------------------------------------

. estimates store `model1name'_IRE_`tech_or_cost'

. estimates save `fadnoutdatadir'/`model1name'_IRE_`tech_or_cost'_$datestamp$timestamp.ster, replace
(note: file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_IRE_tech_2014_02_061257pm.ster not found)
file D:\Data/data_FADNPanelAnalysis/OutData/multisward/bc95_IRE_tech_2014_02_061257pm.ster saved

. di `e(converged)'
0

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "UKI",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist')
> estimates store `model1name'_UKI_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_UKI_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if atl_plains == 1, `cost'  model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usi
> gma(`z_vlist') vsigma(TREND)
> estimates store `model1name'_ATL_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_ATL_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if cont_eur == 1,   `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usig
> ma(`z_vlist') 
> estimates store `model1name'_CEU_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_CEU_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> * BEST RESULT Effect on Mu parameter = -0.0054 Sigma U Parameter = 2.308268 need to figure out partial effect for this. Non-monoto
> nic effect of grass. HARD CODE for reference. 
> *sfpanel lntotalspecificcosts lndairyproducts lnPTotalCattle lnPCompoundfeedingstuffsforcatt lnPFERTILISERSANDSOILIMPROVERS TREND 
> , cost model(bc95) d(tnormal) posthessian robust emean(lngrassratio lnspecial) usigma(lngrassratio lnspecial) vsigma(TREND)
> 
> sfpanel `dep_vlist' `indep_vlist' TREND , `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') usigma(`z_vlist') vsig
> ma(TREND)
> estimates store `model1name'_ALL_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_ALL_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> */
. log close
      name:  <unnamed>
       log:  D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.txt
  log type:  text
 closed on:   6 Feb 2014, 12:57:45
------------------------------------------------------------------------------------------------------------------------------------
------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.txt
  log type:  text
 opened on:   6 Feb 2014, 12:58:07

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  12:58:07  on  6 Feb 2014

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(cmdlog D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file D:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') vs
> igma(TREND)
> estimates store `model1name'_DEU_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_DEU_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "FRA",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist') vsigma(TREND)
> estimates store `model1name'_FRA_`tech_or_cost' 
> estimates save `fadnoutdatadir'/`model1name'_FRA_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> */
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "IRE",  `cost' model(tre) d(hnormal) posthessian robust // emean(`z_vlist') 
> usigma(`z_vlist') 

note: half_lnX_22 omitted because of collinearity
note: half_lnX_23 omitted because of collinearity
note: half_lnX_24 omitted because of collinearity
note: half_lnX_33 omitted because of collinearity
note: half_lnX_34 omitted because of collinearity
note: half_lnX_44 omitted because of collinearity

initial:       Log simulated-likelihood =  -231.1187
could not calculate numerical derivatives -- flat or discontinuous region encountered
could not calculate numerical derivatives -- flat or discontinuous region encountered
could not calculate numerical derivatives -- flat or discontinuous region encountered
could not calculate numerical derivatives -- flat or discontinuous region encountered
scores returned by evaluator not conformable with the dataset
r(503);

end of do-file

r(503);

. do msward_2014_02_06_cost.do

. * Based on msward_code_clarity.do
. capture log close
------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.txt
  log type:  text
 opened on:   6 Feb 2014, 12:58:43

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  12:58:43  on  6 Feb 2014

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(cmdlog D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file D:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') vs
> igma(TREND)
> estimates store `model1name'_DEU_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_DEU_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "FRA",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist') vsigma(TREND)
> estimates store `model1name'_FRA_`tech_or_cost' 
> estimates save `fadnoutdatadir'/`model1name'_FRA_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> */
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "IRE",  `cost' model(tre) d(exp) posthessian robust // emean(`z_vlist') usig
> ma(`z_vlist') 

note: half_lnX_22 omitted because of collinearity
note: half_lnX_23 omitted because of collinearity
note: half_lnX_24 omitted because of collinearity
note: half_lnX_33 omitted because of collinearity
note: half_lnX_34 omitted because of collinearity
note: half_lnX_44 omitted because of collinearity

initial:       Log simulated-likelihood = -207.75562
could not calculate numerical derivatives -- flat or discontinuous region encountered
could not calculate numerical derivatives -- flat or discontinuous region encountered
could not calculate numerical derivatives -- flat or discontinuous region encountered
could not calculate numerical derivatives -- flat or discontinuous region encountered
scores returned by evaluator not conformable with the dataset
r(503);

end of do-file

r(503);

. do msward_2014_02_06_cost.do

. * Based on msward_code_clarity.do
. capture log close
------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.txt
  log type:  text
 opened on:   6 Feb 2014, 12:59:04

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  12:59:04  on  6 Feb 2014

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(cmdlog D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file D:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') vs
> igma(TREND)
> estimates store `model1name'_DEU_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_DEU_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "FRA",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist') vsigma(TREND)
> estimates store `model1name'_FRA_`tech_or_cost' 
> estimates save `fadnoutdatadir'/`model1name'_FRA_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> */
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "IRE",  `cost' model(tre) d(gamma) posthessian robust // emean(`z_vlist') us
> igma(`z_vlist') 
distribution(gamma) not allowed
r(198);

end of do-file

r(198);

. help sfpanel

. do msward_2014_02_06_cost.do

. * Based on msward_code_clarity.do
. capture log close
------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.txt
  log type:  text
 opened on:   6 Feb 2014, 13:00:38

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  13:00:38  on  6 Feb 2014

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(cmdlog D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file D:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') vs
> igma(TREND)
> estimates store `model1name'_DEU_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_DEU_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "FRA",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist') vsigma(TREND)
> estimates store `model1name'_FRA_`tech_or_cost' 
> estimates save `fadnoutdatadir'/`model1name'_FRA_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> */
. sfpanel `dep_vlist' `indep_vlist' TREND if country == "IRE",  `cost' model(tre) d(tnormal) posthessian robust // emean(`z_vlist') 
> usigma(`z_vlist') 

note: half_lnX_22 omitted because of collinearity
note: half_lnX_23 omitted because of collinearity
note: half_lnX_24 omitted because of collinearity
note: half_lnX_33 omitted because of collinearity
note: half_lnX_34 omitted because of collinearity
note: half_lnX_44 omitted because of collinearity

initial:       Log simulated-likelihood =  -460.0904
could not calculate numerical derivatives -- flat or discontinuous region encountered
could not calculate numerical derivatives -- flat or discontinuous region encountered
could not calculate numerical derivatives -- flat or discontinuous region encountered
could not calculate numerical derivatives -- flat or discontinuous region encountered
scores returned by evaluator not conformable with the dataset
r(503);

end of do-file

r(503);

. do msward_2014_02_06_cost.do

. * Based on msward_code_clarity.do
. capture log close
------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.txt
  log type:  text
 opened on:   6 Feb 2014, 13:01:46

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  13:01:46  on  6 Feb 2014

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(cmdlog D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file D:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') vs
> igma(TREND)
> estimates store `model1name'_DEU_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_DEU_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "FRA",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist') vsigma(TREND)
> estimates store `model1name'_FRA_`tech_or_cost' 
> estimates save `fadnoutdatadir'/`model1name'_FRA_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> */
. xtreg  `dep_vlist' `indep_vlist' TREND, re
note: half_lnX_12 dropped because of collinearity
note: half_lnX_13 dropped because of collinearity
note: half_lnX_14 dropped because of collinearity
note: half_lnX_23 dropped because of collinearity
note: half_lnX_24 dropped because of collinearity
note: half_lnX_34 dropped because of collinearity

Random-effects GLS regression                   Number of obs      =      4669
Group variable: pid                             Number of groups   =      1790

R-sq:  within  = 0.3216                         Obs per group: min =         1
       between = 0.7050                                        avg =       2.6
       overall = 0.7131                                        max =         9

                                                Wald chi2(9)       =   5352.34
corr(u_i, X)   = 0 (assumed)                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
lndairypro~s |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        CD_1 |   8.20e-07   1.23e-06     0.67   0.506    -1.59e-06    3.23e-06
        CD_2 |  -1.29e-07   3.10e-07    -0.42   0.678    -7.37e-07    4.80e-07
        CD_3 |   .0033095   .0003101    10.67   0.000     .0027017    .0039173
        CD_4 |   .0000129   4.60e-06     2.81   0.005     3.90e-06    .0000219
 half_lnX_11 |   .0083939   .0091374     0.92   0.358    -.0095151     .026303
 half_lnX_22 |   .1333667   .0091817    14.53   0.000      .115371    .1513624
 half_lnX_33 |   .4580001   .0154431    29.66   0.000     .4277322     .488268
 half_lnX_44 |   .0031143   .0104698     0.30   0.766    -.0174061    .0236348
       TREND |   .0255839   .0026289     9.73   0.000     .0204313    .0307364
       _cons |   9.099939   .1206447    75.43   0.000      8.86348    9.336399
-------------+----------------------------------------------------------------
     sigma_u |  .62450928
     sigma_e |   .2822531
         rho |  .83038017   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. STOP!!
unrecognized command:  STOP
r(199);

end of do-file

r(199);

. ereturn list

scalars:
               e(rank) =  10
               e(df_m) =  9
               e(chi2) =  5352.335395736562
                  e(p) =  0
            e(sigma_u) =  .6245092792538759
            e(sigma_e) =  .2822531049393819
              e(sigma) =  .6853310551274597
                e(rho) =  .8303801665689742
               e(rmse) =  .2889859113700812
                  e(N) =  4669
               e(Tbar) =  1.640276593949726
               e(Tcon) =  0
                e(N_g) =  1790
              e(g_min) =  1
              e(g_avg) =  2.608379888268157
              e(g_max) =  9
           e(thta_min) =  .5881507151505228
             e(thta_5) =  .5881507151505228
            e(thta_50) =  .6955838664706446
            e(thta_95) =  .831614414336878
               e(r2_w) =  .3215967530270643
               e(r2_b) =  .7050206478674699
               e(r2_o) =  .7131303555152575
           e(thta_max) =  .8510278066257599

macros:
            e(cmdline) : "xtreg lndairyproducts   CD_1 CD_2 CD_3 CD_4   half_lnX_11 half_lnX_12 half_lnX_13 half_lnX_14 half_lnX.."
                e(cmd) : "xtreg"
       e(marginsnotok) : "E U UE SCore STDP XBU"
            e(predict) : "xtrere_p"
              e(model) : "re"
               e(ivar) : "pid"
                e(vce) : "conventional"
             e(depvar) : "lndairyproducts"
           e(chi2type) : "Wald"
         e(properties) : "b V"

matrices:
                  e(b) :  1 x 10
                  e(V) :  10 x 10
              e(theta) :  1 x 5
               e(VCEf) :  10 x 10
                 e(bf) :  1 x 10

functions:
             e(sample)   

. matrix list e(b)

e(b)[1,10]
           CD_1         CD_2         CD_3         CD_4  half_lnX_11  half_lnX_22  half_lnX_33  half_lnX_44        TREND
y1    8.195e-07   -1.289e-07    .00330952    .00001292    .00839393    .13336669    .45800011    .00311433    .02558387

          _cons
y1    9.0999394

. do msward_2014_02_06_cost.do

. * Based on msward_code_clarity.do
. capture log close
------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.txt
  log type:  text
 opened on:   6 Feb 2014, 13:04:00

. di  "Job  Started  at  $S_TIME  on $S_DATE"
Job  Started  at  13:04:00  on  6 Feb 2014

. cmdlog using logs/$project$datestamp.cmd.txt, append 
(cmdlog D:\Data\data_FADNPanelAnalysis\Do_Files\multisward\logs/multisward2014_02_06.cmd.txt opened)

. 
. 
. 
. 
. preserve

. 
. 
. drop country

. gen int country = countrycode2

. keep pid year country `dep_vlist' `indep_vlist' `z_vlist' TREND

. 
. outsheet _all using `fadnoutdatadir'/exported_data.csv, comma replace nolabel

. save `fadnoutdatadir'/exported_data.dta, replace nolabel
file D:\\Data/data_FADNPanelAnalysis/OutData/multisward/exported_data.dta saved

. 
. restore

. 
. 
. 
. * ===================
. * MODEL COMMANDS HERE
. * ===================
. if "`cost'"=="cost"{
.         local   tech_or_cost    "cost"
. }

. else{
.         local   tech_or_cost    "tech"
. }

. /*
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "DEU",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') vs
> igma(TREND)
> estimates store `model1name'_DEU_`tech_or_cost'
> estimates save `fadnoutdatadir'/`model1name'_DEU_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> 
> sfpanel `dep_vlist' `indep_vlist' TREND if country == "FRA",  `cost' model(bc95) d(tnormal) posthessian robust emean(`z_vlist') us
> igma(`z_vlist') vsigma(TREND)
> estimates store `model1name'_FRA_`tech_or_cost' 
> estimates save `fadnoutdatadir'/`model1name'_FRA_`tech_or_cost'_$datestamp$timestamp.ster, replace
> di `e(converged)'
> */
. xtreg  `dep_vlist' `indep_vlist' TREND, re
note: half_lnX_12 dropped because of collinearity
note: half_lnX_13 dropped because of collinearity
note: half_lnX_14 dropped because of collinearity
note: half_lnX_23 dropped because of collinearity
note: half_lnX_24 dropped because of collinearity
note: half_lnX_34 dropped because of collinearity

Random-effects GLS regression                   Number of obs      =      4669
Group variable: pid                             Number of groups   =      1790

R-sq:  within  = 0.3216                         Obs per group: min =         1
       between = 0.7050                                        avg =       2.6
       overall = 0.7131                                        max =         9

                                                Wald chi2(9)       =   5352.34
corr(u_i, X)   = 0 (assumed)                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
lndairypro~s |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        CD_1 |   8.20e-07   1.23e-06     0.67   0.506    -1.59e-06    3.23e-06
        CD_2 |  -1.29e-07   3.10e-07    -0.42   0.678    -7.37e-07    4.80e-07
        CD_3 |   .0033095   .0003101    10.67   0.000     .0027017    .0039173
        CD_4 |   .0000129   4.60e-06     2.81   0.005     3.90e-06    .0000219
 half_lnX_11 |   .0083939   .0091374     0.92   0.358    -.0095151     .026303
 half_lnX_22 |   .1333667   .0091817    14.53   0.000      .115371    .1513624
 half_lnX_33 |   .4580001   .0154431    29.66   0.000     .4277322     .488268
 half_lnX_44 |   .0031143   .0104698     0.30   0.766    -.0174061    .0236348
       TREND |   .0255839   .0026289     9.73   0.000     .0204313    .0307364
       _cons |   9.099939   .1206447    75.43   0.000      8.86348    9.336399
-------------+----------------------------------------------------------------
     sigma_u |  .62450928
     sigma_e |   .2822531
         rho |  .83038017   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. sfpanel `dep_vlist' `indep_vlist' TREND if country == "IRE",  `cost' model(tre) d(tnormal) posthessian robust svfrontier(e(b))// e
> mean(`z_vlist') usigma(`z_vlist') 

note: half_lnX_22 omitted because of collinearity
note: half_lnX_23 omitted because of collinearity
note: half_lnX_24 omitted because of collinearity
note: half_lnX_33 omitted because of collinearity
note: half_lnX_34 omitted because of collinearity
note: half_lnX_44 omitted because of collinearity
User specified starting values in svfrontier() do not match frontier's regressors number
invalid syntax
r(198);

end of do-file

r(198);

. exit, clear
